{"I":"ACC109","T":"ACC 109 The Accounting Cycle","D":"Introduction to the basic accounting concepts related to the processing of transactions and preparation of an income statement and balance sheet. A student who has received credit for ACC 201 at the time of enrollment in ACC 109 will not receive credit for ACC 109. ","P":"","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"ACC121","T":"ACC 121 Individual Tax Return Preparation","D":"Principles of income tax with emphasis on the preparation of returns for individual taxpayers. Attention will be given to the proper reporting of income and deduction items. ","P":"","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"ACC201","T":"ACC 201 Introduction to Financial Accounting","D":"Methods and procedures employed in financial accounting with emphasis on development and interpretation of financial statements. Credit by examination is available. A grade of &quot;B&quot; or better is required to take ACC 301, 321, or 532. ","P":"<em>Prerequisite: completion of 24 hours; and MSU GPA of 2.00; and combined (MSU and transfer) GPA of 2.00; and the math general education requirement with a grade of &quot;C&quot; or better.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC206","T":"ACC 206 Accounting Choices and Methods","D":"Comprehensive and accelerated examination of alternative accounting models, including electronic spreadsheet models, and their uses. Replaces ACC 201 and 211 for Honors College students. A grade of &quot;C&quot; or better is required in this course in order to take ACC 311. A grade of &quot;B&quot; or better is required in this course in order to take ACC 301 or ACC 321 or ACC 532. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: UHC 110.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":4,"L":0}}
{"I":"ACC209","T":"ACC 209 Accounting Applications for Microcomputers","D":"Use of the microcomputer and electronic spreadsheets to master the basic accounting cycle. ","P":"","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"ACC211","T":"ACC 211 Introduction to Managerial Accounting","D":"Methods and procedures employed in managerial accounting with emphasis on the use of accounting data for decision making. At least one spreadsheet project will be assigned. A grade of &quot;C&quot; or better is required in this course in order to take ACC 311. A grade of &quot;B&quot; or better is required in this course in order to take ACC 301. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: ACC 201; and CIS 201 or concurrent enrollment.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC297","T":"ACC 297 Topics in Accounting","D":"A variable content course with topics that can change from semester to semester. Topics are identified by title in the schedule of classes. ","P":"","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ACC300","T":"ACC 300 Professionalism in Accountancy","D":"Cases (including written and oral presentations) will focus on ethical and regulatory issues in accounting. Students will focus on professional behavior appropriate for accounting professionals. A grade of &quot;C&quot; or better is required in this course in order to take ACC 302 and ACC 341. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;B&quot; or better in ACC 201 and ACC 211, or grade of &quot;B&quot; or better in ACC 206, or grade of &quot;B&quot; or better in ACC 600; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"ACC301","T":"ACC 301 Intermediate Accounting I","D":"Financial Accounting Theory applications to the accounting process of corporations. Review of financial statements; accounting for current and long-term assets. A grade of &quot;C&quot; or better is required in this course in order to take ACC 302, 341, 553, or 653. Cannot be taken Pass/Not Pass. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;B&quot; or better in ACC 201 and ACC 211 or grade of &quot;B&quot; or better in ACC 206 or ACC 600; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC302","T":"ACC 302 Intermediate Accounting II","D":"Continuation of intermediate accounting. Accounting for liabilities and equity. A grade of &quot;C&quot; or better is required in this course in order to take ACC 504, 604, 506, 606, 553, or 653. Cannot be taken Pass/Not Pass. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 300 and ACC 301; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC311","T":"ACC 311 Managerial Cost Accounting","D":"Function of cost accounting; means and methods of its applications in specific accounting situations. A grade of &quot;C&quot; or better is required in this course in order to take ACC 513, 613, 553, or 653. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in one of ACC 211 or ACC 206 or ACC 600; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC321","T":"ACC 321 Tax Accounting I","D":"Principles of income tax accounting; current laws and income tax problems of individuals. A grade of &quot;C&quot; or better is required in this course in order to take ACC 524, 624, 525, 625, 553 or 653. Cannot be taken Pass/Not Pass. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;B&quot; or better in one of ACC 201 or ACC 206 or ACC 600; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC341","T":"ACC 341 Accounting and Management Information Systems","D":"Accounting system examined as a crucial base for the desired comprehensive management information system of an organization. Impact of the computer on accounting systems controls and the auditing of EDP based accounting systems. A grade of &quot;C&quot; or better is required in this course in order to take ACC 553 OR 653. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 300 and ACC 301; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC394","T":"ACC 394 Cooperative Education in Accounting","D":"The opportunity to earn academic credit in a planned learning process that integrates academic training with a supervised work experience. This is a variable content course that may be repeated to a total of 6 semester hours in Cooperative Education. ","P":"<em>Prerequisite: permission of the School of Accountancy Director; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ACC397","T":"ACC 397 Topics in Accounting","D":"A variable content course with topics that can change from semester to semester. Topics are identified by title in the schedule of classes. Examples are: inflation accounting, management advisory services, public utility accounting, financial reporting to regulatory agencies. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ACC421","T":"ACC 421 Volunteer Income Tax Assistance VITA","D":"Field work in the preparation of individual income tax return (state and federal) covering topics of gross income, deductions and credits. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 321; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"ACC422","T":"ACC 422 Advanced Volunteer Income Tax Assistance VITA","D":"Experience in the planning and scheduling of the VITA program and provides final review of actual income tax returns prepared under field conditions. ","P":"<em>Prerequisite: undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"ACC494","T":"ACC 494 Internship in Accounting","D":"Internship experience in an organization emphasizing public, managerial or not-for-profit accounting. ","P":"<em>Prerequisite: 20 hours of accounting courses and permission of the School of Accountancy Director; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":5,"E":0,"L":10}}
{"I":"ACC496","T":"ACC 496 Readings in Business Administration-Accounting","D":"Planned readings designed to intensify and supplement the area of accounting. ","P":"<em>Prerequisite: permission of the School of Accountancy Director; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ACC504","T":"ACC 504 Advanced Accounting","D":"Study of accounting for pensions, deferred taxes, business combinations, partnerships, and certain multicurrency accounting issues. May be taught concurrently with ACC 604. Cannot receive credit for both ACC 604 and ACC 504. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 302; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC506","T":"ACC 506 International Accounting","D":"Accounting practices in different nations; multi-national corporation and selected accounting problems. May be taught concurrently with ACC 606. Cannot receive credit for both ACC 506 and ACC 606. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 302; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC513","T":"ACC 513 Managerial Cost Accounting II","D":"A continuation of the topics examined in ACC 311. Specific topics covered include activity-based costing, strategic cost management, activity- and strategic-based responsibility accounting, quality costing, measurement and control of productivity, environmental cost management, cost-volume-profit analysis, activity resource usage, relevant costing, pricing and profitability analysis, capital investment decisions, and inventory management topics such as economic order quantity, just-in-time, and the theory of constraints. May be taught concurrently with ACC 613. Cannot receive credit for both ACC 513 and ACC 613. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 311; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC524","T":"ACC 524 Tax Accounting II","D":"Principles of federal tax accounting; research in income tax problems of partnerships and corporations; estate and gift tax problems of individuals. May be taught concurrently with ACC 624. Cannot receive credit for both ACC 524 and ACC 624. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 321; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC525","T":"ACC 525 Individual Income Tax Assistance","D":"To provide undergraduate/graduate students with an opportunity to integrate intermediate tax accounting skills, critical thinking skills, communication skills, and research skills with community service. This course provides service-learning experience in the preparation and review of actual individual income tax returns (both federal and state) as well as the social and ethical issues inherent in US tax policy. May be taught concurrently with ACC 625. Cannot receive credit for both ACC 525 and ACC 625. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 321; and permission of instructor; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"ACC532","T":"ACC 532 Governmental and Not-For-Profit Organizational Accounting","D":"Governmental and not-for-profit organizational accounting records and funds, budgeting, budget control, analysis and interpretation of financial statements. May be taught concurrently with ACC 632. Cannot receive credit for both ACC 532 and ACC 632. Research assignments are required. ","P":"<em>Prerequisite: 75 hours; and a grade of &quot;C&quot; or better in ACC 301; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC553","T":"ACC 553 Auditing","D":"Kinds of audits, the duties and obligations of the auditor, principles and procedures to be followed in conducting an audit. A grade of &quot;C&quot; or better is required in this course in order to take ACC 703, 750, 751, 752, 754 and 790. This course has a required assessment component. Cannot be taken Pass/Not Pass. May be taught concurrently with ACC 653. Cannot receive credit for both ACC 553 and ACC 653. Research assignments are required. ","P":"<em>Prerequisite: grades of &quot;C&quot; or better in ACC 300 and ACC 301 and ACC 302 and ACC 311 and ACC 321 and ACC 341; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC555","T":"ACC 555 Internal Auditing","D":"Functions of internal audit, financial audit, and operations audit; importance of the changing professional status of the internal auditor. May be taught concurrently with ACC 655. Cannot receive credit for both ACC 655 and ACC 555. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 341; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC556","T":"ACC 556 Operational Auditing","D":"Primarily a case study approach covering nonfinancial audits of efficient and effective resource utilization, accomplishment of operational goals, adherence to laws and regulations, fraud prevention and detection, integrity and security of computer systems, and achievement of program goals. May be taught concurrently with ACC 656. Cannot receive credit for both ACC 656 and ACC 556. ","P":"<em>Prerequisite: 60 hours; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC596","T":"ACC 596 Research Issues and Problems: Accounting","D":"Research issues and projects growing from particular needs which may require additional depth or breadth of study. Outline of study must be approved prior to enrolling. May be repeated to a total of 3 hours. May be taught concurrently with ACC 695. Cannot receive credit for both ACC 695 and ACC 596. ","P":"<em>Prerequisite: 60 hours and permission of the School of Accountancy Director; and undergraduate business majors must be admitted to degree program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ACC600","T":"ACC 600 Accounting Concepts for Managers","D":"Comprehensive study of the fundamentals of financial and managerial accounting. Designed for graduate students who have not had an undergraduate course in accounting. Will not be counted in the hours required for a College of Business graduate degree. ","P":"<em>Prerequisite: permission of a director of a College of Business graduate program or the director of the MS in Administrative Studies program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC604","T":"ACC 604 Advanced Accounting","D":"Study of accounting for pensions, deferred taxes, business combinations, partnerships, and certain multicurrency accounting issues. May be taught concurrently with ACC 504. Cannot receive credit for both ACC 504 and ACC 604. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 302; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC606","T":"ACC 606 International Accounting","D":"Accounting practices in different nations; multi-national corporation and selected accounting problems. May be taught concurrently with ACC 506. Cannot receive credit for both ACC 506 and ACC 606. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 302; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC613","T":"ACC 613 Managerial Cost Accounting II","D":"A continuation of the topics examined in ACC 311. Specific topics covered include activity-based costing, strategic cost management, activity- and strategic-based responsibility accounting, quality costing, measurement and control of productivity, environmental cost management, cost-volume-profit analysis, activity resource usage, relevant costing, pricing and profitability analysis, capital investment decisions, and inventory management topics such as economic order quantity, just-in-time, and the theory of constraints. May be taught concurrently with ACC 513. Cannot receive credit for both ACC 513 and ACC 613. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 311 and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC624","T":"ACC 624 Tax Accounting II","D":"Principles of federal tax accounting; research in income tax problems of partnerships and corporations; estate and gift tax problems of individuals. May be taught concurrently with ACC 524. Cannot receive credit for both ACC 524 and ACC 624. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 321; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC625","T":"ACC 625 Individual Income Tax Assistance","D":"To provide students with an opportunity to integrate intermediate tax accounting skills, critical thinking skills, communication skills, and research skills with community service. This course provides service-learning experience in the preparation and review of actual individual income tax returns (both federal and state) as well as the social and ethical issues inherent in US tax policy. May be taught concurrently with ACC 525. Cannot receive credit for both ACC 525 and ACC 625. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 321; and permission of instructor; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"ACC632","T":"ACC 632 Governmental and Not-For-Profit Organizational Accounting","D":"Governmental and not-for-profit organizational accounting records and funds, budgeting, budget control, analysis and interpretation of financial statements. May be taught concurrently with ACC 532. Cannot receive credit for both ACC 532 and ACC 632. Research assignments are required. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 301; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC653","T":"ACC 653 Auditing","D":"Kinds of audits, the duties and obligations of the auditor, principles and procedures to be followed in conducting an audit. A grade of &quot;C&quot; or better is required in this course in order to take ACC 703, 750, 751, 752, 754 and 790. This course has a required assessment component. May be taught concurrently with ACC 553. Cannot receive credit for both ACC 553 and ACC 653. Research assignments are required. ","P":"<em>Prerequisite: grades of &quot;C&quot; or better in ACC 300 and ACC 301 and ACC 302 and ACC 311 and ACC 321 and ACC 341; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC655","T":"ACC 655 Internal Auditing","D":"Functions of internal audit, financial audit, and operations audit; importance of the changing professional status of the internal auditor. May be taught concurrently with ACC 555. Cannot receive credit for both ACC 555 and ACC 655. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 341; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC656","T":"ACC 656 Operational Auditing","D":"Primarily a case study approach covering nonfinancial audits of efficient and effective resource utilization, accomplishment of operational goals, adherence to laws and regulations, fraud prevention and detection, integrity and security of computer systems, and achievement of program goals. May be taught concurrently with ACC 556. Cannot receive credit for both ACC 556 and ACC 656. ","P":"<em>Prerequisite: admitted to MAcc Program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC688","T":"ACC 688 Healthcare Accounting Concepts","D":"The role of accounting in the financial and operational management of healthcare organizations is approached via an introduction to healthcare financial and managerial accounting principles. This course addresses the definition of financial accounting; external reporting; development and use of the income statement, balance sheet and statement of cash flows. The course also addresses the managerial accounting topics of cost behavior and allocation; accounting data for pricing and service decisions; planning and budgeting in healthcare organizations; analysis of financial condition; and selected topics in ethics. The course is a core requirement for Master of Health Administration students and may be of interest to students in other graduate programs. Note that ACC 688 cannot be substituted for ACC 711 in the MBA program and cannot be counted in the 33 semester hours required for the MAcc degree. ","P":"","L":"courses_ac","O":{"F":false,"S":true,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC695","T":"ACC 695 Research Issues and Problems: Accounting","D":"Research issues and projects growing from particular needs which may require additional depth or breadth of study. Outline of study must be approved prior to enrolling. May be repeated to a total of 3 hours. May be taught concurrently with ACC 596. Cannot receive credit for both ACC 596 and ACC 695. ","P":"<em>Prerequisite: permission of the School of Accountancy Director; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ACC703","T":"ACC 703 Seminar in Accounting Theory","D":"Critical evaluation and interpretation of accounting theory. Completion of a significant research project. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 653 or ACC 553; and grade of &quot;C&quot; or better in ACC 604 or ACC 504; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC705","T":"ACC 705 Advanced Financial Accounting Problems","D":"An in-depth study of contemporary advanced financial accounting topics for professional accountants. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 302; and grade of &quot;C&quot; or better in ACC 504 or ACC 604; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC711","T":"ACC 711 Managerial Accounting","D":"Role of accounting in improving the practice of business management; budgeting, accounting analysis, the behavior of costs, accounting control. This course will not be counted in the 33 semester hours required for the MACC degree. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 211 or ACC 206 or ACC 600; and admitted to MBA or MHA program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC712","T":"ACC 712 Controllership and Communication","D":"An in-depth examination of the leadership and communication challenges associated with being a controller and/or professional accountant. The written and oral communication skills required for success as a professional accountant will be developed. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 311 or in ACC 711; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC715","T":"ACC 715 Advanced Cost Accounting","D":"An in-depth study of contemporary topics for cost accountants. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 613 or in ACC 513; and admitted to the MAcc Program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC721","T":"ACC 721 Advanced Tax Accounting","D":"Case study approach to develop tax research, analytical, and communication skills. Incorporated into the case studies are ethical and legal constraints within which tax practitioners are obligated to operate. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 321; and grade of &quot;C&quot; or better in ACC 624 or in ACC 524; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC722","T":"ACC 722 Public Service Tax Accounting","D":"Students will learn theoretical foundations in public service tax accounting topics and develop skills; which will apply to practical situations that will help students be better citizens and employees. Students will assist low-income, elderly, and English as Second Language taxpayers in the community in identifying and meeting their tax rights and responsibilities. ","P":"<em>Prerequisite: permission of instructor; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":3}}
{"I":"ACC723","T":"ACC 723 Tax Considerations for Decision Makers","D":"Tax course with emphasis on recognizing and understanding the importance of tax considerations in the process of making decisions in business and personal matters; developing a tax institution to anticipate and understand the effect of prospective tax law changes; examining U.S. tax policy issues; and motivating students to a lifetime of learning by engaging them in independent study. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 624 or in ACC 524; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC726","T":"ACC 726 Regulation Issues for Accountants","D":"The course is designed to provide students with a focused intensive study of regulation issues particularly relevant to professional accountants. ","P":"<em>Prerequisite: ACC 624 or ACC 524; and admitted to the MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC731","T":"ACC 731 Control of Non-Profit Organizations","D":"Case study approach to financial control in non-profit organizations. Special emphasis is on governmental and health care organizations, although other non-profit organizations are also studied. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 311 or in ACC 711; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC741","T":"ACC 741 Advanced Accounting and Management Information Systems","D":"Application of the concepts of systems design and implementation. Study of the attributes of accounting information systems and their relationship with management information systems. Functions of accounting information systems including data collection and transmission, internal controls, data organizations and storage, processing data, and information retrieval and display. Characteristics and applications of both manual and automated information systems. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 341; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC750","T":"ACC 750 Advanced Auditing","D":"An in-depth study of contemporary topics for auditing professionals. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 653 or in ACC 553; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC751","T":"ACC 751 Computer Forensics and IT Auditing","D":"A study of information systems controls; auditing around, through, and with the computer; auditing advanced computer systems, spreadsheets and other fourth generation language applications. Hands-on computer auditing projects will be integrated into the course. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 653 or in ACC 553; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC752","T":"ACC 752 Fraud Examination","D":"An in-depth study of the fraud examination process, including fraud prevention, detection, investigation, and management and employee fraud, and the legal aspects of fraud. Case studies are used extensively throughout the course. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 653 or in ACC 553; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC754","T":"ACC 754 Forensic Accounting: Litigation Support and Expert Witnessing","D":"This course explores one of the major areas of practice in forensic accounting. The course provides an in-depth investigation into the world of accounting litigation support and financial expert witnessing. The course requires students to actively participate in case analysis, development of expert reports, deposition testimony, and trial testimony. Students are exposed to the legal issues that impact on their role as an expert witness. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 653 or ACC 553; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC762","T":"ACC 762 Business and Accounting Concepts for Accountants","D":"The course is designed to provide students with a focused, intensive study of business and accounting concepts particularly relevant to professional accountants. ","P":"<em>Prerequisite: admitted to the MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC790","T":"ACC 790 Seminar in Accounting","D":"Critical evaluation and interpretation of the current research and professional literature in accounting. Study of ethical and institutional features of the accounting environment. Completion of a significant research project. ","P":"<em>Prerequisite: grade of &quot;C&quot; or better in ACC 653 or ACC 553; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC794","T":"ACC 794 Internship: Accounting","D":"In consultation with the coordinating professor, the student is engaged in first-hand experience with a business, organization, or other professional entity. A portfolio of assigned work shall be collected, examined, and evaluated during the semester. ","P":"<em>Prerequisite: 12 graduate hours of accounting courses; and permission of instructor; and admitted to MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ACC796","T":"ACC 796 Independent Study-Accounting","D":"In consultation with coordinating professor, student selects for intensive study of a specific area of concern related to the student&apos;s program, with emphasis on research. ","P":"<em>Prerequisite: permission of instructor; and admitted to the MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ACC797","T":"ACC 797 Special Topics in Accounting","D":"In-depth study of contemporary topics in accounting. Each offering concerns a single topic. May be repeated with departmental permission to a total of 9 hours. ","P":"<em>Prerequisite: 9 graduate hours of accounting courses; and admitted to the MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ACC799","T":"ACC 799 Thesis","D":"Independent research and study connected with preparation of thesis. ","P":"<em>Prerequisite: permission of instructor; and admitted to the MAcc program.</em>","L":"courses_ac","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
