{"I":"DAN125","T":"DAN 125 Tap Dance I","D":"Basic elements of tap dance, stylized steps and terminology coordinated with the rhythmic structure of tap dance. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"DAN130","T":"DAN 130 Dance Fundamentals I","D":"First course in the fundamentals of classical ballet and modern dance techniques, with an emphasis on alignment and basic movement vocabulary. Designed for students with little or no experience. First course in a two-semester module. Variable content course. May be repeated to a maximum of 6 hours. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN131","T":"DAN 131 Dance Fundamentals II","D":"Second course in the fundamentals of classical ballet and modern dance techniques, with an emphasis on alignment and basic movement vocabulary. Designed for students with little or no dance experience. Variable content course. May be repeated for a maximum of 6 hours. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN146","T":"DAN 146 Jazz Dance I-B","D":"Continues development of the basic fundamentals of jazz dance technique and vocabulary. Designed for students with at least one year of formal dance training. May be repeated to a total of 4 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN180","T":"DAN 180 Introduction to the Dance","D":"Survey of dance from a historical retrospective through the creative process. Emphasis will be placed on historical multi-cultural and societal influences on dance. The approach will be from the viewpoint of the audience to help heighten awareness of and increase critical thinking in relationship to the artistic experience. Buying tickets to and attendance at local productions required. ","P":"<em>General Education Course (Focus on the Arts).</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"DAN216","T":"DAN 216 Elementary Modern Dance","D":"Explores elements of modern dance technique. Designed for students with at least one year of formal dance training. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN225","T":"DAN 225 Tap Dance II","D":"Elementary tap dance technique and vocabulary. Variable content course. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"DAN230","T":"DAN 230 Elementary Ballet","D":"Elementary classical ballet technique and vocabulary. This course is designed for students with at least one to two years of formal and consistent ballet training. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN235","T":"DAN 235 Mens Dance Technique I","D":"Basic techniques for the male dancer. Emphasis will be on strength building and developing the male dancer&apos;s technique and style. Variable content course. May be repeated to a total of 4 hours. ","P":"<em>Prerequisite: DAN 216 and DAN 230.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN245","T":"DAN 245 Elementary Jazz Dance","D":"Continues development of jazz dance technique and vocabulary. Elementary level technique designed for students with at least one year of formal dance training. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN316","T":"DAN 316 Intermediate Modern Dance","D":"Intermediate level modern dance technique. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN319","T":"DAN 319 Contact Improvisation","D":"Contemporary dance improvisation that explores sharing weight, rolling, lifting, flying and finding one&apos;s center. Dancers will explore and focus on specific relationships in partnering. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN320","T":"DAN 320 Dance Composition I: Improvisation and Solo Forms","D":"Contemporary dance improvisation techniques, and creative approaches to development of basic movement themes and simple and complex manipulations of those themes. The first course in the Dance Composition Series. ","P":"<em>Prerequisite: DAN 216.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN323","T":"DAN 323 Musical Theatre Styles","D":"Students will continue to refine performance techniques as related to historical trends in choreography and staging for American Musical Theatre. A minimum of three production numbers featuring either original Broadway choreography or choreography devised by the instructor will be taught and performed during the semester. Students will also have the opportunity to sing or act, or both, as is appropriate to the numbers that are mastered. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN325","T":"DAN 325 Tap Dance III","D":"Continues development of intermediate level tap dance technique and vocabulary. Variable content course. May be repeated to a total of 3 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"DAN330","T":"DAN 330 Intermediate Ballet","D":"Intermediate level ballet technique. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN335","T":"DAN 335 Mens Dance Technique II","D":"Continued techniques for the male dancer. Emphasis will be on strength building and developing the male dancer&apos;s technique and style. Variable content course. May be repeated to a total of 4 hours. ","P":"<em>Prerequisite: DAN 235.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN345","T":"DAN 345 Intermediate Jazz Dance","D":"Intermediate level jazz dance techniques. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN348","T":"DAN 348 Partnering","D":"Basic and elementary techniques of classical and contemporary partnering. Variable content course. May be repeated to a total of 4 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"DAN364","T":"DAN 364 Applied Kinesiology for the Dancer","D":"The specific study of dance techniques through the principles of motion, muscle action and joint mechanics. ","P":"<em>Prerequisite: KIN 250.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"DAN390","T":"DAN 390 Service Learning in Dance","D":"This service component for an existing course incorporates community service with classroom instruction in Dance to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","P":"<em>Prerequisite: 30 hours and concurrent registration in a DAN course designated as a service learning offering.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"DAN416","T":"DAN 416 Advanced Modern Dance","D":"Advanced level modern dance technique. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN420","T":"DAN 420 Dance Composition II: Small Group Forms","D":"Choreographic techniques that explore creative approaches to the development and manipulation of movement themes. Emphasis on small group studies that explore space, time and energy. ","P":"<em>Prerequisite: DAN 320.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"DAN430","T":"DAN 430 Advanced Ballet","D":"Advanced level ballet technique. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN445","T":"DAN 445 Advanced Jazz Dance","D":"Advanced level jazz dance techniques. Variable content course. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN482","T":"DAN 482 Senior Project in Dance","D":"Public presentation of performance or paper to demonstrate the student&apos;s mastery of the skills received during the completion of the major. ","P":"<em>Prerequisite: permission of instructor and 90 hours.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"DAN492","T":"DAN 492 Senior BFA Review","D":"Public presentation of portfolio, project, or performance to demonstrate the student&apos;s mastery of the skills developed during the major. Required of all BFA Dance majors. ","P":"<em>Prerequisite: permission of BFA coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"DAN496","T":"DAN 496 Readings","D":"Individual experimental or research studies in dance. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of dance area coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"DAN497","T":"DAN 497 Topics","D":"Group creative or special topics in dance. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of instructor or course supervisor.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"DAN499","T":"DAN 499 Projects","D":"Supervised individual creative projects in dance. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of dance area coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"DAN520","T":"DAN 520 Choreography and Production","D":"Choreographing and directing a large group composition that will culminate with a performance on stage. Students will explore aspects of staging a complete work that will include the creation of original theme, casting of performers, choices of accompaniment, and lighting and costume design. Management of technical, business and artistic procedures involved in producing and staging dance productions. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: DAN 420 and THE 150.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"DAN530","T":"DAN 530 Pointe","D":"Pointe technique that focuses on stability, correct alignment of the feet and use of turn-out. At least one classical variation will be taught. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"DAN552","T":"DAN 552 Dance History Seminar","D":"Overview of the history of dance from the 20th century to the present. The primary focus will be on the development of modern/contemporary dance. ","P":"<em>Prerequisite: 60 hours and DAN 180 and Writing II.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"DAN565","T":"DAN 565 Dance Pedagogy","D":"Overview of general theories and practices of teaching. This course investigates class content and various methodologies used to teach dance techniques and creative movement. Emphasis is placed on methods for teaching the beginning and elementary level student. Opportunities to develop and implement lesson plans, and to develop comprehensive training syllabi. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: 45 hours and DAN 316 and DAN 330 and DAN 345.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":4,"E":2,"L":4}}
{"I":"DAN592","T":"DAN 592 Performance","D":"Performance laboratory for students in Dance. Focused study of dance repertory from a variety of genres. Emphasis will be placed on performance techniques as related to various styles. Variable content course. May be repeated to a total of 4 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE101","T":"THE 101 Introduction to Theatre and Drama Arts","D":"The creative processes of transforming drama to stage, film and television. A study of the collaborations and contributions that the various artists make to the process. Intended to increase the audience&apos;s ability to think critically about the artistic experience. Buying tickets to and attendance at local productions required. ","P":"<em>General Education Course (Focus on the Arts).</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE109","T":"THE 109 Performance Studies","D":"Exploration of the social, cultural, and aesthetic aspects of performance through an examination of self and society. Course combines lecture, readings, and individual student performances of oral and literary texts. Course enrollment is limited and much one-on-one work takes place. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE121","T":"THE 121 Acting Studio I","D":"Discovery and development of the actor&apos;s expressive behavior through improvisation. ","P":"<em>Prerequisite: permission of instructor; and concurrent enrollment in THE 122; and open only to BFA Acting and Musical Theatre majors admitted through the audition process.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"THE122","T":"THE 122 The Tools of the Actor","D":"An introduction to the fundamental tools of the actor: physical awareness, vocal awareness, and ensemble collaboration. Buying tickets to and attendance at local performances required. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE125","T":"THE 125 Voice and Movement for the Stage","D":"Exercises in physical and vocal awareness for the actor. Introductory material on anatomy, breathing, and articulation; care and maintenance of body and voice. ","P":"","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"THE130","T":"THE 130 Introduction to Script Analysis","D":"Analysis of the script and its translation from page to performance through an examination of the relationships of directors, designers, performers, and audience in the rehearsal process and theatrical performance. Buying tickets to and attendance at local productions required. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE150","T":"THE 150 Introduction to Theatre Technology","D":"An introduction to the working relationships of designers and basic principles of costuming, lighting, and stagecraft. Buying tickets to and attendance at local productions required. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"THE151","T":"THE 151 Introduction to Theatre Technology Lab","D":"Practical application of the principles addressed in THE 150. ","P":"<em>Prerequisite: THE 150 or concurrent enrollment.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE195","T":"THE 195 Theatre Laboratory","D":"Supervised practical work in the theatre including both on and off stage work. Requires 50 laboratory hours; 25 must be in technical areas. May be repeated to a total of 4 hours. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE205","T":"THE 205 Speech for the Elementary Classroom","D":"Speech activities in the elementary grades, correlating storytelling, choral reading, creative dramatics and speech correction. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE210","T":"THE 210 Writing for Theatre","D":"Study and practice of the discourse conventions of writing about dramatic literature and performance from the perspective of an educated generalist in the field. Students will hone skills of research, analysis, and argumentation in order to become more skillful theatre patrons, historians, and critics. ","P":"<em>Prerequisite: ENG 110 or equivalent and 30 hours.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE221","T":"THE 221 Acting Studio II","D":"Emphasis on finding truth in performance through various acting techniques and physicalization of text. Application of play analysis to character study. ","P":"<em>Prerequisite: THE 121.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"THE222","T":"THE 222 Acting Fundamentals","D":"Stage techniques, basics of characterization, scene study, and auditioning. Buying tickets to and attendance at local performances required. Cannot be counted toward a BFA in Musical Theatre. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE224","T":"THE 224 Stage Makeup I","D":"Laboratory course providing students with fundamentals of the art of two dimensional makeup. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE226","T":"THE 226 Intermediate Voice and Movement","D":"Development of dynamic physical and vocal expression of text. Exercises in breaking habitual physical and vocal patterns which inhibit emotional expression. ","P":"<em>Prerequisite: THE 122 and permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"THE228","T":"THE 228 Singing for the Actor","D":"Basic singing and music-reading techniques for actors, with approaches for building a singing repertoire. ","P":"<em>Prerequisite: permission of instructor; BFA Theatre/Acting option majors only; not open to Musical Theatre majors.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"THE250","T":"THE 250 Stagecraft and Construction I","D":"Working illustrations, construction, rigging, painting, and shifting of scenic units. ","P":"<em>Prerequisite: THE 150.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"THE251","T":"THE 251 Stagecraft and Construction Lab","D":"Practical application of the principles addressed in THE 250. ","P":"<em>Prerequisite: concurrent enrollment in THE 250.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE255","T":"THE 255 Lighting Design I","D":"Introduction to lighting design with an emphasis upon practical application. Includes a study of electrical wiring, lighting instruments, color in light, and technical lighting crew work. Study of design includes script analysis, lighting plots, and support materials. ","P":"<em>Prerequisite: THE 150.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"THE256","T":"THE 256 Lighting Lab","D":"Practical application of the principles addressed in THE 255. ","P":"<em>Prerequisite: concurrent enrollment in THE 255.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE260","T":"THE 260 Costume Construction I","D":"Fundamentals of costuming for the stage. A study of fabrics and construction; basic cutting and sewing techniques; costume shop organization and stage management. ","P":"<em>Prerequisite: THE 150.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"THE261","T":"THE 261 Costume Construction Lab","D":"Practical application of the principles addressed in THE 260. ","P":"<em>Prerequisite: THE 260 or concurrent enrollment.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE270","T":"THE 270 Drawing and Rendering for Theatre I","D":"A survey of drawing and the use of various media as applicable to theatrical design. Includes figure and perspective drawing techniques. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE271","T":"THE 271 Drawing and Rendering for Theatre II","D":"A continuation of the study of drawing, including figure and perspective drawing techniques. The use of various color media as applicable to theatrical design. ","P":"<em>Prerequisite: THE 270.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE275","T":"THE 275 Drafting for the Stage","D":"Basic drafting techniques and practices for theatrical applications. Study of tools, methods, and formulas used in generating designs and drawings. ","P":"<em>Prerequisite: THE 150.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE280","T":"THE 280 Design Seminar Design Principles","D":"Basic principles of design as these relate to the theatre, intensive laboratory experience in theatrical design. Buying tickets to and attendance at local performances required. ","P":"<em>Prerequisite: THE 150.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE281","T":"THE 281 Design Seminar-Lighting and Scenic Design Principles","D":"Basic principles of lighting and scenic design as these relate to the theatre. Intensive laboratory experience in theatrical design. Buying tickets to and attendance at local performances required. ","P":"<em>Prerequisite: THE 150; and THE 270 or THE 271.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE292","T":"THE 292 BFA Review","D":"Public presentation of a portfolio, a project, or a performance demonstrating the student&apos;s mastery of the skills received during the major. ","P":"<em>Prerequisite: permission of area coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE295","T":"THE 295 Production/Design/Stage Management Project","D":"Technical or design or stage management assignment requiring an intermediate level of expertise and responsibility connected with a specific departmental production. ","P":"<em>Prerequisite: permission of area coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE306","T":"THE 306 Interrelated and Integrated Arts","D":"Theory, methodology, and activities for teaching the arts to children, from early childhood through Grade 6. A creative experiential approach, emphasizing how the four primary art forms (drama, movement, music, and art) relate to and enhance one another and facilitate the child&apos;s learning in other content areas. Cannot receive credit for both THE 306 and MUS 306. ","P":"<em>Prerequisite: ELE 302.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"THE321","T":"THE 321 Acting Studio III","D":"Projects in advanced characterization. May be repeated up to 6 hours. ","P":"<em>Prerequisite: THE 221.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"THE323","T":"THE 323 Acting-Performance and Literature","D":"Individual and group performance of plays, prose narrative and poetry. ","P":"<em>Prerequisite: THE 221 or THE 222.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE324","T":"THE 324 Stage Makeup II","D":"Laboratory course dealing with three-dimensional makeup. Emphasis on prosthetics of latex. ","P":"<em>Prerequisite: THE 224.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE326","T":"THE 326 Advanced Voice for the Actor","D":"Introduction to scansion and its application to performing classical material. Techniques for vocal stamina. ","P":"<em>Prerequisite: THE 226.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"THE327","T":"THE 327 Advanced Movement for the Actor","D":"Connections between characterization and physicalization in the actor&apos;s performance are explored. Designed for the student who wishes to develop bold, strong, and specific characterization-building skills. ","P":"<em>Prerequisite: THE 226.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"THE328","T":"THE 328 Stage Combat","D":"An introduction to the techniques and terminology used in the performance of stage choreographed combat. Emphasis is placed on physical safety, proper vocalization, movement and weapon control. ","P":"<em>Prerequisite: THE 226.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE350","T":"THE 350 Stagecraft and Construction II","D":"Study of advanced building techniques. Work with &quot;non-conventional&quot; materials. Explore uses of mechanical stage machinery. Plan and budget productions. ","P":"<em>Prerequisite: THE 250 and THE 275.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE354","T":"THE 354 Stage Management","D":"Development of a production book and understanding of all procedures used by a stage manager from the selection of a script to the final production. The role of the stage manager is discussed for both the professional and the non-professional theatre. ","P":"<em>Prerequisite: THE 150.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE380","T":"THE 380 Design Seminar-Costume and Sound Design Principles","D":"Basic principles of costume and sound design as these relate to the theatre. Intensive laboratory experience in theatrical design. Buying tickets to and attendance at local performances required. ","P":"<em>Prerequisite: THE 150.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE381","T":"THE 381 Design Seminar-Collaborative Design Process","D":"Collaboration as it relates to all areas of theatrical design. Intensive laboratory experience in theatrical design. Buying tickets to and attendance at local performances required. ","P":"<em>Prerequisite: THE 280 and THE 281 and THE 380.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE382","T":"THE 382 Research and Concept Development","D":"Research and dramaturgy as these apply to previsualization, design, production, and concept development for the theatre and the performing arts. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE390","T":"THE 390 Service Learning in Theatre","D":"This service component for an existing course incorporates community service with classroom instruction in Theatre to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","P":"<em>Prerequisite: 30 hours and concurrent registration in a Theatre course designated as a service learning offering.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"THE392","T":"THE 392 BFA Review","D":"Public presentation of a portfolio, a project, or a performance demonstrating the student&apos;s mastery of the skills received during the major. ","P":"<em>Prerequisite: permission of area coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE395","T":"THE 395 Production/Design/Stage Management Project","D":"Technical or design or stage management assignment requiring an advanced level of expertise and responsibility connected with a specific departmental production. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of area coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE412","T":"THE 412 Structures and Styles in Classical Drama","D":"Study and exploration of dramatic modes in period and stylistic material. Monologue and scenework exploring Greek, Restoration, Romantic, and other non-traditional styles. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"THE417","T":"THE 417 Teaching of Speech and Theatre","D":"Scope and objectives of the speech and theatre program in secondary schools; organization and administration of curricular and co-curricular programs; general instruction methodology. Completion of Checkpoint II for the Professional Portfolio is a component of this course. This course is recommended to be completed the fall semester before student teaching. Credited only on BSEd (Secondary). A grade of &quot;C&quot; or better is required in this course in order to take THE 490 or THE 491. Cannot be taken Pass/Not Pass. Identical with COM 417. Cannot receive credit for both THE 417 and COM 417. ","P":"<em>Prerequisite: EDC 350, SPE 340, EDT 365, 12 hours in communication and 12 hours in theatre, and admitted to Teacher Education Program.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE421","T":"THE 421 Acting Studio IV","D":"Advanced techniques and tutorial scene work from classic theatre literature of the late 19th and early 20th centuries. May be repeated up to 6 hours. ","P":"<em>Prerequisite: THE 321.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"THE422","T":"THE 422 Scene Study","D":"Tutorial scene study focusing on acting tools necessary for the rehearsal process. May be repeated up to 6 hours. ","P":"<em>Prerequisite: THE 321 or THE 323.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE424","T":"THE 424 Dialects","D":"An exploration of stage dialects and accents for the actor. ","P":"<em>Prerequisite: THE 421.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE430","T":"THE 430 Directing I","D":"Basic principles, skills and techniques underlying directing. Procedures in selecting, analyzing, casting and producing a play. ","P":"<em>Prerequisite: THE 130 and THE 150 and; either THE 121 or THE 222.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE451","T":"THE 451 Auditions","D":"Audition techniques for performers; choice and preparation of audition materials, as well as construction of a resume, obtaining a useable photograph, information on agents, casting directors, casting notices, unions, and the development of a reliable network. ","P":"<em>Prerequisite: THE 321.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"THE454","T":"THE 454 Scene Painting","D":"Study of painting equipment tools, brushes, pigments, binders, and vehicles and their relationship to the surfaces to be painted. Instruction in basic painting techniques and texturing for the stage. ","P":"<em>Prerequisite: THE 270.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE460","T":"THE 460 Costume Construction II","D":"Costume construction techniques with emphasis on patterning, draping, tailoring, and more specialized sewing and fabric manipulation processes. Requires 45 hours of laboratory work. ","P":"<em>Prerequisite: THE 260.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE482","T":"THE 482 Senior Project in Theatre","D":"Public presentation of portfolio, project, performance, or paper to demonstrate the student&apos;s mastery of the skills received during the completion of the major. ","P":"<em>Prerequisite: permission of instructor and 90 hours.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE490","T":"THE 490 Supervised Teaching (Secondary Speech and Theatre)","D":"Student observes, then teaches speech and theatre classes under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Cannot count toward the major GPA. Cannot receive credit for both THE 490 and COM 490. Supplemental course fee. ","P":"<em>Prerequisite: THE 417; a grade of &quot;C&quot; or better in all professional education courses; current pre-professional liability insurance; and approval for supervised teaching.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":6,"E":0,"L":0}}
{"I":"THE491","T":"THE 491 Supervised Teaching (Secondary Speech and Theatre)","D":"Student observes, then teaches under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Cannot count toward the major GPA. Cannot receive credit for both THE 491 and COM 491. Supplemental course fee. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: concurrent enrollment in THE 490.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":6,"E":0,"L":0}}
{"I":"THE492","T":"THE 492 Senior BFA Project","D":"Public presentation of portfolio, project, or performance to demonstrate the student&apos;s mastery of the skills received during the major. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of area coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE493","T":"THE 493 Clinical Experiences in Teaching II","D":"This course is designed to meet HB 1711 for student&apos;s experience as a Teacher&apos;s Aide or Assistant Rule (Rule 5 CSR 80-805.040), to that of conventional student teachers within the same program. It is also designed to support completion of additional clinical requirements within that program including: seminars and workshops, required meetings, school related activities appropriate to the assignment, demonstrated mastery of the MoSPE standards and completion and overall assessment of a Professional Preparation Portfolio. This course is credited only on BSEd or appropriate masters-level certification programs. Can only receive credit for one of the following: AGE 499, AGT 499, ART 469, BSE 499, COM 493, ECE 499, ELE 499, ENG 434, FCS 498, HST 499, KIN 498, MCL 491, MID 499, MTH 496, MUS 499, SCI 499, SEC 499, SPE 499, THE 493. Supplemental course fee. ","P":"<em>Prerequisite: EDC 199; and admitted to Teacher Education Program; and grades of &quot;C&quot; or better in all professional education courses; and completion of portfolio checkpoints 1 and 2; and current pre-professional liability insurance; and program approval.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":0,"L":0}}
{"I":"THE495","T":"THE 495 Theatre Practicum","D":"An administrative, instructional, or supervisory experience not available through class work. Student typically serves as a production aide to a faculty member, or assumes a faculty supervised leadership role. May be repeated to a total of 4 hours. Public Affairs Capstone Experience course. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE496","T":"THE 496 Readings","D":"Individual, experimental or research studies in theatre and performance studies. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"THE497","T":"THE 497 Topics","D":"Group creative or special topics in theatre and performance studies. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"THE498","T":"THE 498 Advanced Actor Seminar","D":"Lecture and laboratory experience for the actor about to enter the professional arena. ","P":"<em>Prerequisite: THE 421 and permission of instructor.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"THE499","T":"THE 499 Projects","D":"Supervised individual creative projects in theatre and performance studies. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"THE505","T":"THE 505 Theatre for Children and Youth","D":"Special training and techniques involved in the preparation and development of productions for, and by, children and youth. Activities include directing, scenic and costume design, scripting, and a study of the history, literature and research of the field. May be taught concurrently with THE 605. Cannot receive credit for both THE 605 and THE 505. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE506","T":"THE 506 Creative Dramatics","D":"The art of creative drama and how it can be used in the school and community with children, youth, adults, and &quot;special populations.&quot; Students teach their own classes in creative drama during the latter part of the semester. May be taught concurrently with THE 606. Cannot receive credit for both THE 606 and THE 506. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE510","T":"THE 510 Scripting and Performing","D":"Theoretical and practical knowledge in developing performance skills for one-person shows, extended literary performances, performance art, stand-up comedy, personal narrative and other performer-composed theatrical texts. May be taught concurrently with THE 611. Cannot receive credit for both THE 611 and THE 510. ","P":"<em>Prerequisite: THE 323.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE511","T":"THE 511 Structures and Styles Shakespeare","D":"Understanding text, style, and dynamics of action in Shakespeare. Creating roles in Shakespeare&apos;s plays. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE515","T":"THE 515 Theatre for Social Change","D":"Theoretical and practical knowledge for developing performances for, about, and in partnership with community-based nonprofit organizations. Includes volunteer assignment and techniques for journaling, interviewing, scripting, and directing original material. May be taught concurrently with THE 616. Cannot receive credit for both THE 616 and THE 515. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: THE 323.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE522","T":"THE 522 Auditioning and Acting for the Camera","D":"A practical immersion into the on-camera market for the professional actor. Auditioning and acting skills for one and three camera formats including commercials, television comedy, television drama, industrials, film, and emerging digital mediums. Also covers industry and marketing logistics in relation to the on-camera market. Maybe taught concurrently with THE 623. Cannot receive credit for both THE 522 and THE 623. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE530","T":"THE 530 Directing II","D":"Advanced directing techniques. Directing of a one-act play. May be taught concurrently with THE 640. Cannot receive credit for both THE 640 and THE 530. ","P":"<em>Prerequisite: THE 430.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE541","T":"THE 541 Theatre History I","D":"Traces the important periods in the development of theatre from its beginning through the English Restoration. Through analysis of conventions of staging and dramatic literature, examines the aesthetic, cultural, ethical, and social dimensions of theatre in different cultures and time periods. May be taught concurrently with THE 631. Cannot receive credit for both THE 541 and THE 631. ","P":"<em>Prerequisite: Writing II.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE542","T":"THE 542 Theatre History II","D":"Traces the important periods in the development of theatre from the 18th century to the present. Through analysis of conventions of staging and dramatic literature, examines the aesthetic, cultural, ethical, and social dimensions of theatre in different cultures and time periods. May be taught concurrently with THE 632. Cannot receive credit for both THE 542 and THE 632. ","P":"<em>Prerequisite: Writing II.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE543","T":"THE 543 Development of Modern Theatre","D":"Examines the aesthetic, cultural, ethical, and social dimensions of modern theatre, from the development of naturalism to Theatre of the Absurd, through analysis of staging practices, theatrical theory, and dramatic literature. May be taught concurrently with THE 633. Cannot receive credit for both THE 543 and THE 633. ","P":"<em>Prerequisite: Writing II.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE545","T":"THE 545 Contemporary Theatre","D":"Examines the aesthetic, cultural, ethical, and social dimension of theatre and drama since 1960. Emphasis will be on theatre as an art form and a social and cultural institution. May be taught concurrently with THE 634. Cannot receive credit for both THE 545 and THE 634. ","P":"<em>Prerequisite: Writing II.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE547","T":"THE 547 Development of American Theatre","D":"Study of theatre in the United States from colonial times to the present; with a focus on the cultural and aesthetic variety of American theatrical practice and the theatre as a reflection of various cultural, and political beliefs. May be taught concurrently with THE 635. Cannot receive credit for both THE 635 and THE 547. ","P":"<em>Prerequisite: Writing II.</em>","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE552","T":"THE 552 Scene Design II","D":"Advanced designs of selected plays including floor plans, front elevations, white and finished models and renderings. May be taught concurrently with THE 652. Cannot receive credit for both THE 652 and THE 552. ","P":"<em>Prerequisite: THE 275 and THE 281.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE555","T":"THE 555 Lighting Design II","D":"Advanced principles and techniques of lighting for theatre, dance, and other performance/presentational events. May be taught concurrently with THE 655. Cannot receive credit for both THE 655 and THE 555. ","P":"<em>Prerequisite: THE 275 and THE 281.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE558","T":"THE 558 Sound Design for the Theatre","D":"Principles of sound design with an emphasis on practical application. Includes a study and practice of basic audio production, recording, editing, mixing, reinforcement, and playback techniques used in association with dramatic events. Study of sound design includes aesthetic, dramatic, and practical considerations of script analysis, creative collaboration, research, and problem solving. Practical class application will be in the form of simple projects, exercises, and designs. May be taught concurrently with THE 658. Cannot receive credit for both THE 658 and THE 558. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE561","T":"THE 561 History of Costume and Decor I","D":"A survey of styles of dress, interior design and decoration, architecture, art, and historical events as they pertain to the design of theatrical productions, from ancient Egypt to circa 1700. Requires sketching. May be taught concurrently with THE 671. Cannot receive credit for both THE 671 and THE 561. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE562","T":"THE 562 History of Costume and Decor II","D":"Survey of styles of dress, interior design and decoration, architecture, and art as they pertain to the design of theatrical productions, from circa 1700 to the present day. Requires sketching. May be taught concurrently with THE 672. Cannot receive credit for both THE 672 and THE 562. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE565","T":"THE 565 Costume Design II","D":"Emphasis on special problems in costume design including applications of concepts to design projects and presentation of completed design projects. May be taught concurrently with THE 665. Cannot receive credit for both THE 665 and THE 565. ","P":"<em>Prerequisite: THE 380.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE595","T":"THE 595 Theatre Practicum","D":"Acting, stagecraft, costuming and associated work in the Tent Theatre or other specified theatre production. May be taught concurrently with THE 694. Cannot receive credit for both THE 694 and THE 595. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"THE605","T":"THE 605 Theatre for Children and Youth","D":"Special training and techniques involved in the preparation and development of productions for, and by, children and youth. Activities include directing, scenic and costume design, scripting, and a study of the history, literature and research of the field. May be taught concurrently with THE 505. Cannot receive credit for both THE 505 and THE 605. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE606","T":"THE 606 Creative Dramatics","D":"The art of creative drama and how it can be used in the school and community with children, youth, adults, and &quot;special populations.&quot; Students teach their own classes in creative drama during the latter part of the semester. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE611","T":"THE 611 Scripting and Performing","D":"Theoretical and practical knowledge in developing performance skills for one-person shows, extended literary performances, performance art, stand-up comedy, personal narrative and other performer-composed theatrical texts. May be taught concurrently with THE 510. Cannot receive credit for both THE 510 and THE 611. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE616","T":"THE 616 Theatre for Social Change","D":"Theoretical and practical knowledge for developing performances for, about, and in partnership with community-based nonprofit organizations. Includes volunteer assignment and techniques for journaling, interviewing, scripting, and directing original material. May be taught concurrently with THE 515. Cannot receive credit for both THE 515 and THE 615. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE623","T":"THE 623 Auditioning and Acting for the Camera","D":"A practical immersion into the on-camera market for the professional actor. Auditioning and acting skills for one and three camera formats including commercials, television comedy, television drama, industrials, film, and developing digital mediums. Also covers industry and marketing logistics in relation to the on-camera market. May be taught concurrently with THE 522. Cannot receive credit for both THE 522 and THE 623. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE631","T":"THE 631 Theatre History I","D":"Traces the important periods in the development of theatre from its beginning through the English Restoration. Through analysis of conventions of staging and dramatic literature, examines the aesthetic, cultural, ethical, and social dimensions of theatre in different cultures and time periods. May be taught concurrently with THE 541. Cannot receive credit for both THE 541 and THE 631. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE632","T":"THE 632 Theatre History II","D":"Traces the important periods in the development of theatre from the 18th century to the present. Through analysis of conventions of staging and dramatic literature, examines the aesthetic, cultural, ethical, and social dimensions of theatre in different cultures and time periods. May be taught concurrently with THE 542. Cannot receive credit for both THE 542 and THE 632. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE633","T":"THE 633 Development of Modern Theatre","D":"Examines the aesthetic, cultural, ethical, and social dimension of modern theatre, from the development of naturalism to Theatre of the Absurd, through analysis of staging practices, theatrical theory, and dramatic literature. May be taught concurrently with THE 543. Cannot receive credit for both THE 543 and THE 633. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE634","T":"THE 634 Contemporary Theatre","D":"Examines the aesthetic, cultural, ethical, and social dimension of theatre and drama since 1960. Emphasis will be on theatre as an art form and a social and cultural institution. May be taught concurrently with THE 545. Cannot receive credit for both THE 545 and THE 634. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE635","T":"THE 635 Development of American Theatre","D":"Study of theatre in the United States from colonial times to the present with a focus on the cultural and aesthetic variety of American theatrical practice and the theatre as a reflection of various social, cultural, and political beliefs. May be taught concurrently with THE 547. Cannot receive credit for both THE 547 and THE 635. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE640","T":"THE 640 Directing II","D":"Advanced directing techniques. Directing of a one-act play. May be taught concurrently with THE 530. Cannot receive credit for both THE 530 and THE 640. ","P":"","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE652","T":"THE 652 Scene Design II","D":"Advanced designs of selected plays including floor plans, front elevations, white and finished models and renderings. ","P":"","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE655","T":"THE 655 Lighting Design II","D":"Advanced principles and techniques of lighting for theatre, dance, and other performance/presentational events. May be taught concurrently with THE 555. Cannot receive credit for both THE 555 and THE 655. ","P":"","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE658","T":"THE 658 Sound Design for the Theatre","D":"Principles of sound design with an emphasis on practical application. Includes a study and practice of basic audio production, recording, editing, mixing, reinforcement, and playback techniques used in association with dramatic events. Study of sound design includes aesthetic, dramatic, and practical considerations of script analysis, creative collaboration, research, and problem solving. Practical class application will be in the form of simple projects, exercises, and designs. May be taught concurrently with THE 558. Cannot receive credit for both THE 558 and THE 658. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE665","T":"THE 665 Costume Design II","D":"Emphasis on special problems in costume design including applications of concepts to design projects and presentation of completed design projects. May be taught concurrently with THE 565. Cannot receive credit for both THE 565 and THE 665. ","P":"","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"THE671","T":"THE 671 History of Costume and Decor I","D":"A survey of styles of dress, interior design and decoration, architecture, art, and historical events as they pertain to the design of theatrical productions, from ancient Egypt to circa 1700. Requires sketching. May be taught concurrently with THE 561. Cannot receive credit for both THE 561 and THE 671. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE672","T":"THE 672 History of Costume and Decor II","D":"Survey of styles of dress, interior design and decoration, architecture, and art as they pertain to the design of theatrical productions, from circa 1700 to the present day. Requires sketching. May be taught concurrently with THE 562. Cannot receive credit for both THE 562 and THE 672. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE700","T":"THE 700 Graduate Research Methods in Theatre and Interpretation","D":"Exploration of the current state of theatre studies. Focuses on strategies for research with primary and secondary sources, critical and theoretical methodologies, and various methods of reporting research. ","P":"","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE707","T":"THE 707 Theatre Pedagogy: Theories and Practices","D":"Designed to acquaint theatre teachers with the field of current theories and practices of theatre and performance pedagogy, and to develop instructional skills with specific application to teaching introductory level theatre courses. ","P":"","L":"courses_td","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE710","T":"THE 710 Seminar: Performance","D":"Studies in rhetorical, cultural, social and aesthetic dimensions of performance. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE742","T":"THE 742 Dramatic Theory and Criticism","D":"Representative theories of dramatic form and function; works of major critics and philosophers from Aristotle to present. ","P":"","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"THE790","T":"THE 790 Workshop in Theatre","D":"Designed to improve the students&apos; skill and knowledge in specific areas of theatrical production. Each workshop will be concerned with a single topic, either acting, directing, or design. The course will examine the intersections between theory and practice in the creation of theatrical works. May be repeated to a maximum of 9 hours credit. ","P":"","L":"courses_td","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":0}}
{"I":"THE793","T":"THE 793 Degree Paper","D":"Research and writing of an extended paper originating in one of the 700-level courses. Students may choose to present the completed paper for their required research report. May be repeated to a total of 6 hours. ","P":"","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":0}}
{"I":"THE794","T":"THE 794 Theatre Practicum","D":"Acting, stagecraft, costuming and associated work in the Tent Theatre or other specified theatre production. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_td","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":0}}
{"I":"THE795","T":"THE 795 Applied Research Project","D":"The applied research project may consist of: 1) a creative project (directing, designing, scripting, performing), or 2) an internship with a host company or agency. For the non-thesis project, students must design specific educational and social as well as artistic objectives and appropriate assessment measures in consultation with the advisor. Students may choose to report on the applied research project for their required research report. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of research advisor and, if applicable, host institution permission must be obtained the semester prior to enrollment.</em>","L":"courses_td","O":{"F":true,"S":true,"M":true},"H":{"C":3,"E":0,"L":0}}
{"I":"THE796","T":"THE 796 Readings","D":"Individual, experimental or research studies in theatre and performance studies. May be repeated to total of 6 hours. ","P":"<em>Prerequisite: permission of graduate coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"THE797","T":"THE 797 Topics","D":"Creative or special topics in theatre and performance studies. May be repeated to total of 6 hours. ","P":"<em>Prerequisite: permission of graduate coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"THE798","T":"THE 798 Thesis Research","D":"Research leading to a masters thesis. Students will present a proseminar on their research during the semester they are enrolled in this course. ","P":"<em>Prerequisite: permission of the graduate coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":true},"H":{"C":3,"E":0,"L":0}}
{"I":"THE799","T":"THE 799 Thesis Writing","D":"Preparation of thesis. May be repeated, but no more than 3 hours may be counted toward a masters degree. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of graduate coordinator.</em>","L":"courses_td","O":{"F":true,"S":true,"M":true},"H":{"C":3,"E":0,"L":0}}
