{"I":"CHM107","T":"CHM 107 Chemistry for the Citizen","D":"Concurrent enrollment in CHM 108 is highly recommended. A course for the non-science major. Principal concepts and applications of chemistry are presented. The course looks at both the beneficial side of chemical usage and the problems associated with chemical production and usage. The course provides information needed for a better understanding of environmental concerns, the chemical industry, consumer products and our alternate sources and storage of energy. ","P":"<em>General Education Course (Focus on Physical Sciences).</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM108","T":"CHM 108 Chemistry for the Citizen Laboratory","D":"A one semester course for the non-science major. Principal concepts and applications of chemistry are presented. Emphasis on experiments and lab skills associated with the lecture material in CHM 107. Supplemental course fee. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 107 or concurrent enrollment. General Education Course (Focus on Physical Sciences).</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"CHM116","T":"CHM 116 Fundamentals of Chemistry","D":"Concurrent enrollment in CHM 117 is highly recommended. Emphasis on chemical fundamentals and applications. Recommended for students needing only one semester of introductory chemistry. Cannot be counted towards a chemistry major or minor. ","P":"<em>Prerequisite: concurrent enrollment in MTH 102 or MTH 103 or eligibility for a higher mathematics course. General Education Course (Focus on Physical Sciences).</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":4,"L":0}}
{"I":"CHM117","T":"CHM 117 Fundamentals of Chemistry Laboratory","D":"Emphasis on experiments and lab skills associated with the lecture material in CHM 116, such as chemical fundamentals and applications. Recommended for students needing only one semester of general chemistry lab. Cannot be counted towards a chemistry major or minor. Cannot be taken Pass/Not Pass. Supplemental course fee. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 116 or concurrent enrollment; concurrent enrollment in MTH 102 or MTH 103 or eligibility for a higher mathematics course. General Education Course (Focus on Physical Sciences).</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"CHM160","T":"CHM 160 General Chemistry I","D":"Concurrent enrollment in CHM 161 is highly recommended. Emphasis on fundamental and theoretical concepts of chemistry. Recommended for all science majors, chemistry majors and minors, and most preprofessional students. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 170 or CHM 171. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: eligibility for MTH 135 or higher.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":4,"L":0}}
{"I":"CHM161","T":"CHM 161 General Chemistry I Laboratory","D":"An introduction to laboratory chemistry employing principles and techniques that reflect material presented in CHM 160, e.g., synthesis, stoichiometry, physical studies, and data manipulation and interpretation. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 171. Cannot be taken Pass/Not Pass. Supplemental course fee. ","P":"<em>Prerequisite: CHM 160 or concurrent enrollment.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"CHM170","T":"CHM 170 General Chemistry II","D":"Concurrent enrollment in CHM 171 is highly recommended. Emphasis on reaction kinetics, chemical equilibrium, precipitation reactions, acid-base theory and oxidation-reduction reactions. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 342, 352, or 506. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 160.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM171","T":"CHM 171 General Chemistry II Laboratory","D":"An introduction to laboratory chemistry, employing principles and techniques that reflect material presented in CHM 170, e.g., physical studies on kinetics and equilibria of aqueous systems, qualitative and quantitative analysis, and data manipulation and interpretation. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 302 or 342. Cannot be taken Pass/Not Pass. Supplemental course fee. ","P":"<em>Prerequisite: CHM 170 or concurrent enrollment; and a &quot;C-&quot; or better in CHM 160 and CHM 161.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":3}}
{"I":"CHM197","T":"CHM 197 Chemical Topics","D":"For non-science majors: a single topic of contemporary, historical or theoretical significance. Topics may vary each semester; course may be repeated any number of times provided the same topic is not retaken. Variable content course. ","P":"","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM201","T":"CHM 201 Essentials of Organic Chemistry","D":"Principles of organic chemistry and biochemistry. The laboratory associated with this course is CHM 202. Cannot be counted toward a chemistry major or minor if student passes CHM 342. ","P":"<em>Prerequisite: a &quot;C-&quot; grade or better in CHM 116 or CHM 170.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM202","T":"CHM 202 Essentials of Organic Chemistry Laboratory","D":"Principles of organic chemistry and biochemistry. Emphasis on experiments and lab skills associate with the lecture material in CHM 201. Cannot be counted towards a chemistry major or minor if the student passes CHM 342. Cannot be taken Pass/Not Pass. Supplemental course fee. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 117 or CHM 161; &quot;C-&quot; or better in CHM 201 or concurrent enrollment.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM240","T":"CHM 240 Glass Working","D":"Instruction and practice in glass-working techniques needed to make simple apparatus. ","P":"<em>Prerequisite: CHM 170.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"CHM260","T":"CHM 260 Principles of Environmental Chemistry","D":"An introduction to chemical processes occurring in the atmosphere, natural waters and soil. Sources of pollution, effects and remediation strategies are emphasized. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 116 and 117 or CHM 160.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM300","T":"CHM 300 Service Learning in Chemistry","D":"This service component for an existing course incorporates community service with classroom instruction in chemistry to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; students should investigate possible placements, available through the Chemistry Department and the Citizenship and Service Learning Office, prior to registration. May be repeated. ","P":"<em>Prerequisite: 30 hours, and concurrent registration in a chemistry course designated as a service learning offering.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM302","T":"CHM 302 Introduction to Analytical Chemistry","D":"Fundamentals of chemical analysis and basic statistics; solution equilibria, fundamentals of spectrophotometric, chromatographic, and electrochemical methods. Laboratory includes both wet chemical and instrumental methods. Representative analyses are performed in laboratory. Supplemental course fee.  ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in both CHM 170 and CHM 171.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":3,"L":4}}
{"I":"CHM342","T":"CHM 342 Organic Chemistry I","D":"Systematic coverage of reactions and properties of organic compounds. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 343, CHM 344 or CHM 352. Cannot be taken Pass/Not Pass. Supplemental course fee. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in both CHM 170 and CHM 171.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":4,"L":3}}
{"I":"CHM343","T":"CHM 343 Organic Chemistry II","D":"Continuation of CHM 342. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 542. Cannot be taken Pass/Not Pass. Supplemental course fee. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 342.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":4,"L":3}}
{"I":"CHM344","T":"CHM 344 Organic Chemistry II","D":"Continuation of the lecture part of CHM 342. Identical to lecture part of CHM 343. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 542. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 342.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM352","T":"CHM 352 Introduction to Biochemistry","D":"Recommended Prerequisite: BIO 121 or BMS 110 and 111. Essentials of biochemistry; chemistry and metabolism of biologically important compounds. Does not apply to a chemistry major or minor if the student passes CHM 452. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in either [CHM 201 and 202] or CHM 342.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM353","T":"CHM 353 Introduction to Biochemistry Laboratory","D":"Introduction to modern biochemical techniques including buffer preparation, chromatographic separations and spectrophotometric analysis of biomolecules. CHM 353 and 453 cannot both be applied toward a chemistry major or minor. Supplemental course fee. ","P":"<em>Prerequisite: CHM 171 or [CHM 201 and 202] or CHM 342; and CHM 352 or concurrent enrollment.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM375","T":"CHM 375 Inorganic Chemistry","D":"Atomic structure, chemical bonding, acid/base and reduction/oxidation concepts, reactivity of inorganic compounds, chemistry of main group elements, fundamentals of coordination theory. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 575. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 170.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM376","T":"CHM 376 Inorganic Preparation","D":"Synthesis of inorganic compounds and measurements of physical and chemical properties of selected inorganic compounds. Supplemental course fee. ","P":"<em>Prerequisite: &quot;C-&quot; grades or better in CHM 171 and CHM 375.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM397","T":"CHM 397 Cooperative Education in Chemistry","D":"A combination of supervised work experience in an industrial or governmental laboratory and academic training. May be repeated to a total of 6 semester hours. Variable content course. ","P":"<em>Prerequisite: acceptance into Cooperative Education Program and permission.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"CHM398","T":"CHM 398 Chemical Symposium","D":"Recommended Prerequisite: take within the first 75 hours. Introduction to oral and written scientific communication, laboratory safety, ethics, scientific literature searching and software, and current trends in chemical research. Does not count toward a chemistry minor. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: 14 hours of chemistry.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"CHM399","T":"CHM 399 Undergraduate Investigations","D":"Individual investigation of a chemical problem. May be repeated to a total of 5 hours. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM435","T":"CHM 435 Investigations in Chemistry for Teachers","D":"Techniques in performing science investigation with application to secondary and middle school science. May be taught concurrently with CHM 735. Cannot receive credit for both CHM 435 and CHM 735. ","P":"<em>Prerequisite: 15 hours of chemistry or permission.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"CHM452","T":"CHM 452 Biochemistry I","D":"Recommended Prerequisite: BIO 121 or BMS 110 and 111. Structure and function of biomolecules: proteins, enzymes, nucleic acids, carbohydrates, lipids and membranes. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 343 or CHM 344.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM453","T":"CHM 453 Biochemistry Laboratory I","D":"A series of multidimensional biochemical experiments designed to explore the biochemical literature, scientific report writing, and the biochemical techniques used to isolate and study biomolecules. CHM 353 and 453 cannot both be applied toward a chemistry major or minor. Supplemental course fee. ","P":"<em>Prerequisite: CHM 452 or concurrent enrollment.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM460","T":"CHM 460 Environmental Chemistry: Water and Land","D":"Recommended Prerequisite: CHM 302. Chemistry of water and soil, water treatment, agricultural chemistry and related topics. May be taught concurrently with CHM 760. Cannot receive credit for both CHM 460 and CHM 760. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 170; and &quot;C-&quot; or better in CHM 201 or CHM 342.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM461","T":"CHM 461 Environmental Chemistry: Air and Energy","D":"Recommended Prerequisite: some advanced coursework in chemistry, geosciences, biology, or related fields. Atmospheric chemistry; pollution issues related to power production and transportation; energy sources and fuels. May be taught concurrently with CHM 761. Cannot receive credit for both CHM 461 and CHM 761. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 201 or CHM 342.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM462","T":"CHM 462 Environmental Chemistry Laboratory","D":"Techniques and procedures for environmental monitoring to test natural samples. Applications and limitations of wet chemical and instrumental methods such as atomic absorption, gas chromatography, absorption spectrophotometry. May be taught concurrently with CHM 762. Cannot receive credit for both CHM 462 and CHM 762. Cannot receive credit for both CHM 462 and CHM 463. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 302 and CHM 460.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM463","T":"CHM 463 Environmental Analysis","D":"Techniques and procedures for environmental analysis of natural water samples with an emphasis on wet chemical methods. Cannot receive credit for both CHM 462 and CHM 463. Scheduled as first block class. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 302 and CHM 460.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"CHM492","T":"CHM 492 Program Assessment","D":"Required assessment of undergraduate Comprehensive and Non-comprehensive Chemistry majors, who are required to enroll in this course during their final semester and complete a comprehensive assessment exam, as administered by the department. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: senior standing chemistry major; and permission of department head.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"CHM498","T":"CHM 498 Chemistry Careers","D":"Writing scientific resumes and cover letters, discussion of chemistry careers, graduate school, job-hunting resources and professional ethics. Outside speakers from chemistry-related employers will be invited. Interaction with the Career Center will be required. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: CHM 398 and 60 hours.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"CHM499","T":"CHM 499 Advanced Undergraduate Research","D":"Individual research problems in chemistry. A written report is required for this course. May be repeated to a total of 5 hours. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: senior standing Chemistry major.</em>","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM502","T":"CHM 502 Techniques of Instrumental Analysis","D":"Recommended Prerequisite: PHY 124 or PHY 204. Applications of instrumental methods for the separation and analysis of materials; included are potentiometry, photometry and chromatography. May be taught concurrently with CHM 602. Cannot receive credit for both CHM 602 and CHM 502. Supplemental course fee. ","P":"<em>Prerequisite: &quot;C-&quot; or better in [CHM 201 and 202] or CHM 342; and &quot;C-&quot; or better in CHM 302.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":4,"E":3,"L":3}}
{"I":"CHM505","T":"CHM 505 Fundamentals of Physical Chemistry","D":"A one semester introduction to physical chemistry including the following topics: thermodynamics, solution chemistry, electrochemistry, kinetics, and atomic and molecular structure. Laboratory experiments will illustrate principles of physical chemistry and techniques of analysis. Does not apply to a Chemistry major or minor if the student passes CHM 506. May be taught concurrently with CHM 605. Cannot receive credit for both CHM 605 and CHM 505. ","P":"<em>Prerequisite: 20 hours of chemistry coursework; and &quot;C-&quot; or better in either MTH 287 or MTH 261.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":4,"E":3,"L":3}}
{"I":"CHM506","T":"CHM 506 Physical Chemistry I","D":"Recommended Prerequisite: MTH 302; and PHY 124 or PHY 204. First semester of a two-semester series covering aspects of quantum mechanics, classical and statistical thermodynamics, spectroscopy, kinetic theory of gases, and chemical kinetics. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 507. Cannot be taken Pass/Not Pass. May be taught concurrently with CHM 606. Cannot receive credit for both CHM 606 and CHM 506. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 170; and MTH 280 or MTH 288 or concurrent enrollment in MTH 280 or MTH 288.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM507","T":"CHM 507 Physical Chemistry II","D":"Recommended Prerequisite: CHM 375. Second semester of a two-semester series that builds upon and completes the topics introduced in CHM 506. May be taught concurrently with CHM 607. Cannot receive credit for both CHM 607 and CHM 507. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 506.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM508","T":"CHM 508 Physical Chemistry Laboratory I","D":"Experiments in physical chemistry employing principles and techniques reflecting material presented in CHM 506. May be taught concurrently with CHM 608. Cannot receive credit for both CHM 608 and CHM 508. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 302; and &quot;C-&quot; or better in CHM 506 or CHM 606 or concurrent enrollment in CHM 506 or CHM 606.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM509","T":"CHM 509 Physical Chemistry Laboratory II","D":"Experiments in physical chemistry employing principles and techniques reflecting material presented in CHM 507. May be taught concurrently with CHM 609. Cannot receive credit for both CHM 609 and CHM 509. ","P":"<em>Prerequisite: CHM 507 or CHM 607 or concurrent enrollment; and CHM 508 or CHM 608.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM514","T":"CHM 514 Polymer Chemistry","D":"Morphology and chemical structure, polymer characterization, chemical structure and polymer properties, vinyl and non-vinyl polymers and mechanism of formation. Inorganic and partially inorganic polymers. May be taught concurrently with CHM 614. Cannot receive credit for both CHM 614 and CHM 514. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 343 or CHM 344; and &quot;C-&quot; or better in CHM 505 or CHM 605 or CHM 506 or CHM 606.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM542","T":"CHM 542 Advanced Organic Chemistry","D":"Structure, reaction mechanisms, stereochemistry and other topics of theoretical nature in organic and polymer chemistry. May be taught concurrently with CHM 642. Cannot receive credit for both CHM 542 and CHM 642. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 343 or CHM 344.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM552","T":"CHM 552 Biochemistry II","D":"Bioenergetics--Metabolism of biomolecules including carbohydrates, lipids, amino acids and nucleotides. Photosynthesis. Nitrogen metabolism. Mechanisms of hormone action. May be taught concurrently with CHM 652. Cannot receive credit for both CHM 552 and CHM 652. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 452.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM553","T":"CHM 553 Advanced Biochemistry Laboratory","D":"Emphasis on modern techniques in the biochemistry laboratory; enzymology, protein purification and analysis; protein structure determination; isoelectric focusing; HPLC; trace techniques. Supplemental course fee. May be taught concurrently with CHM 653. Cannot receive credit for both CHM 553 and CHM 653. ","P":"<em>Prerequisite: CHM 453; and CHM 552 or concurrent enrollment.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM575","T":"CHM 575 Advanced Inorganic Chemistry","D":"Theories and techniques of modern inorganic chemistry; correlation of theories with inorganic compounds. May be taught concurrently with CHM 675. Cannot receive credit for both CHM 575 and CHM 675. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 375.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM597","T":"CHM 597 Special Topics in Chemistry","D":"Selected topics of a theoretical or applied nature. May be repeated up to a total of 6 hours with differing topics. May be taught concurrently with CHM 697. Cannot receive credit for both CHM 697 and CHM 597. ","P":"<em>Prerequisite: 18 hours of chemistry.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM602","T":"CHM 602 Techniques of Instrumental Analysis","D":"Recommended Prerequisite: PHY 124 or PHY 204. Applications of instrumental methods for the separation and analysis of materials; included are potentiometry, photometry and chromatography. Does not apply to a Chemistry major if the student passes CHM 702. May be taught concurrently with CHM 502. Cannot receive credit for both CHM 502 and CHM 602. ","P":"<em>Prerequisite: &quot;C-&quot; or better in either [CHM 201 and 202] or CHM 342; and &quot;C-&quot; or better in CHM 302.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":4,"E":3,"L":3}}
{"I":"CHM605","T":"CHM 605 Fundamentals of Physical Chemistry","D":"A one semester introduction to physical chemistry including the following topics: thermodynamics, solution chemistry, electrochemistry, kinetics, and atomic and molecular structure. Laboratory experiments will illustrate principles of physical chemistry and techniques of analysis. Does not apply to a Chemistry major if the student passes CHM 606. May be taught concurrently with CHM 505. Cannot receive credit for both CHM 505 and CHM 605. ","P":"<em>Prerequisite: 20 hours of chemistry; and &quot;C-&quot; or better in either MTH 287 or MTH 261.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":4,"E":3,"L":3}}
{"I":"CHM606","T":"CHM 606 Physical Chemistry I","D":"Recommended Prerequisite: MTH 302; and PHY 124 or PHY 204. First semester of a two-semester series covering aspects of quantum mechanics, classical and statistical thermodynamics, spectroscopy, kinetic theory of gases, and chemical kinetics. A grade of &quot;C-&quot; or better is required in this course in order to take CHM 607. May be taught concurrently with CHM 506. Cannot receive credit for both CHM 606 and CHM 506. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 170; and MTH 280 or MTH 288 or concurrent enrollment in MTH 280 or MTH 288.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM607","T":"CHM 607 Physical Chemistry II","D":"Recommended Prerequisite: CHM 375. Second semester of a two-semester series that builds upon and completes the topics introduced in CHM 606. May be taught concurrently with CHM 507. Cannot receive credit for both CHM 607 and CHM 507. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 506 or 606.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM608","T":"CHM 608 Physical Chemistry Laboratory I","D":"Experiments in physical chemistry employing principles and techniques reflecting material presented in CHM 506 or 606. May be taught concurrently with CHM 508. Cannot receive credit for both CHM 608 and CHM 508. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 302; and &quot;C-&quot; or better in CHM 506 or CHM 606 or concurrent enrollment in CHM 506 or CHM 606.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM609","T":"CHM 609 Physical Chemistry Laboratory II","D":"Experiments in physical chemistry employing principles and techniques reflecting material presented in CHM 507 or 607. May be taught concurrently with CHM 509. Cannot receive credit for both CHM 609 and CHM 509. ","P":"<em>Prerequisite: CHM 507 or CHM 607 or concurrent enrollment; and CHM 508 or CHM 608.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM614","T":"CHM 614 Polymer Chemistry","D":"Morphology and chemical structure, polymer characterization, chemical structure and polymer properties, vinyl and non-vinyl polymers and mechanism of formation. Inorganic and partially inorganic polymers. May be taught concurrently with CHM 514. Cannot receive credit for both CHM 514 and CHM 614. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 343 or CHM 344; and CHM 505 or CHM 605 or CHM 506 or CHM 606.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM642","T":"CHM 642 Advanced Organic Chemistry","D":"Structure, reaction mechanisms, stereochemistry and other topics of theoretical nature in organic and polymer chemistry. May be taught concurrently with CHM 542. Cannot receive credit for both CHM 542 and CHM 642. ","P":"<em>Prerequisite: &quot;C-&quot; grade or better in CHM 343 or CHM 344.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM652","T":"CHM 652 Biochemistry II","D":"Bioenergetics--Metabolism of biomolecules including carbohydrates, lipids, amino acids and nucleotides. Photosynthesis. Nitrogen metabolism. Mechanisms of hormone action. May be taught concurrently with CHM 552. Cannot receive credit for both CHM 552 and CHM 652. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 452.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM653","T":"CHM 653 Advanced Biochemistry Laboratory","D":"Emphasis on modern techniques in the biochemistry laboratory; enzymology, protein purification and analysis; protein structure determination; isoelectric focusing; HPLC; trace techniques. Supplemental course fee. May be taught concurrently with CHM 553. Cannot receive credit for both CHM 553 and CHM 653. ","P":"<em>Prerequisite: CHM 453; and CHM 552 or CHM 652 concurrent enrollment in CHM 552 or CHM 652.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM675","T":"CHM 675 Advanced Inorganic Chemistry","D":"Theories and techniques of modern inorganic chemistry; correlation of theories with inorganic compounds. May be taught concurrently with CHM 575. Cannot receive credit for both CHM 575 and CHM 675. ","P":"<em>Prerequisite: &quot;C-&quot; or better in CHM 375.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM697","T":"CHM 697 Special Topics in Chemistry","D":"Selected topics of a theoretical or applied nature. May be repeated up to a total of 6 hours with differing topics. May be taught concurrently with CHM 597. Cannot receive credit for both CHM 597 and CHM 697. ","P":"<em>Prerequisite: 18 hours of chemistry.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM700","T":"CHM 700 Chemistry Colloquium","D":"A series of oral presentations on new developments in chemistry. Presentations to be made by faculty members, students, and guest speakers from industry and academe. One of the requirements of this course is an oral presentation. May be repeated, but not more than 2 hours may be counted toward the 32-hour requirement for the MS in Chemistry degree. ","P":"","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"CHM701","T":"CHM 701 Chemistry Seminar","D":"Attendance at oral presentations on new developments in chemistry. Presentations may include those made by departmental faculty members, departmental graduate students, guest speakers from industry and academe and ACS tour speakers. All graduate students not enrolled in CHM 700 must be enrolled in CHM 701. Hours earned will not count toward the 32-hour requirement for the MS in Chemistry degree. Graded Pass/Not Pass only. ","P":"","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"CHM702","T":"CHM 702 Advanced Topics in Analytical Chemistry","D":"An advanced topic in analytical chemistry will be addressed via faculty lectures and student projects. Examples of proposed topics include: electroanalytical methods, nanotechnology, forensic chemistry and data acquisition methods. Variable content course. May be repeated to a total of 6 hours with differing topics. ","P":"<em>Prerequisite: CHM 602.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM710","T":"CHM 710 Special Topics in Chemical Education","D":"A single topic of current interest in the teaching of chemistry will be considered. May be repeated to a total of 9 hours provided the topics are different. ","P":"<em>Prerequisite: coursework sufficient to meet Missouri certification standards in chemistry for secondary teaching or permission.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM720","T":"CHM 720 Topics in Theoretical Chemistry","D":"Nature of matter including atomic structure, chemical bonding and spectroscopy. ","P":"<em>Prerequisite: coursework sufficient to meet Missouri certification standards in chemistry for secondary teaching or permission.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM735","T":"CHM 735 Investigation in Chemistry for Teachers","D":"Techniques in performing science investigation with application to secondary and middle school science. May be taught concurrently with CHM 435. Cannot receive credit for both CHM 435 and CHM 735. ","P":"<em>Prerequisite: coursework sufficient to meet Missouri certification standards for secondary/middle school science teaching.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"CHM740","T":"CHM 740 Seminar","D":"Extensive paper on selected topics to be read before staff seminars. May be repeated to total 4 hours. ","P":"","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"CHM742","T":"CHM 742 Physical Organic Chemistry","D":"An in-depth study of the experimental techniques and physical principles used for the determination of organic reaction mechanisms. ","P":"<em>Prerequisite: CHM 642.</em>","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM752","T":"CHM 752 Advanced Topics in Biochemistry","D":"An advanced topic in biochemistry will be addressed via faculty lectures and student projects. Examples of proposed topics include: carbohydrates, the cell surface, and physical biochemistry. Variable content course. May be repeated to a total of 6 hours with differing topics. ","P":"<em>Prerequisite: CHM 652.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM760","T":"CHM 760 Chemistry of Environmental Systems: Water and Land","D":"Recommended Prerequisite: some advanced coursework in chemistry, geosciences, biology, or related fields. Chemistry of water and soil, water treatment, agricultural chemistry, and related topics. May be taught concurrently with CHM 460. Cannot receive credit for both CHM 460 and CHM 760. ","P":"","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM761","T":"CHM 761 Chemistry of Environmental Systems: Air and Energy","D":"Recommended Prerequisite: some advanced coursework in chemistry, geosciences, biology, or related fields. Atmospheric chemistry; pollution issues related to power production and transportation; energy sources and fuels. May be taught concurrently with CHM 461. Cannot receive credit for both CHM 761 and CHM 461. ","P":"","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM762","T":"CHM 762 Chemistry of Environmental Systems Laboratory","D":"Techniques and procedures for environmental monitoring to test natural samples. Applications and limitations of wet chemical and instrumental methods such as atomic absorption, gas chromatography, and absorption spectrophotometry. May be taught concurrently with CHM 462. Cannot receive credit for both CHM 462 and CHM 762. ","P":"<em>Prerequisite: CHM 760 or concurrent enrollment.</em>","L":"courses_ch","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"CHM770","T":"CHM 770 Chemical Kinetics","D":"Fundamental concepts of chemical kinetics and dynamics, from both macroscopic and molecular level perspectives. An emphasis will be placed on the interpretation of gas, liquid, surface and catalyst reaction kinetics and mechanisms. ","P":"<em>Prerequisite: CHM 606.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM771","T":"CHM 771 Chemical Bonding","D":"Quantum mechanics; atomic and molecular structure; computational procedures. Independent study project required. ","P":"<em>Prerequisite: CHM 607.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM775","T":"CHM 775 Organometallic Chemistry","D":"An in-depth examination of the structure, properties, and reactions of molecules containing one or more metal atoms bonded to organic fragments. ","P":"<em>Prerequisite: CHM 675.</em>","L":"courses_ch","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHM790","T":"CHM 790 Advanced Topics in Chemistry","D":"Detailed treatment of various advanced topics in chemistry. Topics may include: water analysis, physical chemistry of macromolecules, chemistry of natural products, surface chemistry, and forensic chemistry. Variable content course. May be repeated to a total of 6 hours with differing topics. ","P":"","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM796","T":"CHM 796 Science Internship","D":"Completion of an internship project (80 hours/credit hour) at a discipline-related business, nonprofit organization, or government agency, approved and supervised by both the departmental and internship advisors. Includes a formal report in the appropriate professional format, and an oral presentation at an approved venue. Graded Pass/Not Pass only. No more than 6 hours may count toward a masters degree. ","P":"","L":"courses_ch","O":{"F":true,"S":true,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM798","T":"CHM 798 Research","D":"Supervised research in special chemistry areas. May be repeated, but not more than 6 hours of CHM 798 may be counted toward the 32-hour requirement for the MS degree. ","P":"","L":"courses_ch","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHM799","T":"CHM 799 Thesis","D":"Independent research and study connected with preparation of thesis. Not more than 6 hours of CHM 799 may be counted toward the 32-hour requirement for the MS degree. ","P":"","L":"courses_ch","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
