{"I":"ART98","T":"ART 98 Topics in Art and Design","D":"A variable content course consisting of lectures and/or studio projects. Cannot be used to fulfill a major requirement in the Art and Design Department. May be repeated to a total of 6 hours. ","P":"","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ART100","T":"ART 100 Two-Dimensional Design","D":"Elements and principles of two-dimensional design. Experience with a variety of media and subject matter. ","P":"","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART101","T":"ART 101 Three-Dimensional Design","D":"Elements and principles of three dimensional design. Experience with a variety of media and subject matter. ","P":"<em>Prerequisite: ART 100.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART110","T":"ART 110 Two-Dimensional Design for Digital Media","D":"Elements and principles of two-dimensional design. Computers will be used extensively in this class. Will not count toward the BA in Art or Design, BFA in Art or Design, or the BSEd in Art and Design. ","P":"","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART115","T":"ART 115 Drawing I","D":"Basic elements and principles of drawing. A problematic approach to the process of seeing and drawing through an applied investigation of natural and man-made forms. ","P":"","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART200","T":"ART 200 Art in Context","D":"In this art appreciation course students will learn how to look at objects of art and to appreciate the value such objects hold in society. This course introduces the elements of art and the principles of design and is intended to enhance an interest, appreciation, and understanding of the visual arts in the context of their cultures. Does not count toward fulfilling any requirement for majors or minors in the Department of Art and Design. ","P":"<em>General Education Course (Focus on the Arts).</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART202","T":"ART 202 Intermediate Design","D":"A presentation in greater depth of major theories of art and design with emphasis on color theory and systems. Structured studio design problems applying and investigating such theories. ","P":"<em>Prerequisite: ART 100 and ART 101 and ART 115.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART210","T":"ART 210 Introduction to Digital Arts","D":"Exploration of digital art forms, focusing on the interrelationship of the digital technology on art and culture. The goal of the course is to weave technical skills into creative vision. ","P":"<em>Prerequisite: ART 100 or ART 110; and CIS 101 or CSC 101 or CSC 111.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART212","T":"ART 212 Ceramics I","D":"An introduction to handbuilding, wheel and firing processes, including raku. Fundamentals of ceramic materials, equipment, and preparation of clay and glazes. ","P":"","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART215","T":"ART 215 Drawing II","D":"Continuation of drawing fundamentals in greater depth and exploration of additional media. ","P":"<em>Prerequisite: ART 115.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART223","T":"ART 223 Metals-Jewelry I","D":"Introduction to non-ferrous metal fabrication processes including piercing, soldering and finishing. Fundamentals of tools, materials, and jewelry concepts. ","P":"","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART225","T":"ART 225 Painting I","D":"Basic investigation of materials, techniques, and visual concepts important to the process of painting. Emphasis on understanding visual elements through work which includes study from the still-life and model. ","P":"<em>Prerequisite: ART 100 and ART 115 and ART 215.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART226","T":"ART 226 Watercolor for the Non-Art Majors","D":"To acquaint the student with the essential characteristics of the materials used in watercolor painting and to familiarize the student with the techniques used in applying transparent pigment to various prepared surfaces. This course will not fulfill the requirements for a major or a minor in art. ","P":"","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART230","T":"ART 230 Computer Animation I","D":"Exploration of visual expression through the use of sequential images. Experience with a wide range of digital processes. ","P":"<em>Prerequisite: ART 100 or ART 110.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART235","T":"ART 235 Sculpture I","D":"Development of fundamental and personal concepts concerning subject matter as related to sculpture. Experience with a wide range of media and techniques. ","P":"<em>Prerequisite: ART 101.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART242","T":"ART 242 Printmaking I","D":"Beginning problems in printmaking. ","P":"<em>Prerequisite: ART 100 and ART 115 and ART 215.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART243","T":"ART 243 Relief Print","D":"An exploration of the relief processes through the mediums of linocut and woodcut. ","P":"<em>Prerequisite: ART 215.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART253","T":"ART 253 Fibers","D":"Introduction to two and three-dimensional fiber techniques and structures. Emphasis will be placed on using a variety of techniques in the execution of assigned problems. Experimental use of materials will be encouraged. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 100.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART255","T":"ART 255 Photography I","D":"Basic course in black and white photography. Includes camera controls and darkroom work. Photography as visual expression. ","P":"<em>Prerequisite: ART 100.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART271","T":"ART 271 History of Western Art I","D":"A survey of Western art and the cultures that produced it from Prehistory through the Gothic period. ","P":"<em>Prerequisite: ENG 110. General Education Course (Focus on Humanities).</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART272","T":"ART 272 History of Western Art II","D":"A survey of Western art and the cultures that produced it from the Gothic Period to the Second World War. ","P":"<em>Prerequisite: ENG 110. General Education Course (Focus on Humanities).</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART273","T":"ART 273 Survey of the Art of Africa, Oceania, and the Americas","D":"A survey of the art and architecture produced by the cultures of Africa, Oceania, and the Americas. ","P":"<em>Prerequisite: ENG 110. General Education Course (Focus on Humanities).</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART274","T":"ART 274 Survey of Asian Art","D":"A survey of the art objects and the cultures which produced them, primarily those of India, China, and Japan. ","P":"<em>Prerequisite: ENG 110. General Education Course (Focus on Humanities).</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART300","T":"ART 300 Fundamentals of Collaboration in Electronic Arts","D":"Exploration of aesthetic and communication issues involved in producing work in interdisciplinary electronic media. ","P":"<em>Prerequisite: permission of the instructor based on passing Candidacy Review in Electronic Arts.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART301","T":"ART 301 Introduction to Video Game Design","D":"An introduction to the main elements of video game design (including setting, story, goals, narrative, mechanics, and level design) and the structure and responsibilities of a game development team. The emphasis will be on game designs that could be implemented by a small team within one year. Students will design a game and create a design document. Identical with CSC 301. Cannot receive credit for both ART 301 and CSC 301. ","P":"<em>Prerequisite: 30 hours; and eligible for Writing II; and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"ART302","T":"ART 302 Introductory Video Game Development for Artists and Animators","D":"Hands-on introduction to video game development software, emphasizing the process to prepare and import 3D assets from previously learned software packages. Students may collaborate with CSC 303 students to experience industry-typical workflow between designers, artists and programmers. ","P":"<em>Prerequisite: ART/CSC 301 and ART 330.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"ART310","T":"ART 310 Time-Based Digital Arts","D":"This course explores video art, focusing on production and theory with an emphasis on creative expression. Alternative means of moving image can be explored as well. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: ART 210.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART312","T":"ART 312 Ceramics II","D":"A continued investigation of the potter&apos;s wheel as a tool to create ceramic forms. Greater exploration of surface enhancement materials, and processes including basic glaze chemistry and firing operations. Evidence of expanded individuality in the understanding of advanced technique and sensitivity to form expected. ","P":"<em>Prerequisite: ART 101 and ART 212.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART313","T":"ART 313 Ceramics III","D":"Advanced studio and firing responsibilities. Must be repeated to a total of 6 hours. The first three credit hours: a continued investigation of hand-building techniques as a way to create ceramic forms and exploring further development of surface treatments. When repeated, the second three credit hours: advanced problems associated with clay and form and surface treatment. Evidence of expanded individuality in the understanding of advanced technique and sensitivity of form expected. Must be repeated to a total of 6 hours. ","P":"<em>Prerequisite: ART 312.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART314","T":"ART 314 Special Topics in Ceramics","D":"Specialized studies in ceramics to include subjects in such areas as raku, salt firing, kiln building, glaze formulations, handbuilding, etc. Subject of course to be selected by the instructor. May be repeated to a total of 12 hours when course content changes. Variable content course. ","P":"<em>Prerequisite: ART 212.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART315","T":"ART 315 Drawing III","D":"Problems of greater visual and conceptual complexity. More emphasis given to development of individual qualities. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 215.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART316","T":"ART 316 Life Drawing","D":"Drawing the human figure with emphasis on anatomy, structure, and form. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 215.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART322","T":"ART 322 Jewelry and Metalsmithing","D":"Further exploration of metal fabrication processes. Introduction to jewelry scale casting and to silversmithing techniques. ","P":"<em>Prerequisite: ART 101 and ART 223.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART323","T":"ART 323 Jewelry, Metals, and Enameling","D":"Further exploration of metal fabrication and smithing processes. Introduction to enameling and other color techniques on metal. ","P":"<em>Prerequisite: ART 101 or concurrent enrollment; and ART 223.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART324","T":"ART 324 Metals and Jewelry III","D":"Advanced problems in metals. Greater exploration of materials and techniques with an emphasis on individual problem-solving. May be repeated to a total of 12 hours. ","P":"<em>Prerequisite: ART 322 and ART 323.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART325","T":"ART 325 Painting II","D":"Problems of greater visual and conceptual complexity. More emphasis given to development of individual qualities. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: ART 225.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART326","T":"ART 326 Painting with Water-Based Media","D":"A course which introduces and explores one or more water-based media such as watercolor, gouache, casein and acrylic. Media emphasis to be determined by the instructor. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 225.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART330","T":"ART 330 Computer Animation II","D":"Further exploration of visual expression in animation. Advanced techniques in the manipulating of forms and animation. Advanced techniques in the manipulating of forms and surfaces within the digital 3D environment. ","P":"<em>Prerequisite: ART 230.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART331","T":"ART 331 Computer Animation III","D":"Priority will be given to those students who have successfully completed the Computer Animation Emphasis Candidacy Review for the BFA in Art or the BS in Electronic Arts. Further exploration of visual expression in animation. Advanced techniques in animating within the digital 3D environment. ","P":"<em>Prerequisite: ART 330 and permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART335","T":"ART 335 Sculpture II","D":"Individual problems and concepts in organizing mass and space utilizing a range of techniques and media, including metal casting and welding, carving, plastics, and fibers. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 235.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART336","T":"ART 336 Figure Modeling","D":"Modeling the human figure with emphasis on anatomy, structure and form by exploring the usage of clay, wax or plaster. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 100 and ART 101 and ART 215.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART342","T":"ART 342 Printmaking II","D":"Advanced problems in printmaking. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 242.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART343","T":"ART 343 Lithography","D":"Exploration of stone lithography as an expressive means toward creating hand-pulled prints. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 242.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART354","T":"ART 354 Medium Format Photography","D":"An investigation of technical and aesthetic issues of medium format photography. Emphasis on the development of expressive photographic images. ","P":"<em>Prerequisite: ART 255.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART355","T":"ART 355 Large Format Photography","D":"An investigation of technical and aesthetic issues of large format photography. Emphasis on the development of expressive photographic images. ","P":"<em>Prerequisite: ART 255.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART356","T":"ART 356 Color Photography","D":"An investigation of technical and aesthetic issues of color photography. Emphasis on the development of expressive photographic images. ","P":"<em>Prerequisite: ART 255.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART357","T":"ART 357 Special Topics in Photography","D":"Alternative photographic approaches to broaden the photographic experience. Subject of course to be selected by the instructor. Variable content course. ","P":"<em>Prerequisite: ART 255 and permission.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART358","T":"ART 358 Studio Photography","D":"An investigation of technical, aesthetic, and conceptual issues of studio photography with emphasis on the portrait and the still-life. ","P":"<em>Prerequisite: ART 355 and ART 359.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART359","T":"ART 359 Digital Photography","D":"An investigation of technical and aesthetic issues of digital photography including the use of a digital camera, film scanning, software, and digital output. The development of expressive photographic images, an exploration of the potentials of the medium, and the evolution of a body of work are emphasized. ","P":"<em>Prerequisite: ART 356.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART360","T":"ART 360 Introduction to Art Education","D":"Introduction to the field of art education and the role of visual arts in education; survey of issues, theories, and trends; review of content, materials, and approaches through discussion, research, studio experiences, critical writing, observation of classes, and analysis of models for teaching art in elementary and secondary schools. ","P":"<em>Prerequisite: ART 100 and ART 101 and ART 215.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":3}}
{"I":"ART366","T":"ART 366 Elementary Art Education","D":"Overview of artistic growth of children; survey of philosophies, issues, methods, materials, resources, processes, and strategies for teaching art and integrating it into the school curriculum; unit and lesson planning, assessment, and evaluation. Lecture, discussion, studio, and classroom observations. Credited only for BSEd. ","P":"<em>Prerequisite: ART 360.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":3}}
{"I":"ART374","T":"ART 374 Art of India","D":"Survey of the major art and architecture monuments of India and the cultural context from which they were produced. ","P":"<em>Prerequisite: ART 274.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART377","T":"ART 377 History of Graphic and Applied Design","D":"An historical and critical examination of design from its beginnings to the present with emphasis on communication design in the industrial and post-industrial periods. Will not count as Art History elective for the BFA in Art. ","P":"<em>Prerequisite: ART 271 or ART 272 or ART 274.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART378","T":"ART 378 Women and Art","D":"The course examines women&apos;s roles and contributions in the history of art and culture. May be counted toward the Gender Studies minor. ","P":"<em>Prerequisite: ART 271 or ART 272.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART381","T":"ART 381 The Art of the United States of America","D":"The art of the United States from its pre-Revolutionary days to the present. ","P":"<em>Prerequisite: ART 272.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART382","T":"ART 382 Survey of Islamic Art","D":"A survey of the art produced in the lands under the influence of the Islamic religion. ","P":"<em>Prerequisite: ART 271, ART 273 or ART 274.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART385","T":"ART 385 Art of the Americas","D":"A survey of the art and architecture of North America, Mesoamerica, Central America, and South America and the cultures that produced it. ","P":"<em>Prerequisite: ART 273.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART386","T":"ART 386 Art of Africa","D":"A survey of the art and architecture of Africa and the cultures that produced it. ","P":"<em>Prerequisite: ART 273.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART387","T":"ART 387 History of Photography","D":"The development and history of photography as an artistic medium. ","P":"<em>Prerequisite: ART 272.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART388","T":"ART 388 The Museum: History and Perspectives","D":"This course offers a broad introduction to the museum as a cultural site and museum studies as a discipline with focus on theoretical issues. Identical with MST 388. Cannot receive credit for both ART 388 and MST 388. ","P":"<em>Prerequisite: ENG 110 and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART390","T":"ART 390 Art History Teaching Assistant","D":"Under the direct guidance of the professor, the student will assist the professor in teaching, supervising, and/or grading course materials. May be repeated to a total of 3 hours. Graded Pass/Not Pass only. Does not count toward the BA or BSEd in Art and Design or BFA in Art or BFA in Design. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"ART399","T":"ART 399 Individual Instruction","D":"Independent work on special projects approved by studio advisor. Repeatable to a total of 6 hours in any studio area. ","P":"<em>Prerequisite: senior or postbaccalaureate standing; 12 sequential hours in same studio area and permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART401","T":"ART 401 Teaching of Art","D":"Artistic and aesthetic growth of adolescents; survey of philosophies, issues, methods, materials, resources, processes, and strategies for teaching art in secondary schools; observation; unit and lesson planning; microteaching. Credited only on BSEd (Secondary). A grade of &quot;C&quot; or better is required in this course in order to take ART 490 or ART 491. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: ART 366; and EDC 350 or concurrent enrollment; and admitted to teacher education program.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":3}}
{"I":"ART407","T":"ART 407 Art Internship","D":"Student will complete actual job assignments while working for outside organizations under the supervision of an art faculty member. May be repeated to a total of 6 hours. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ART410","T":"ART 410 Seminar in Digital Arts","D":"Advanced research in digital arts, with emphasis on developing personal vision. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: ART 310.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART425","T":"ART 425 Painting III","D":"An advanced-level course utilizing a combination of structured and self-directed approaches. Students will continue to develop formal skills and will be encouraged to explore issues of content and visual aesthetics, while developing an individual point-of-view. Repeatable up to 9 hours. ","P":"<em>Prerequisite: ART 325.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART430","T":"ART 430 Computer Animation IV","D":"Individual problems in animation and advanced techniques. Emphasis will be placed on the development of a personal point of view. ","P":"<em>Prerequisite: ART 331.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART431","T":"ART 431 Professional Practices in Computer Animation","D":"Lecture, discussion and assignments for students seeking careers in computer animation. Presentation skills will be emphasized. Students will be required to write and perform research, as well as continue to develop their portfolio. ","P":"<em>Prerequisite: ART 430.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART432","T":"ART 432 Computer Animation V","D":"Individual portfolio development in animation. Emphasis will be placed on the development of a personal point of view. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: ART 431.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART454","T":"ART 454 Digital Photography II","D":"A continued investigation of technical, aesthetic, and conceptual issues of digital photography including advanced approaches to image processing, the use of smart objects, masking, compositing, quadtone printing, selective sharpening, and additional software developments deemed relevant to current practices. The development of expressive photographic images, an exploration of the potentials of the medium, and the evolution of a body of work are emphasized. ","P":"<em>Prerequisite: ART 359.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART455","T":"ART 455 Advanced Photography Seminar","D":"Pursuit of advanced photographic projects. Emphasis on development of personal vision. A study of historical and contemporary critical issues in photography. Must be taken at least once with ART 499. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: 12 hours in emphasis and permission of the instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART460","T":"ART 460 Critical Studies in Art Education","D":"Review of theories and issues concerning the study of aesthetics, art history, and art criticism in art education; survey of methods; observation of various models; generation of materials, resources, and strategies for implementation; teaching experiences utilizing strategies. ","P":"<em>Prerequisite: ART 366 and ART 401.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":3}}
{"I":"ART466","T":"ART 466 Art Education Practicum","D":"Observation and classroom teaching experiences; writing unit and lesson plans; classroom motivation, management, and discipline; evaluation and exhibition of student art work; ordering supplies and equipment. ","P":"<em>Prerequisite: 30 hours of Art and ART 366 and ART 401.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":3}}
{"I":"ART469","T":"ART 469 Clinical Experiences in Teaching II","D":"This course is designed to meet HB 1711 for student&apos;s experience as a Teacher&apos;s Aide or Assistant Rule (Rule 5 CSR 80-805.040), to that of conventional student teachers within the same program. It is also designed to support completion of additional clinical requirements within that program including: seminars and workshops, required meetings, school related activities appropriate to the assignment, demonstrated mastery of the MoSPE standards and completion and overall assessment of a Professional Preparation Portfolio. This course is credited only on BSEd or appropriate masters-level certification programs. Can only receive credit for one of the following: AGE 499, AGT 499, ART 469, BSE 499, COM 493, ECE 499, ELE 499, ENG 434, FCS 498, HST 499, KIN 498, MCL 491, MID 499, MTH 496, MUS 499, SCI 499, SEC 499, SPE 499, THE 493. Supplemental course fee. ","P":"<em>Prerequisite: EDC 199; and admitted to Teacher Education Program; and grades of &quot;C&quot; or better in all professional education courses; and completion of portfolio checkpoints 1 and 2; and current pre-professional liability insurance; and program approval.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":0,"L":0}}
{"I":"ART472","T":"ART 472 Medieval Art","D":"Painting, sculpture, and architecture of Europe from the fourth century through the fourteenth century. The course emphasizes the development of a distinctly European art and culture. May be taught concurrently with ART 672. Cannot receive credit for both ART 472 and ART 672. ","P":"<em>Prerequisite: ART 271.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART474","T":"ART 474 Classical Art","D":"A survey of the art and architecture of Greece and Rome including the art of Crete and Mycenae. ","P":"<em>Prerequisite: ART 271.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART475","T":"ART 475 Art of the Renaissance","D":"A survey of painting, sculpture, and architecture in Europe from 1300-1575. May be taught concurrently with ART 675. Cannot receive credit for both ART 475 and ART 675. ","P":"<em>Prerequisite: ART 272.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART478","T":"ART 478 Baroque Art","D":"The major figures and developments in art and architecture from Mannerism through the Rococo in Italy and Northern Europe. May be taught concurrently with ART 678. Cannot receive credit for both ART 478 and ART 678. ","P":"<em>Prerequisite: ART 272.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART479","T":"ART 479 19th Century Art","D":"The major figures and developments in art and architecture from Neo-Classicism through the end of the century in Europe. ","P":"<em>Prerequisite: ART 272.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART480","T":"ART 480 Modern Art","D":"A study of the objects, artists, ideas, and movements which are a part of the modern and late modern tradition from the mid 19th Century through the period following the Second World War. May be taught concurrently with ART 680. Cannot receive credit for both ART 480 and ART 680. ","P":"<em>Prerequisite: ART 272.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART483","T":"ART 483 Modern Architecture and Urban Forms","D":"A survey of the historical, social, political, economic and technological forces that have shaped the forms and styles of architecture and cities from the time of the Industrial Revolution to the present. ","P":"","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART484","T":"ART 484 Contemporary Art","D":"This course will emphasize the issues raised during the transition to &quot;Post-Modern&quot; culture in the last decades of the 20th Century and the beginning years of the 21st Century. The approach and the assignments will employ theoretical and critical as well as historical thinking. May be taught concurrently with ART 684. Cannot receive credit for both ART 484 and ART 684. ","P":"<em>Prerequisite: ART 272.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART485","T":"ART 485 Art of Mesoamerica","D":"The art and architecture of Mesoamerica and the cultures that produced it. May be taught concurrently with ART 685. Cannot receive credit for both ART 485 and ART 685. ","P":"<em>Prerequisite: ART 273.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART488","T":"ART 488 Basic Conservation of Art and Artifacts","D":"This course combines advanced art historical study and research of art and artifacts with a hands-on introduction to basic conservation techniques. Identical with MST 488. Cannot receive credit for both ART 488 and MST 488. May be taught concurrently with ART 688. Cannot receive credit for both ART 488 and ART 688. ","P":"<em>Prerequisite: relevant Art History survey course (ART 271, 272, 273 or 274) and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"ART490","T":"ART 490 Supervised Teaching (Secondary Art and Design)","D":"Student observes then teaches art classes under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: completion of all method courses in Art Education; a grade of &quot;C&quot; or better in all professional education courses; current pre-professional liability insurance; and approval for supervised teaching.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":0,"L":0}}
{"I":"ART491","T":"ART 491 Supervised Teaching (Elementary Art and Design)","D":"Student observes then teaches under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. Student participates in the program exit exhibition, &quot;Students of Students Show&quot;. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: concurrent enrollment in ART 490.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":0,"L":0}}
{"I":"ART492","T":"ART 492 Art and Theory","D":"This course will introduce students to a range of critical art theories from the late 19th Century through the 21st Century, addressing what has been thought and written about art from various perspectives. Public Affairs Capstone Experience course. May be taught concurrently with ART 692. Cannot receive credit for both ART 492 and ART 692. ","P":"<em>Prerequisite: 6 hours of art history at the 300- or 400- level; and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART494","T":"ART 494 Independent Study in Art History","D":"Individual projects and special problems in Art History. Permission granted only in special circumstances. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: appropriate survey course (ART 271 or ART 272 or ART 273 or ART 274); and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART495","T":"ART 495 Internship in Art History","D":"Students will complete various duties as assigned with a variety of art history-related organizations. These areas include local museums, galleries, and/or visual resource-media collections. Variable content course. May be repeated to a total of 6 hours. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ART496","T":"ART 496 Selected Topics in Art History","D":"The specific topics will change from semester to semester depending upon the interest of students and professors, e.g. German Expressionism, History of Photography, The School of Paris, Cubism and its Progeny, Pre-Columbian Art in North America. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART497","T":"ART 497 Selected Topics in Art and Design","D":"Advanced problems involving the application of art and design fundamentals in either two or three dimensional projects will be explored. May be repeated to a total of 9 hours when course content changes. Variable content course. ","P":"<em>Prerequisite: ART 100 and ART 101 and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ART498","T":"ART 498 Senior Project in Electronic Arts","D":"Admission to this course is contingent upon the successful completion of the Electronics Arts junior portfolio review and the achievement of a &quot;C&quot; or better grade in all required option courses completed at the time of the junior portfolio review. Under advisement from faculty, EA students will form production teams consisting of computer animation, video, interactive new media and audio studies students. Each team will produce a broadcast-quality project over two semesters. The first semester will be spent in pre-production preparations for the approved senior project. The second semester will involve production and post-production of the approved project. This course must be repeated in sequence for a total of four hours across a single academic year. Identical with MED 498. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: ART 300 and permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"ART499","T":"ART 499 Senior Exhibition","D":"Must be taken concurrently with upper division course in area of emphasis. Presentation of work from area where the majority of art course work has been taken. This work must evidence the attainment of a level of conceptual and technical maturity judged by a committee of the art studio faculty to meet qualitative standards required for the granting of the BFA degree in art. Cannot be taken Pass/Not Pass. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: senior standing; and completion of BFA Candidacy Review; and 3.00 GPA in the art studio BFA emphasis area; and permission of studio advisor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"ART590","T":"ART 590 Art Studio Workshops","D":"Focused study in specific studio area, emphasis on upgrading skills and extending understanding of aesthetic and visual qualities. May be repeated to a total of 6 hours. Variable content course. May be taught concurrently with ART 690. Cannot receive credit for both ART 690 and ART 590. ","P":"","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"ART598","T":"ART 598 Seminar in Art Education","D":"In-depth study of specific topics and/or interaction with leaders in the fields of aesthetics, art criticism, art history, art making, and art education. May be repeated to a total of 6 hours. Variable content course. May be taught concurrently with ART 698. Cannot receive credit for both ART 698 and ART 598. Supplemental course fee (variable by section). ","P":"","L":"courses_ar","O":{"F":false,"S":false,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"ART672","T":"ART 672 Medieval Art","D":"Painting, sculpture, and architecture of Europe from the fourth century through the fourteenth century. The course emphasizes the development of a distinctly European art and culture. May be taught concurrently with ART 472. Cannot receive credit for both ART 672 and ART 472. ","P":"<em>Prerequisite: 3 hours of art history at the undergraduate upper division level or graduate level and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART675","T":"ART 675 Art of the Renaissance","D":"A survey of painting, sculpture, and architecture in Europe from 1300-1575. May be taught concurrently with ART 475. Cannot receive credit for both ART 675 and ART 475. ","P":"<em>Prerequisite: 3 hours of art history at the undergraduate upper division level or graduate level and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART678","T":"ART 678 Baroque Art","D":"The major figures and developments in art and architecture from Mannerism through the Rococo in Italy and Northern Europe. May be taught concurrently with ART 478. Cannot receive credit for both ART 678 and ART 478. ","P":"<em>Prerequisite: 3 hours of art history at the undergraduate upper division level or graduate level and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART680","T":"ART 680 Modern Art","D":"A study of the objects, artists, ideas, and movements which are a part of the modern and late modern tradition from the mid 19th Century through the period following the Second World War. May be taught concurrently with ART 480. Cannot receive credit for both ART 680 and ART 480. ","P":"<em>Prerequisite: 3 hours of art history at the undergraduate upper division level or graduate level and permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART684","T":"ART 684 Contemporary Art","D":"This course will emphasize the issues raised during the transition to &quot;Post-Modern&quot; culture in the last decades of the 20th Century and the beginning years of the 21st Century. The approach and the assignments will employ theoretical and critical as well as historical thinking. May be taught concurrently with ART 484. Cannot receive credit for both ART 684 and ART 484. ","P":"<em>Prerequisite: 3 hours of art history at the undergraduate upper division level or graduate level and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART685","T":"ART 685 Art of Mesoamerica","D":"The art and architecture of Mesoamerica and the cultures that produced it. May be taught concurrently with ART 685. Cannot receive credit for both ART 685 and ART 485. ","P":"<em>Prerequisite: 3 hours of art history at the undergraduate upper division level or graduate level and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART688","T":"ART 688 Basic Conservation of Art and Artifacts","D":"This course combines advanced art historical study and research of art and artifacts with a hands-on introduction to basic conservation techniques. May be taught concurrently with ART 488 and/or MST 488. Cannot receive credit for both ART 688 and ART 488 and/or MST 488. ","P":"<em>Prerequisite: 3 hours of art history at the undergraduate upper level or graduate level and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"ART690","T":"ART 690 Art Studio Workshops for Art Educators","D":"Focused study in specific studio area, emphasis on upgrading skills and extending understanding of aesthetic and visual qualities. Variable Content Course. May be repeated to a total of 6 hours. May be taught concurrently with ART 590. Cannot receive credit for both ART 590 and ART 690. ","P":"","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"ART692","T":"ART 692 Art and Theory","D":"This course will introduce students to a range of critical art theories from the late 19th Century through the 21st Century, addressing what has been thought and written about art from various perspectives. May be taught concurrently with ART 492. Cannot receive credit for both ART 692 and ART 492. ","P":"<em>Prerequisite: 3 hours of art history at the undergraduate upper division level or graduate level and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART698","T":"ART 698 Seminar in Art Education","D":"In-depth study of specific topics and/or interaction with leaders in the fields of aesthetics, art criticism, art history, art making, and art education. May be repeated to a total of 6 hours. Variable content course. May be taught concurrently with ART 598. Cannot receive credit for both ART 598 and ART 698. Supplemental course fee. ","P":"","L":"courses_ar","O":{"F":false,"S":false,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"ART699","T":"ART 699 Graduate Studio","D":"Individual graduate studio research in visual art/design. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART700","T":"ART 700 Historical Perspectives in Art Education","D":"A history of ideas in art education and the individuals who have made significant contributions to the field; overview of beliefs, values, and practices and the role of art and art education in society. ","P":"","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART701","T":"ART 701 Directed Graduate Studio I","D":"Graduate studio research in visual art/design in preparation for thesis development. Course content to be determined by the student under the supervision of a graduate faculty member. ","P":"<em>Prerequisite: admission to the MFA in Visual Studies program and permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART702","T":"ART 702 Directed Graduate Studio II","D":"Continuation of ART 701. Graduate studio research in visual art/design. Course content to be determined by student under the supervision of a graduate faculty member. ","P":"<em>Prerequisite: ART 701 and permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART703","T":"ART 703 Directed Graduate Studio III","D":"Continuation of ART 702. Graduate studio research in visual art/design. Course content to be determined by student under the supervision of a graduate faculty member. ","P":"<em>Prerequisite: ART 702 and permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART704","T":"ART 704 Directed Graduate Studio IV","D":"Continuation of ART 703. Graduate studio research in visual art/design. Course content to be determined by student under the supervision of a graduate faculty member. ","P":"<em>Prerequisite: ART 703 and permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART710","T":"ART 710 Professional Practices","D":"A comprehensive study in theoretical and practical aspects of succeeding as a practicing artist or designer both inside and outside the academic setting. Students will survey the procedure and common practices expected of the artist or designer as a productive member of the professional community and educator in the field. This course should be taken before the Thesis course at the end of the student&apos;s graduate career. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART760","T":"ART 760 Contemporary Issues and Current Trends in Art Education","D":"Critical examination of current issues and theories concerning the teaching of art; analysis of relationships between historical purposes and current practice; interpretation and evaluation of recent research. ","P":"","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART783","T":"ART 783 Practicum in Art Education and Educational Workshops","D":"Observation and classroom teaching experiences; writing unit and lesson plans; classroom motivation, management and discipline; educational seminar workshops; and exhibition of K-12 student artworks. ","P":"<em>Prerequisite: ART 360 and ART 366 and 30 hours of studio art.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":3}}
{"I":"ART785","T":"ART 785 Independent Study","D":"Independent work in one studio area, directed and critiqued by studio advisor. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: portfolio review of work in selected studio area.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"ART794","T":"ART 794 Independent Study in Art History","D":"Individual projects and special problems in Art History. Permission granted only in special circumstances. May be repeated to a total of 9 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ART795","T":"ART 795 Graduate Internship in Art History","D":"Student will complete various duties as assigned with art history-related organizations. These include local museums, galleries, and/or various resource-media collections. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ART797","T":"ART 797 Teaching Practicum","D":"This course will address topics unique to university art and design faculty and professional practices in various fields teaching visual studies. Successful completion of this course is needed to participate in Missouri State University&apos;s Teaching Assistant Program or to become a Per Course (or adjunct) instructor while enrolled in the MFA program. Students will survey topics pertaining to effective university level instruction through the exploration of course development, organization and public communication skills. Topics such as how and why students learn, where to find teaching resources and how to refine a learning environment will be discussed through a variety of formats and activities in the class. A mentor/mentee program will also be a component of this course to allow students to shadow experienced professors and learn through observation. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ART798","T":"ART 798 Graduate Studio Seminar","D":"Seminar exploration of current formal and conceptual problems in visual art/design through discussion and critique of study research. May be repeated for a total of 6 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"ART799","T":"ART 799 Graduate Studio Thesis","D":"Concentrated activity in the major field of study in preparation for the thesis exhibition/presentation. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":6,"E":0,"L":0}}
{"I":"DES202","T":"DES 202 Graphic Design Systems","D":"Abstract and theoretical applications of design systems including grid information, various symmetries, and printed page formats. ","P":"<em>Prerequisite: ART 100 and ART 101 and ART 215; Missouri State GPA of at least 2.50; and a major GPA of at least 2.50.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES210","T":"DES 210 Introduction to Computer Graphic Design","D":"An introduction to methods of image creation and visual communication via available computer graphic software packages. Emphasis will be placed on the use of the computer as a production tool for graphic designers. ","P":"<em>Prerequisite: Missouri State GPA of at least 2.50; and a GPA of 2.50 or higher in the major; and ART 100 and ART 101 and ART 215; and either CIS 101 or CSC 101 or CSC 111.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES250","T":"DES 250 Materials and Techniques for Illustration","D":"A study of methods and materials used in traditional illustration. ","P":"<em>Prerequisite: Missouri State GPA of at least 2.50 and a GPA of 3.00 or higher in the major; and ART 100 and ART 101 and ART 215 and admitted to BFA Design.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES300","T":"DES 300 Graphics for the Non-Design Major","D":"An investigation of how basic design principles relate to graphic communication as well as the study of processes used in preparing designs for reproduction. The student will apply this knowledge in a number of assigned design problems. Course will not count toward the BFA degree in Design. ","P":"<em>Prerequisite: ART 100.</em>","L":"courses_ar","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES301","T":"DES 301 Graphic Production","D":"The study of materials and mechanical processes required for single, multiple, and four-color print production. ","P":"<em>Prerequisite: C or better in both DES 202 and DES 210 and concurrent enrollment in either ART 202 or ART 255.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES303","T":"DES 303 Basic Typography","D":"Introduction to basic typographic forms and their use in visual communication. The application of design principles to the setting of type. Visual experiments with typographic elements. ","P":"<em>Prerequisite: C or better in both DES 202 and DES 210 and concurrent enrollment in either ART 202 or ART 255.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES330","T":"DES 330 Communication Design/Methodology","D":"Investigation of the design process and its methodology through different forms of visual communication. Development of students&apos; ability to present visually different ideas or information. ","P":"<em>Prerequisite: C or better in both DES 301 and DES 303 and admitted to BFA Design degree program.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES331","T":"DES 331 Advanced Typography","D":"Application of typography in different fields of visual communication and publication design. Exploration of the relationship between meaning, content, and typographic layout. ","P":"<em>Prerequisite: C or better in both DES 301 and DES 303 and admitted to BFA Design degree program.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES332","T":"DES 332 Image Design","D":"Production of graphic images in relation to written information and/or specific subjects, ideas or messages. ","P":"<em>Prerequisite: either ART 315 or ART 225 (or concurrent enrollment in ART 315 or ART 225) and C or better in both DES 330 and DES 331.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES340","T":"DES 340 Web Design for Design Majors","D":"Basic knowledge of web design using HTML, including information architecture and image optimization for the web. ","P":"<em>Prerequisite: DES 330.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES345","T":"DES 345 Basic New Media Design","D":"Course will focus on basic knowledge of new media design and production. The course covers interactive interface design. ","P":"<em>Prerequisite: DES 210 or ART 210.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES350","T":"DES 350 Illustration","D":"The study of various approaches and techniques of illustration for print and publication, including an introduction to digital illustration. ","P":"<em>Prerequisite: ART 315 (or concurrent enrollment in ART 315) and C or better in DES 250 and admitted to BFA Design degree program.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES430","T":"DES 430 Advanced Graphics","D":"The completion of advanced projects in graphic communication, including corporate and product identity, public service and editorial design. ","P":"<em>Prerequisite: ART 377; and either ART 225 or ART 315 (or concurrent enrollment in ART 225 or ART 315); and C or better in DES 332.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES440","T":"DES 440 Advanced Web Design for Design Majors","D":"Advanced skills in web design particularly focusing on interactive flash websites with multimedia content. ","P":"<em>Prerequisite: DES 340.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES452","T":"DES 452 Intermediate Illustration","D":"The study of illustration as a communicative tool. Students will be assigned problems using various media. ","P":"<em>Prerequisite: ART 377 and ART 225 (or concurrent enrollment in ART 225) and C or better in DES 350.</em>","L":"courses_ar","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES490","T":"DES 490 Professional Design Practicum","D":"A design workshop for the development and production of materials for portfolio. Preparation of a Final Project containing design work for a non-profit organization or a selected design issue, a written thesis related to it and public presentation of this project. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: C or better in either DES 430 or DES 452.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES497","T":"DES 497 Special Topics in Design","D":"The specific topics will change from term to term depending upon the interest of students and professors, e.g. Scientific Illustration, Comic Book Illustration, Art Direction, Book Arts, History of the Book, Letterpress Printing. May be repeated to a total of 9 hours. Variable content course. ","P":"<em>Prerequisite: Missouri State GPA of at least 2.50 and a GPA of 3.00 or higher in the major and admitted to Art or Design degree program and permission of the instructor.</em>","L":"courses_ar","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"DES499","T":"DES 499 Design Internship","D":"Student will complete actual job assignments for outside organizations under the supervision of a design faculty member. May be repeated to a total of 6 hours. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: Missouri State cumulative GPA of at least 2.50 and a GPA of 3.00 or higher in the major and admitted to Design degree program and permission of Design Program Coordinator.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MST388","T":"MST 388 The Museum: History and Perspectives","D":"This course offers a broad introduction to the museum as a cultural site and museum studies as a discipline with focus on theoretical issues. Identical with ART 388. Cannot receive credit for both MST 388 and ART 388. ","P":"<em>Prerequisite: ENG 110 and permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MST488","T":"MST 488 Basic Conservation of Art and Artifacts","D":"This course combines advanced art historical study and research of art and artifacts with a hands-on introduction to basic conservation techniques. Identical with ART 488. Cannot receive credit for both MST 488 and ART 488. May be taught concurrently with ART 688. Cannot receive credit for both MST 488 and ART 688. ","P":"<em>Prerequisite: ART 273.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MST495","T":"MST 495 Museum Studies Internship","D":"Students will complete various duties as assigned with one of a variety of museum studies-related organizations. These organizations may include, but are not limited to: museums, galleries, interpretive centers, archives, and visual resource-media collections. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MST501","T":"MST 501 Natural History Museum Techniques","D":"Techniques in the development of natural history museum displays including making models, design of displays, writing educational text, and other techniques. Course will be taught off-site at the Bull Shoals Field Station and Chase Studio. Identical with BIO 501. Cannot receive credit for both MST 501 and BIO 501. ","P":"","L":"courses_ar","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
