{"I":"ARB101","T":"ARB 101 Elementary Arabic I","D":"Develop proficiency in the four communication skills: listening, reading, speaking, and writing. These skills are essential for effective communication in the target language. Credit by examination is available. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ARB102","T":"ARB 102 Elementary Arabic II","D":"Develop additional proficiency in the four communication skills: listening, reading, speaking, and writing. These skills are essential for effective communication in the target language. Credit by examination is available. ","P":"<em>Prerequisite: C or better in ARB 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ARB201","T":"ARB 201 Intermediate Arabic I","D":"Systematic review, expansion, and synthesis of the four skill areas. This course will enhance communication skills by providing a thorough review of fundamentals of grammar through real-life language use, reading, and composition. Credit by examination is available. ","P":"<em>Prerequisite: C or better in ARB 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ARB202","T":"ARB 202 Intermediate Arabic II","D":"Continued development of the four skill areas through conversation, composition, and reading as a means to access culture. Credit by examination is available. ","P":"<em>Prerequisite: C or better in ARB 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ARB297","T":"ARB 297 Special Topics in Arabic","D":"Topics of selected interest in Arabic studies, including travel courses to Arabic-speaking countries. The specific subject matter and/or international component may vary according to resources and demand. Variable content course. May be repeated, as topics change, to a maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ARB305","T":"ARB 305 Advanced Arabic Proficiency Skills","D":"Readings and discussions in modern standard Arabic, continuing the method used in teaching ARB 201 and 202. Enhances communicative skills by providing intensive practice in reading, writing, listening, speaking and active control of grammar and vocabulary. ","P":"<em>Prerequisite: C or better in ARB 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI101","T":"CHI 101 Elementary Chinese I","D":"Essentials of grammar through aural-oral practice, dictation, reading and writing. Course conducted in Mandarin Chinese as far as practicable. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI102","T":"CHI 102 Elementary Chinese II","D":"Continuation of CHI 101. ","P":"<em>Prerequisite: C or better in CHI 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI201","T":"CHI 201 Intermediate Chinese I","D":"Continuation of CHI 102 with emphasis on reading, conversation, and an introduction to Chinese history and culture. ","P":"<em>Prerequisite: C or better in CHI 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI202","T":"CHI 202 Intermediate Chinese II","D":"Continuation of CHI 201 with emphasis on reading, conversation, history, and culture. ","P":"<em>Prerequisite: C or better in CHI 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI297","T":"CHI 297 Special Topics in Chinese","D":"Topics of selected interest in Chinese studies, including travel courses to Chinese-speaking countries. The specific subject matter and/or international component may change from semester to semester according to resources and demand. Variable content course. May be repeated, as topics change, to a maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"CHI311","T":"CHI 311 Chinese Reading and Conversation","D":"A course designed to develop and refine students&apos; conversational and reading skills through short speeches, group discussion, free conversation and reading. May be repeated, as content changes, to a maximum of 6 hours. Variable content course. ","P":"<em>Prerequisite: CHI 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI312","T":"CHI 312 Chinese Reading and Composition","D":"This course is designed to help students strengthen and expand their reading and writing skills in Chinese through the reading of authentic Chinese articles, grammar review, and writing practice. ","P":"<em>Prerequisite: CHI 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI410","T":"CHI 410 Translation","D":"Activities and exercises focused on oral and written translation for career fields. ","P":"<em>Prerequisite: CHI 312.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI415","T":"CHI 415 Business and Professional Chinese","D":"Introduction to Chinese language and culture as used in business and selected professions. Variable content course. May be repeated once with different content. ","P":"<em>Prerequisite: CHI 312 or above.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"CHI498","T":"CHI 498 Seminar Course in Chinese","D":"Supervised independent study in Chinese language, literature, and culture. May be repeated for a maximum of 6 hours. ","P":"<em>Prerequisite: C or better in CHI 202 or permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"FRN101","T":"FRN 101 Elementary French I","D":"Essentials of French language emphasizing the development of speaking, listening, reading, and writing within a culturally relevant context. Credit by Examination is available. ","P":"","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN102","T":"FRN 102 Elementary French II","D":"Continuation of FRN 101. Credit by Examination is available. ","P":"<em>Prerequisite: C or better in FRN 101.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN201","T":"FRN 201 Intermediate French I","D":"Francophone culture through discussion of readings, films and music. Credit by Examination is available. ","P":"<em>Prerequisite: C or better in FRN 102.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN202","T":"FRN 202 Intermediate French II","D":"A focus on literacy through compositions and readings in francophone culture. ","P":"<em>Prerequisite: C or better in FRN 201.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN297","T":"FRN 297 Special Topics in French","D":"Topics of selected interest in French studies, including travel-courses to French-speaking countries. The specific subject matter and/or inter-national component may change from semester to semester according to resources and demand. Variable content course. May be repeated, as topics change, to a maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"FRN300","T":"FRN 300 Service Learning in French","D":"This service learning component for the existing French curriculum incorporates community service with classroom instruction to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service providing instruction or other community service in the Springfield-area schools and other community groups. May be repeated. ","P":"<em>Prerequisite: 30 hours and concurrent registration in a French course at the 202 level or above.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"FRN302","T":"FRN 302 Topics in French Culture","D":"Topics may cover history or culture of France. Variable content course. May be repeated, as topics change, to a maximum of 3 hours. ","P":"<em>Prerequisite: FRN 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"FRN311","T":"FRN 311 French Conversation","D":"Oral practice in short speeches, group discussion and free conversation. May be repeated, as content changes, to a maximum of 6 hours. Variable content course. ","P":"<em>Prerequisite: FRN 201.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN312","T":"FRN 312 French Grammar and Composition","D":"Review of French grammar with writing practice. ","P":"<em>Prerequisite: FRN 202.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN324","T":"FRN 324 Topics in Francophone Linguistics","D":"This course develops students&apos; understanding of issues in Francophone linguistics by exploring such topics as phonetics and phonology, morphology and syntax, semantics, history of the language, and regional and social language variation. The emphasis will most often be on the area of phonetics and phonology. May be repeated once with different content. Variable content course. ","P":"<em>Prerequisite: FRN 312.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN326","T":"FRN 326 Culture Populaire","D":"History and culture of France and francophone countries; includes geography, philosophy and arts. May be repeated, as content changes, to a maximum of 6 hours. Variable content course. ","P":"<em>Prerequisite: FRN 202.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN335","T":"FRN 335 L'Esprit francais","D":"Through the study of artistic works, including fine arts, cinema, and literature, students will become more familiar with the origins, lives and influences of the most prominent Francophone figures and symbolic icons. Students will learn how to read, analyze, interpret, and discuss a wide selection of works and concepts in French; and to synthesize the material into an accurate and coherent picture of French literary and cultural developments. Variable content course. Repeatable up to 6 hours. ","P":"<em>Prerequisite: FRN 312 or permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN381","T":"FRN 381 French Literature from the Middle Ages to the Enlightenment","D":"A survey of authors, movements, ideas, and styles, e.g., Villon, Montaigne, Rabelais, Pascal, Rousseau. ","P":"<em>Prerequisite: FRN 312.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN382","T":"FRN 382 French Literature of the 19th and 20th Centuries","D":"A survey of representative work, e.g., Hugo, Flaubert, Camus. ","P":"<em>Prerequisite: FRN 312.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN410","T":"FRN 410 Translation","D":"Activities and exercises on oral and written translation focusing on career fields. May be repeated as course content changes up to 6 hours. ","P":"<em>Prerequisite: FRN 312.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN412","T":"FRN 412 Le Cinema francophone","D":"A study of culture, language, and literature through francophone film. Repeatable up to 6 hours. Variable content course. ","P":"<em>Prerequisite: FRN 312 or permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN414","T":"FRN 414 Le Francais Vivant","D":"A course designed to increase French fluency and comprehension, emphasizing modern, useful French as it is spoken today by natives. Students will explore the French language in a broad range of real everyday situations. Topics include idiomatic expressions, slang, spoken contractions, French non-verbal communication, and the language of the Internet. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: FRN 202.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN415","T":"FRN 415 Vivre et Travailler en francais","D":"Social and business interactions in the francophone world. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: FRN 312 or permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN495","T":"FRN 495 Advanced Undergraduate Seminar in French","D":"Study of advanced topics relating to language and proficiency development or literary and cultural themes in French or Francophone cultures. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: FRN 312 and FRN 326 or permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN498","T":"FRN 498 Seminar Course in French","D":"Supervised independent study in literature, linguistics or other restricted topics. May be repeated for maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"FRN725","T":"FRN 725 Seminar in Francophone Literature and Culture","D":"This course will enhance students&apos; language proficiency and cultural competence through the interpretation and analysis of selected literary, philosophical, and cultural texts from the Francophone tradition. Variable content course. May be repeated once with changed content. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"FRN735","T":"FRN 735 Advanced French Proficiency","D":"After an assessment of global language proficiency, students receive personalized guidance and selected periodic assessments to help them to strengthen their interpretive, interpersonal, and presentational skills in the target language. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM101","T":"GRM 101 Elementary German I","D":"Develop proficiency in the four communication skills: listening, reading, speaking and writing. These skills are essential to effective communication in the target language. Credit by Examination is available. ","P":"","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM102","T":"GRM 102 Elementary German II","D":"Develop additional proficiency in the four communication skills: listening, reading, speaking, and writing. These skills are essential to effective communication in the target language. Credit by Examination is available. ","P":"<em>Prerequisite: C or better in GRM 101.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM201","T":"GRM 201 Intermediate German I","D":"Systematic review, expansion, and synthesis of the four skill areas. Communicative skills will be enhanced by providing a thorough review of fundamentals of grammar through real-life language use, reading, and composition. Credit by Examination is available. ","P":"<em>Prerequisite: C or better in GRM 102.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM202","T":"GRM 202 Intermediate German II","D":"Continuation of the development of the four skills through conversation, composition and readings as a means to access culture. ","P":"<em>Prerequisite: C or better in GRM 201.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM297","T":"GRM 297 Special Topics in German","D":"Topics of selected interest in German studies, including travel-courses to German-speaking countries. The specific subject matter and/or inter-national component may change from semester to semester according to resources and demand. May be repeated, as topics change, to a maximum of 6 credit hours. Variable content course. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRM300","T":"GRM 300 Service Learning in German","D":"This service component for the existing German curriculum incorporates community service with classroom instruction to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service providing instruction or other community service in the Springfield-area schools and other community groups. May be repeated. ","P":"<em>Prerequisite: 30 hours and concurrent registration in a German course at the 202 level or above.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRM301","T":"GRM 301 Intensive Grammar Review","D":"Intensive grammar review of selected topics. May be repeated with different topics to a maximum of 3 credit hours. Variable content course. ","P":"<em>Prerequisite: GRM 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRM302","T":"GRM 302 Topics in German(ic) Culture","D":"Selected topics in culture and travel. May be repeated with different topics to a maximum of 3 credit hours. Variable content course. ","P":"<em>Prerequisite: GRM 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRM303","T":"GRM 303 Language and Technology","D":"Issues concerning German and technology. May be repeated with different topics to a maximum of three credit hours. Variable content course. ","P":"<em>Prerequisite: GRM 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRM304","T":"GRM 304 Conversational Strategies","D":"This course will introduce students to strategies for conversing in the target language. Emphasis will be placed on building vocabulary, developing listening comprehension skills, learning how to construct discussions and to use appropriate expressions. ","P":"<em>Prerequisite: GRM 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRM311","T":"GRM 311 German Reading and Conversation","D":"A structured course designed to develop and refine students reading and conversational skills. May be repeated, as content changes, to a maximum of 6 hours. Variable content course. ","P":"<em>Prerequisite: GRM 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM312","T":"GRM 312 German Composition","D":"A writing intensive course designed to introduce students to a variety of text types. Emphasis is placed on recognizing the differences among the texts and student practice in preparing similar original texts. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: GRM 311.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM320","T":"GRM 320 German Cinema","D":"The survey of major films produced in Germany serves as a basis for the study of German culture, German language, and German literature. Course emphasizes the way that film content and theme development are useful in analyzing German language usage and culture in selected films. Subject will vary from semester to semester. Examples: History and Culture Through Film; From Novel to Film; East German Film; The Image of Women in Film. Repeatable up to 6 hours. Variable content course. ","P":"<em>Prerequisite: GRM 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM325","T":"GRM 325 Kulturkunde der deutschsprachigen Lander","D":"An introduction to major historical periods and cultural movements of the German-speaking countries. Study includes geography, history, philosophy and the arts. Variable content course. May be repeated up to 6 hours. ","P":"<em>Prerequisite: GRM 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM400","T":"GRM 400 Praktikum","D":"A focused course that students can combine with other German classes in order to pursue a special interest within the normal course content. May be repeated with a different content to a maximum of 3 credit hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRM410","T":"GRM 410 Translation","D":"Activities and exercises focused on oral and written translation on career fields. ","P":"<em>Prerequisite: GRM 312.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM415","T":"GRM 415 German for Professional and Business Use","D":"Focus on advanced speaking and reading proficiency for applied use in professional fields such as administration, international relations, global studies and business. ","P":"<em>Prerequisite: GRM 311 or above.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM455","T":"GRM 455 Masterpieces of 19th Century German Literature","D":"Selected works or authors from the 19th century. May be repeated once with a different topic. Variable content course. ","P":"<em>Prerequisite: GRM 311 or above.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM465","T":"GRM 465 Masterpieces of 20th Century German Literature","D":"Selected works or authors from the 20th century. May be repeated once with a different topic. Variable content course. ","P":"<em>Prerequisite: GRM 311 or above.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM475","T":"GRM 475 Topics in German(ic) Literature and Culture","D":"Selected topics in German(ic) literature and culture. May be repeated once with a different topic. Variable content course. May be taught concurrently with GRM 375. Students enrolled in GRM 475 will complete more advanced assignments. Cannot receive credit for both GRM 375 and GRM 475. ","P":"<em>Prerequisite: GRM 311 or above.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM485","T":"GRM 485 Thematic Approaches to German Literature","D":"A survey of German literature across multiple centuries from the perspective of a particular theme. May be repeated once as topics change. Variable content course. ","P":"<em>Prerequisite: GRM 311 or above.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM495","T":"GRM 495 Advanced Undergraduate Seminar in German","D":"Study of advanced topics relating to language and proficiency development or literary and cultural themes in German-language cultures. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: GRM 312 and GRM 325 or permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRM498","T":"GRM 498 Seminar Course in German","D":"Supervised independent study in literature, linguistics or other restricted topics. May be repeated for no more than 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRK101","T":"GRK 101 Elementary Ancient Greek I","D":"Essentials of grammar and vocabulary building through reading and writing. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRK102","T":"GRK 102 Elementary Ancient Greek II","D":"Continuation of GRK 101. ","P":"<em>Prerequisite: C or better in GRK 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRK201","T":"GRK 201 Intermediate Ancient Greek I","D":"Continuation of GRK 102 with increased emphasis on reading. ","P":"<em>Prerequisite: C or better in GRK 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRK202","T":"GRK 202 Intermediate Ancient Greek II","D":"Introduction to Greek literature; analysis of its subjects, forms, and ideals. ","P":"<em>Prerequisite: C or better in GRK 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRK297","T":"GRK 297 Special Topics in Greek","D":"Topics of selected interest in Greek studies, including travel courses to Greek-speaking countries. The specific subject matter and/or international component may change from semester to semester according to resources and demand. Variable content course. May be repeated, as topics change, to a maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRK301","T":"GRK 301 Studies in Greek Prose","D":"An introduction to ancient Greek prose: study of the New Testament and/or such writers as Xenophon, Herodotus, Plato, and Lysias. May be repeated once with changed content. Variable content course. ","P":"<em>Prerequisite: C or better in GRK 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRK302","T":"GRK 302 Studies in Greek Poetry","D":"An introduction to ancient Greek poetry: study of works by such writers as Homer, Sophocles, and Euripides. May be repeated once with changed content. Variable content course. ","P":"<em>Prerequisite: C or better in GRK 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRK498","T":"GRK 498 Seminar Course in Ancient Greek","D":"Supervised independent study in Greek literature and translation. May be repeated for a maximum of 6 hours. ","P":"<em>Prerequisite: C or better in GRK 202 and permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"GRK503","T":"GRK 503 Advanced Greek Translation","D":"Advanced training in the skills of translating and explicating texts in classical and koine Greek. May be repeated to 9 hours if topic varies. Variable content course. May be taught concurrently with GRK 603. Cannot receive credit for both GRK 603 and GRK 503. ","P":"<em>Prerequisite: GRK 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"GRK603","T":"GRK 603 Advanced Greek Translation","D":"Advanced training in the skills of translating and explicating texts in classical and koine Greek. May be repeated to 9 hours if topic varies. Variable content course. May be taught concurrently with GRK 503. Cannot receive credit for both GRK 503 and GRK 603. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"HBW101","T":"HBW 101 Elementary Biblical Hebrew I","D":"The essentials of grammar and vocabulary building of Ancient Hebrew through reading and writing. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"HBW102","T":"HBW 102 Elementary Biblical Hebrew II","D":"Continuation of HBW 101. ","P":"<em>Prerequisite: C or better in HBW 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"HBW201","T":"HBW 201 Intermediate Biblical Hebrew I","D":"Continuation of HBW 102, with increased emphasis on reading. ","P":"<em>Prerequisite: C or better in HBW 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"HBW202","T":"HBW 202 Intermediate Biblical Hebrew II","D":"Introduction to Ancient Hebrew Literature; analysis of its subject, forms and ideals. ","P":"<em>Prerequisite: C or better in HBW 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"HBW297","T":"HBW 297 Special Topics in Hebrew","D":"Topics of selected interest in Hebrew studies, including travel courses to Hebrew-speaking countries. The specific subject matter and/or international component may change from semester to semester according to resources and demand. May be repeated, as topics change, to a maximum of 6 credit hours. Variable content course. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"ITL101","T":"ITL 101 Elementary Italian I","D":"Essentials of Italian Language emphasizing the development of speaking, listening, reading, and writing within a culturally relevant context. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ITL102","T":"ITL 102 Elementary Italian II","D":"Continuation of ITL 101. ","P":"<em>Prerequisite: C or better in ITL 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ITL201","T":"ITL 201 Intermediate Italian I","D":"Systematic review, expansion, and synthesis of the four skill areas. This course will enhance communication skills by providing a thorough review of fundamentals of grammar through real-life language use, reading, and composition. Credit by examination is available. ","P":"<em>Prerequisite: C or better in ITL 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ITL202","T":"ITL 202 Intermediate Italian II","D":"Develop additional proficiency in the four communication skills: listening, reading, speaking and writing. Credit by examination is available. ","P":"<em>Prerequisite: C or better in ITL 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"ITL297","T":"ITL 297 Special Topics in Italian","D":"Topics of selected interest in Italian studies, including travel courses to Italian-speaking countries. The specific subject matter and/or international component may change from semester to semester according to resources and demand. May be repeated, as topics change, to a maximum of 6 credit hours. Variable content course. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"JPN101","T":"JPN 101 Elementary Japanese I","D":"Essentials of grammar through aural-oral practice, dictation, reading and writing. Course conducted in Japanese as far as practicable. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"JPN102","T":"JPN 102 Elementary Japanese II","D":"Continuation of JPN 101. ","P":"<em>Prerequisite: C or better in JPN 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"JPN201","T":"JPN 201 Intermediate Japanese I","D":"Continuation of JPN 102 with increased emphasis on reading. ","P":"<em>Prerequisite: C or better in JPN 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"JPN202","T":"JPN 202 Intermediate Japanese II","D":"Introduction to Japanese literature; analysis of its subjects, forms and ideals. ","P":"<em>Prerequisite: C or better in JPN 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"JPN297","T":"JPN 297 Special Topics in Japanese","D":"Topics of selected interest in Japanese studies, including travel courses to Japanese-speaking countries. The specific subject matter and/or international component may change from semester to semester according to resources and demand. May be repeated, as topics change, to a maximum of 6 credit hours. Variable content course. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"JPN311","T":"JPN 311 Japanese Reading and Conversation","D":"This course is designed to further develop and refine students&apos; reading and speaking skills through readings of short texts, group discussions, and free conversation. ","P":"<em>Prerequisite: JPN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"JPN312","T":"JPN 312 Japanese Reading and Composition","D":"This course is designed to help students strengthen and expand their reading and writing skills in Japanese through the reading of authentic Japanese articles, grammar review, writing and Kanji practice. ","P":"<em>Prerequisite: JPN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"KOR101","T":"KOR 101 Elementary Korean I","D":"This course is the first part of the introductory sequence in Korean language and culture. Students acquire novice-level communicative proficiency in the interpersonal, interpretive and presentational modes as well as an understanding of perspectives, products, and practices of Korean culture. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"KOR102","T":"KOR 102 Elementary Korean II","D":"This course is the second part of the introductory sequence in Korean language and culture. Students reinforce novice-level communicative proficiency and begin to develop intermediate-level skills in the interpersonal, interpretive, and presentational modes while deepening their understanding of Korean culture. ","P":"<em>Prerequisite: C or better in KOR 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"KOR201","T":"KOR 201 Intermediate Korean I","D":"This course is the first part of the immediate sequence in Korean language and culture. Students continue to develop intermediate-level communicative proficiency in the interpersonal, interpretive and presentational modes and increase their understanding of peoples, products, and practices related to Korean culture. ","P":"<em>Prerequisite: C or better in KOR 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"KOR202","T":"KOR 202 Intermediate Korean II","D":"This course is the second part of the immediate sequence in Korean language and culture. Students reinforce intermediate-level communicative proficiency in the interpersonal, interpretive, and presentational modes while deepening their understanding of Korean culture. ","P":"<em>Prerequisite: C or better in KOR 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"KOR297","T":"KOR 297 Special Topics in Korean","D":"Focus on particular aspects of Korean language and/or culture. May also be used to recognize intermediate-level proficiency or as a transfer equivalent for coursework completed at accredited domestic or international institutions. Variable content course. May be repeated, as topics change, to a maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"LLT100","T":"LLT 100 Elementary Survey of Grammar for Language Students","D":"An introduction to the basic terminology and concepts of traditional grammar, including analysis of parts of speech, phrases, clauses, and verb transformation. No foreign language is required. Graded Pass/Not Pass only. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"LLT102","T":"LLT 102 Scientific and Medical Terminology","D":"A study of technical terminology as derived from Greek and Latin elements. Does not fulfill any language requirement. ","P":"","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"LLT121","T":"LLT 121 Classical Mythology","D":"A study of Greek and Roman myths and legends as they appear in art, music and literature, especially epic and tragedy. ","P":"<em>General Education Course (Focus on Humanities).</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT180","T":"LLT 180 The Heroic Quest","D":"Human societies have long used the theme of the quest for self-knowledge as a vehicle to assess their own cultures and to explore ethical situations arising in civic life. This course examines texts from diverse cultural traditions in which protagonists confront their inherited identity of culture and language, providing a broader perspective on self-discovery in our own society. ","P":"<em>General Education Course (Focus on Cultural Competence).</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT197","T":"LLT 197 Topics in Language and Literature","D":"Topics of general interest in foreign languages and related areas. Variable content course taught in English which may be repeated as topics change. Refer to current schedule of classes for topic and registration information. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"LLT215","T":"LLT 215 Asian Cultural Studies","D":"A survey of Asian civilization, touching on history, literature, language, art, religion, philosophy, and culture. Course may focus on either China or Japan. May be repeated once with changed content. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT225","T":"LLT 225 German Cultural Studies","D":"This course presents major historical periods and cultural movements as background information necessary to the study of the literature and culture of the German speaking countries. Major movements of art, literature, music, history, and philosophy will be treated. In order to count for any German major or minor, course must be taken concurrently with a GRM course. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT240","T":"LLT 240 Epics From Classical Antiquity","D":"A comparative study of epic poems in the ancient Mediterranean area. Epics considered will be used to present differing cultural views and how these views have affected and formed the western heroic tradition. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT271","T":"LLT 271 Special Topics in German(ic) Literature in English Translation","D":"This is a variable content course. May be repeated once for credit. In order to count for any German major or minor, course must be taken concurrently with a GRM course. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT296","T":"LLT 296 Major Authors in Translation","D":"A course in comparative literature offered in English translation covering one of the following areas: (a) Asian, (b) Germanic, (c) Latin America, (d) Latin and Greek, (e) Romance, and (f) Slavic. May be taken once under each of the six titles. Variable content course. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT321","T":"LLT 321 Comparative Mythology","D":"Comparison of the ancient myths of Greece, Rome, Northern Europe, Mesopotamia, Egypt, the Far East, and the Americas. Readings are taken from ancient sources and modern interpretation. Lectures, discussion and writing assignments will deal with major deities and heroes, the ancient mystery religions and creation epics, with emphasis on cultural background borrowings, common structures of myth, and methods of interpretation. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT325","T":"LLT 325 Greek Civilization","D":"A survey of Greek civilization. Lectures will be based on art, archaeology, literature, and history of classical Greece and will include private life, personal religion, the professions, and literature&apos;s reflection of culture. Slide lectures. ","P":"","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT326","T":"LLT 326 Roman Civilization","D":"A survey of Roman civilization. Lectures will be based on the art, archaeology, literature, and history of ancient Rome and will include private life, personal religion, the professions, and literature&apos;s reflection of culture. Slide lectures. ","P":"","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT545","T":"LLT 545 Seminar in Roman Culture","D":"Selected topics in Roman culture or daily life such as Roman law, rhetoric, religion, historiography, family life, politics, etc. May be repeated once with changed content. Variable content course. May be taught concurrently with LLT 645. Cannot receive credit for both LLT 645 and LLT 545. ","P":"<em>Prerequisite: 60 hours and permission of instructor or department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT595","T":"LLT 595 Special Topics in Classics","D":"Selected topics in Classical Studies such as topography of Rome and Athens, Advanced Mythology, genre studies. May be repeated up to 6 hours with changed content. Variable content course. May be taught concurrently with LLT 695. Cannot receive credit for both LLT 695 and LLT 595. ","P":"<em>Prerequisite: 50 hours and permission of instructor or department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"LLT596","T":"LLT 596 Seminar in Hispanic Literature in Translation","D":"Designed to acquaint the student with major authors and works in Hispanic literature offered in English translation. Topics may include special themes, historical and political developments, and cultural aspects of the works. Variable content course. May be repeated once with changed content. May be taught concurrently with LLT 696. Cannot receive credit for both LLT 696 and LLT 596. ","P":"<em>Prerequisite: 60 hours and permission of instructor or department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT645","T":"LLT 645 Seminar in Roman Culture","D":"Selected topics in Roman culture or daily life such as Roman law, rhetoric, religion, historiography, family life, politics, etc. May be repeated once with changed content. Variable content course. May be taught concurrently with LLT 545. Cannot receive credit for both LLT 545 and LLT 645. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LLT695","T":"LLT 695 Special Topics in Classics","D":"Selected topics in Classical Studies such as topography of Rome and Athens, Advanced Mythology, genre studies. May be repeated up to 6 hours with changed content. Variable content course. May be taught concurrently with LLT 595. Cannot receive credit for both LLT 595 and LLT 695. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"LLT696","T":"LLT 696 Seminar in Hispanic Literature in Translation","D":"Designed to acquaint the student with major authors and works in Hispanic literature offered in English translation. Topics may include special themes, historical and political developments, and cultural aspects of the works. Variable content course. May be repeated once with changed content. May be taught concurrently with LLT 596. Cannot receive credit for both LLT 596 and LLT 696. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN101","T":"LTN 101 Elementary Latin I","D":"Grammar and pronunciation; vocabulary study through reading and derivative study. ","P":"","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN102","T":"LTN 102 Elementary Latin II","D":"Continuation of LTN 101. ","P":"<em>Prerequisite: C or better in LTN 101.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN201","T":"LTN 201 Intermediate Latin I","D":"Continuation of LTN 102, with increased emphasis on reading. ","P":"<em>Prerequisite: C or better in LTN 102.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN202","T":"LTN 202 Intermediate Latin II","D":"Introduction to Latin literature, analysis of its subjects, forms and ideals. ","P":"<em>Prerequisite: C or better in LTN 201.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN312","T":"LTN 312 Latin Composition","D":"Review of grammar with practice in writing, giving emphasis to style. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN450","T":"LTN 450 Readings in Roman Public Affairs","D":"Readings in authors (Cicero, Seneca, Cato, inter alios) and genres (oratory, philosophy, letters) treating Roman civic life. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN451","T":"LTN 451 Roman Elegy and Lyric","D":"Designed to introduce students of classics to prominent Latin lyric poets (Catullus and Horace), and to the major works of the elegiac writers (Ovid, Propertius and Tibullus, inter alios). Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN460","T":"LTN 460 Roman History","D":"Intensive reading in one or more major historical writers from the time of Caesar to the reign of Trajan: Livy, Nepos, Sallust, Suetonius, or Tacitus. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN461","T":"LTN 461 Roman Epic","D":"Designed primarily to provide students of the Classics with a sense of appreciation for Rome&apos;s masterpiece, Vergil&apos;s Aeneid, as well as some of the writing of other epic authors, e.g. Lucan, Statius, Valerius Flaccus, et al. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN470","T":"LTN 470 Roman Letters and Personal Life","D":"A study of works reflecting the Roman way of life outside the political arena, including personal letters of Pliny, the Roman novel (Petronius and Apuleius), and the Philosopher&apos;s mediations on friendship, old age, and other aspects of the human condition (Cicero, Seneca). Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN471","T":"LTN 471 Roman Satire","D":"Works of Roman satire by such authors as Horace, Petronius, Persius, Martial, and Juvenal. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN480","T":"LTN 480 Research in Latin Literature","D":"A writing project designed to develop skills necessary for research in original texts of ancient authors. Must be taken in conjunction with LTN 450, 451, 460, 461, 470, 471 or 485. May be repeated once for a maximum of 2 hours. Does not count toward the 12-hour B.A. language requirement. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"LTN485","T":"LTN 485 Patristics and Late Latin Writers","D":"Introduction to post-Roman Latin used from Christian period through the Renaissance. Readings from sources such as St. Augustine, Jerome, Carmina Burana, Medieval fables, Erasmus, and Sir Thomas More. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: LTN 202.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN499","T":"LTN 499 Independent Studies in Latin","D":"Supervised independent study in literature, linguistics or other restricted topics. May be repeated for maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"LTN525","T":"LTN 525 Seminar in Latin Literature","D":"Selected topics in Latin literature such as genre studies, period studies, or concentration on one or more authors. May be repeated once with changed content. Variable content course. May be taught concurrently with LTN 625. Cannot receive credit for both LTN 625 and LTN 525. ","P":"<em>Prerequisite: 60 hours and permission of instructor or department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"LTN625","T":"LTN 625 Seminar in Latin Literature","D":"Selected topics in Latin literature such as genre studies, period studies, or concentration on one or more authors. May be repeated once with changed content. Variable content course. May be taught concurrently with LTN 525. Cannot receive credit for both LTN 525 and LTN 625. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL197","T":"MCL 197 Introduction to a Foreign Language","D":"Special elementary studies in a foreign language and culture. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL200","T":"MCL 200 Global Perspectives on Languages and Cultures in Society","D":"This course presents a survey of a variety of world languages and the cultures that share them. Class discussions and readings emphasize the connections between languages and geopolitical, historical, and cultural themes, which will also allow students an exploration of academic and professional career opportunities in fields that require language skills and cultural competency. ","P":"<em>General Education Course (Focus on Cultural Competence).</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL297","T":"MCL 297 Intermediate Studies in a Foreign Language","D":"Special intermediate studies in a foreign language and culture. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL303","T":"MCL 303 Coping with Culture","D":"This course is designed to introduce students to a discipline-specific (e.g., Hotel and Restaurant Management; Agribusiness; International Finance, Business and Banking; Languages for Vocalists, Scientists, et al.; Travel Industry; Medical Professions, etc.) understanding of cultural differences and to provide them with a limited vocabulary specific to their discipline. It gives students a rudimentary idea of how languages (e.g., French, German, Spanish) work, and helps them achieve a basic level of expression in these languages in situations relative to their profession. In this semester-long course, students rotate every five weeks from one language instructor to another. ","P":"","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL310","T":"MCL 310 Introduction to Translation and Interpreting","D":"This non-language-specific course introduces students to key concepts in translation and interpreting theory and practice, including terminology and concepts from linguistics applicable to translation, the role of translation and interpreting in local and global nonprofit and professional contexts, and information about training and certification programs. This course provides a conceptual foundation for other, language-specific courses. ","P":"<em>Prerequisite: CHI 202 or FRN 202 or GRM 202 or SPN 202 or permission of instructor.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL397","T":"MCL 397 Advanced Studies in a Foreign Language","D":"Special advanced studies in a foreign language and culture. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL400","T":"MCL 400 Foreign Language Practicum","D":"A focused and applied course that students can combine with other language classes in order to pursue a special interest. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL410","T":"MCL 410 Translation Capstone Project","D":"Students work closely with a partner or client from the community and a faculty mentor from their language area to complete a substantial, professional-grade translation project that integrates the theoretical concepts and practical skills obtained in previous translation-related coursework. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"MCL413","T":"MCL 413 Teaching of Foreign Languages","D":"Teaching of foreign languages in secondary schools; practical application of techniques and methods. The practical application includes a practicum with teaching and observation components. Credited only on BSEd (Secondary). A grade of C or better is required in this course in order to take MCL 493 or MCL 496. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: equivalent of 12 hours in foreign language, EDC 350, and admitted to Teacher Education Program.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":1}}
{"I":"MCL491","T":"MCL 491 Clinical Experiences in Teaching II","D":"This course is designed to meet HB 1711 for student&apos;s experience as a Teacher&apos;s Aide or Assistant Rule (Rule 5 CSR 80-805.040), to that of conventional student teachers within the same program. It is also designed to support completion of additional clinical requirements within that program including: seminars and workshops, required meetings, school related activities appropriate to the assignment, demonstrated mastery of the MoSPE standards and completion and overall assessment of a Professional Preparation Portfolio. This course is credited only on BSEd or appropriate masters-level certification programs. Can only receive credit for one of the following: AGE 499, AGT 499, ART 469, BSE 499, COM 493, ECE 499, ELE 499, ENG 434, FCS 498, HST 499, KIN 498, MCL 491, MID 499, MTH 496, MUS 499, SCI 499, SEC 499, SPE 499, THE 493. Supplemental course fee. ","P":"<em>Prerequisite: EDC 199; and admitted to Teacher Education Program; and grades of &quot;C&quot; or better in all professional education courses; and completion of portfolio checkpoints 1 and 2; and current pre-professional liability insurance; and program approval.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":0,"L":0}}
{"I":"MCL493","T":"MCL 493 Supervised Teaching Seminar","D":"Prerequisite; MCL 413; a grade of &quot;C&quot; or better in all professional education courses; current pre-professional liability insurance; approval for supervised teaching; all course work required for the major in Modern Languages-Teacher Education Option completed; minimum combined (Missouri State and transfer) GPA of 2.75; minimum GPA of 3.00 in Modern Language of Certification, with no grade lower than a &quot;C&quot;; minimum GPA of 3.00 in professional education; and concurrent enrollment in MCL 496. A seminar focused on the analysis of diverse aspects of teaching modern languages, to include second-language proficiency and literacy development, student learning and assessment, and field experiences during student teaching. Topics may include: Proficiency, Best Practices, The Job Search, Professional Development, Diversity, Assessment, and Classroom Management. Course will not count toward the major GPA. Supplemental course fee. ","P":"","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MCL495","T":"MCL 495 Languages and Society Capstone","D":"In this capstone course for modern languages majors, students work closely with a faculty mentor from their language area to complete a project or degree paper which relates their previous coursework and other language-intensive experiences (such as study away) to the University&apos;s public affairs mission. The course may also include other kinds of assessments designed to measure the degree to which students have mastered program-specific learning outcomes. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor or department head.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL496","T":"MCL 496 Supervised Teaching","D":"Student observes then teaches under the direction of the cooperating teacher and university supervisor. Student participates in school-related activities and attends both individual and group conferences. The course will include regular meetings with the University supervisor. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. The course will also include submission of the required state performance assessment from the supervised teaching. Course will not count toward the major GPA. Supplemental course fee. ","P":"<em>Prerequisite: concurrent enrollment in MCL 493.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":10,"E":0,"L":0}}
{"I":"MCL497","T":"MCL 497 Superior Studies in a Foreign Language","D":"Special superior studies in a foreign language and culture. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL499","T":"MCL 499 Program Assessment","D":"Learning outcomes assessment required of all students graduating with MCL majors, including teacher education candidates. In order to complete the course with a passing grade, students must submit official results for each of the assessments identified for their program(s). Assessments vary by program, are subject to change, and may require the payment of registration fees by the student. Students are encouraged to consult departmental faculty or the department&apos;s web site for current information regarding assessments and fees. Students should only register for this course and schedule the requisite assessments during the semester or term in which they intend to graduate or during their final semester of residency. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MCL500","T":"MCL 500 Advanced Research in the Discipline","D":"This course will focus on research sources and methods such as the use of bibliographical materials and literary investigation and interpretation in non-English languages. Emphasis will be on resources for teachers in developing individualized professional interests. May be taught concurrently with MCL 601. Cannot receive credit for both MCL 601 and MCL 500. ","P":"<em>Prerequisite: 60 hours and permission of instructor or department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL550","T":"MCL 550 Advanced Study Abroad","D":"Study in an area of the world where the target language is spoken. This may be taken through the Department&apos;s existing program or at any accredited institution. May be taught concurrently with MCL 650. Cannot receive credit for both MCL 650 and MCL 550. ","P":"<em>Prerequisite: FRN 311 or GRM 311 or SPN 205 and permission of instructor and language advisor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":0}}
{"I":"MCL597","T":"MCL 597 Topics for Teachers of Foreign Languages","D":"Topics of discipline-specific interest to foreign language teachers, e.g., specialized technological resources or contemporary cultural materials. Sections may be specific to a particular language or concern general pedagogical issues. May be repeated up to 6 hours. Variable content course. May be taught concurrently with MCL 697. Cannot receive credit for both MCL 697 and MCL 597. ","P":"<em>Prerequisite: 60 hours.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL650","T":"MCL 650 Advanced Study Abroad","D":"Study in an area of the world where the target language is spoken. This may be taken through the Department&apos;s existing program or at any accredited institution. May be taught concurrently with MCL 550. Cannot receive credit for both MCL 550 and MCL 650. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":0,"L":0}}
{"I":"MCL696","T":"MCL 696 Materials and Assessment in Foreign Language Teaching","D":"Practical and theoretical perspectives in specific areas in foreign language teaching and learning, including speaking, grammar, composition, and critical reading. Consideration of materials design and student assessment with an emphasis on literacy and proficiency development. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL697","T":"MCL 697 Topics for Teachers of Foreign Languages","D":"Topics of discipline-specific interest to foreign language teachers, e.g., specialized technological resources or contemporary cultural materials. Sections may be specific to a particular language or concern general pedagogical issues. May be repeated up to 6 hours. Variable Content Course. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL700","T":"MCL 700 Advanced Language Teaching Methods and Technology","D":"This course will acquaint language teachers with current second language research and teaching practice, with emphasis on the uses of technology. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL701","T":"MCL 701 Applied Foreign Language Practicum","D":"An independent studies option designed to allow students to work closely with a graduate faculty mentor to develop and implement a project that integrates principles and/or practices pertinent to second language acquisition or applied linguistics. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL710","T":"MCL 710 Advanced Research in the Discipline","D":"This course focuses on methods of conducting research in the area of second-language acquisition. Students will learn how to read, interpret, synthesize, and apply SLA research and how to design and conduct studies and disseminate results. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL724","T":"MCL 724 Seminar in Linguistics for Foreign Languages","D":"Focused exploration of topics in linguistics, phonetics and phonology, semantics, grammar and syntax, language history, language variation and change, and language acquisition as they pertain to French and/or Spanish. May be repeated, as content changes, to a maximum of 6 hours. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MCL798","T":"MCL 798 Degree Papers","D":"Independent research and writing toward completion of degree papers. Consultation with a designated MCL/ENG graduate faculty member and topic approval from the Program Coordinator or the Department Head are required. Not open to students writing theses to satisfy the master&apos;s research requirement. May not be repeated. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of Department Head or Program Coordinator.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MCL799","T":"MCL 799 Thesis","D":"In consultation with MCL and Education advisors, a student may elect to write a thesis on a topic within the discipline. May be repeated up to 6 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PTG101","T":"PTG 101 Elementary Portuguese I","D":"Develop proficiency in the four communication skills: listening, reading, speaking, and writing. These skills are essential to effective communication in the target language. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PTG102","T":"PTG 102 Elementary Portuguese II","D":"Develop additional proficiency in the four communication skills: listening, reading, speaking, and writing. These skills are essential to effective communication in the target language. ","P":"<em>Prerequisite: C or better in PTG 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PTG201","T":"PTG 201 Intermediate Portuguese I","D":"Systematic review, expansion, and synthesis of the four skill areas. This course will enhance communication skills by providing a thorough review of fundamentals of grammar through real-life language use, reading, and composition. Credit by examination is available. ","P":"<em>Prerequisite: C or better in PTG 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PTG202","T":"PTG 202 Intermediate Portuguese II","D":"Continued development of the four skills areas through conversation, composition, and reading as a means to access culture. Credit by examination is available. ","P":"<em>Prerequisite: C or better in PTG 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PTG297","T":"PTG 297 Special Topics in Portuguese","D":"Topics of selected interest in Portuguese studies, including travel courses to Portuguese-speaking countries. The specific subject matter and/or international component may change from semester to semester according to resources and demand. May be repeated, as topics change, to a maximum of 6 credit hours. Variable content course. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"RUS101","T":"RUS 101 Elementary Russian I","D":"Essentials of grammar through aural-oral practice, dictation, reading, and writing. Course conducted in Russian as far as practicable. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"RUS102","T":"RUS 102 Elementary Russian II","D":"Continuation of RUS 101. ","P":"<em>Prerequisite: C or better in RUS 101.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"RUS201","T":"RUS 201 Intermediate Russian I","D":"Continuation of RUS 102 with emphasis on reading, conversation, and an introduction to Russian History and culture. ","P":"<em>Prerequisite: C or better in RUS 102.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"RUS202","T":"RUS 202 Intermediate Russian II","D":"Continuation of RUS 201 with emphasis on reading, conversation, history, and culture. ","P":"<em>Prerequisite: C or better in RUS 201.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"RUS297","T":"RUS 297 Special Topics in Russian","D":"Topics of selected interest in Russian studies, including travel-courses to Russian speaking countries. The specific subject matter and/or international component may change from semester to semester according to resources and demand. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"RUS498","T":"RUS 498 Seminar Course in Russian","D":"Supervised independent study in literature, linguistics or other restricted topics. May be repeated for a maximum of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"SPN101","T":"SPN 101 Elementary Spanish I","D":"Develop proficiency in the four communication skills: listening, reading, speaking and writing. These skills are essential to effective communication in the target language. Credit by Examination is available. ","P":"","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN102","T":"SPN 102 Elementary Spanish II","D":"Develop additional proficiency in the four communication skills: listening, reading, speaking and writing. These skills are essential to effective communication in the target language. Credit by Examination is available. ","P":"<em>Prerequisite: C or better in SPN 101.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN201","T":"SPN 201 Intermediate Spanish I","D":"Systematic review, expansion, and synthesis of the four skill areas. Communicative skills will be enhanced by providing a thorough review of fundamentals of grammar through real-life language use, reading and composition. Credit by Examination is available. ","P":"<em>Prerequisite: C or better in SPN 102.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN202","T":"SPN 202 Intermediate Spanish II","D":"Continuation of the development of the four skills through conversation, composition and reading as a means to access culture. ","P":"<em>Prerequisite: C or better in SPN 201.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN205","T":"SPN 205 Spanish Proficiency Skills","D":"This course focuses on the development of formal and informal oral communication skills through oral practice in authentic contexts stressing extensive vocabulary development and cultural information relevant to the Spanish-speaking world. Native and heritage speakers (students who grew up in households where Spanish was frequently spoken) must enroll in the heritage language section of this course. For details, contact a Spanish section faculty member. ","P":"<em>Prerequisite: C or better in SPN 201.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN297","T":"SPN 297 Special Topics in Spanish","D":"Topics of selected interest in Spanish studies, including travel-courses to Spanish-speaking countries. The specific subject matter and/or international component may change from semester to semester according to resources and demand. May be repeated, as topics change, to a maximum of 6 credit hours. Variable content course. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"SPN300","T":"SPN 300 Service Learning in Spanish","D":"This service component for the existing Spanish curriculum incorporates community service with classroom instruction to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service providing instruction or other community service in the Springfield-area schools and other community groups. May be repeated. ","P":"<em>Prerequisite: 30 hours and concurrent registration in a Spanish course at the 202 level or above.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"SPN312","T":"SPN 312 Spanish Composition","D":"This course targets the development of composition skills, focusing on intensive grammar review, vocabulary building, and the discursive and stylistic elements of a variety of written genres. Several essays will be assigned to help students to develop into effective writers in Spanish. Native and heritage speakers (students who grew up in households where Spanish was frequently spoken) must enroll in the heritage language section of this course. For details, contact a Spanish section faculty member. ","P":"<em>Prerequisite: SPN 202 or SPN 205.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN314","T":"SPN 314 Advanced Spanish Proficiency Skills","D":"This course examines recent historical events and current popular trends and movements using multiple media sources (films, the Internet, magazines, songs, music, photographs and television) to better understand contemporary Hispanic/Spanish culture. The focus of the course is on the development of topics for conversational content, analysis, presentations and written essays in Spanish. ","P":"<em>Prerequisite: SPN 205 and SPN 312.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN320","T":"SPN 320 Hispanic Cinema","D":"A survey of major, twentieth-century films produced in Spanish throughout the Spanish-speaking world. Course features a study of directors and works, technique of cinematography, film content and theme development, and analysis of Spanish-language usage and culture in selected films. The relationship between film and Spanish literature and art is also studied. Selected films are also viewed and studied over the course of the semester. ","P":"<em>Prerequisite: SPN 312.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":1}}
{"I":"SPN324","T":"SPN 324 Topics in Spanish Linguistics","D":"Develops students&apos; understanding of issues in Spanish linguistics by exploring such topics as phonetics and phonology, morphology and syntax, semantics, history of the language, and regional and social language variation. May be repeated one with different content. Variable content Course. ","P":"<em>Prerequisite: SPN 312.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN325","T":"SPN 325 Civilization of Spain","D":"Origin and development of Iberian culture; includes geography, history, philosophy and arts. ","P":"<em>Prerequisite: SPN 312.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN326","T":"SPN 326 Civilization of Spanish America","D":"Origin and development of Spanish American culture; includes geography, history, philosophy, and the arts. ","P":"<em>Prerequisite: SPN 312.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN410","T":"SPN 410 Translation","D":"Activities and exercises in oral and written translation focusing on career fields. ","P":"<em>Prerequisite: SPN 312.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN415","T":"SPN 415 Business and Professional Spanish","D":"Specialized and intensive training in Spanish as used in business and selected professions. ","P":"<em>Prerequisite: SPN 312 or higher.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN450","T":"SPN 450 Modern Peninsular Literature","D":"Selected works or authors from Modern Peninsular literature. May be repeated once with a different topic. Variable content course. ","P":"<em>Prerequisite: SPN 312.</em>","L":"courses_fl","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN460","T":"SPN 460 Spanish American Literature","D":"Selected works or authors from Spanish American Literature. May be repeated once with a different topic. Variable content course. ","P":"<em>Prerequisite: SPN 312.</em>","L":"courses_fl","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN480","T":"SPN 480 Directed Readings","D":"May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of instructor and department head.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"SPN495","T":"SPN 495 Advanced Undergraduate Seminar in Spanish","D":"Study of advanced topics relating to language and proficiency development or literary and cultural themes in Spanish or Hispanic cultures. Variable content course. May be repeated, as content changes, to a maximum of 6 hours. ","P":"<em>Prerequisite: SPN 325 or SPN 326; and SPN 450 or SPN 460; or permission of instructor.</em>","L":"courses_fl","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN510","T":"SPN 510 Advanced Translation","D":"Builds on the translation and interpreting skills acquired in SPN 410. Students will be exposed to a variety of translation theories and methods and will increase their overall language proficiency as they gain further practical translation experience in a number of genres. May be taught concurrently with SPN 610. Cannot receive credit for both SPN 610 and SPN 510. ","P":"<em>Prerequisite: SPN 410.</em>","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN610","T":"SPN 610 Advanced Translation","D":"Builds on the translation and interpreting skills acquired in SPN 410. Students will be exposed to a variety of translation theories and methods and will increase their overall language proficiency as they gain further practical translation experience in a number of genres. May be taught concurrently with SPN 510. Cannot receive credit for both SPN 510 and SPN 610. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN725","T":"SPN 725 Seminar in Hispanic Literature and Culture","D":"This course will enhance students&apos; language proficiency and cultural competence through the interpretation and analysis of selected literary, philosophical, and cultural texts from the Hispanic tradition. Variable content course. May be repeated once with changed content. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SPN735","T":"SPN 735 Advanced Spanish Proficiency","D":"After an assessment of global language proficiency, students receive personalized guidance and selected periodic assessments to help them to strengthen their interpretive, interpersonal, and presentational skills in the target language. ","P":"","L":"courses_fl","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
