{"I":"SCI214","T":"SCI 214 Introduction to Science Teaching in the 21st Century","D":"The course is an introduction to science teaching and to the field of science. Topics in the course include the nature of science, scientific inquiry and research in the sciences. The students will explore how scientists conduct research and how teachers and students conduct research in classrooms. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: completion of eight hours of science courses.</em>","L":"courses_na","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"SCI314","T":"SCI 314 Techniques and Technology in Science Laboratory Teaching","D":"Instruction will focus on safe and effective uses of laboratory techniques and technology to teach science. The course will emphasize the potential of the science laboratory as a vehicle to promote student understanding of science and scientific inquiry. Pre-service teachers will have opportunities to familiarize themselves with laboratory equipment and techniques they will use to teach science in middle or high schools. Field trips to local schools will be required. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: SCI 214 and SEC 302; and one laboratory courses in each science discipline: BIO, CHM, PHY, GLG or GRY.</em>","L":"courses_na","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"SCI404","T":"SCI 404 Teaching of Middle School Natural Science","D":"Integration of current science learning theories and standards into practical classroom experiences for students of diverse backgrounds and abilities. Students will learn to design and teach science through various inquiry pedagogical approaches. A 15 hour practicum is required. Field trips are required. Portfolio checkpoint 2 is partially addressed through assignments in this course. Credited only on BSEd degree. A grade of &quot;C&quot; or better is required in this course in order to take MID 493 or MID 494. Cannot be taken Pass/Not Pass. ","P":"<em>Prerequisite: BIO 205 and CHM 116 and 117 and PHY 101 and GRY 240; EDC 350 or concurrent enrollment; and admission to Teacher Education Program; RDG 318 and MID 421 are recommended.</em>","L":"courses_na","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"SCI414","T":"SCI 414 Teaching of Secondary School Natural Science","D":"Integration of current science learning theories and standards into practical classroom experiences for students of diverse backgrounds and abilities. Students will learn to design and teach science through various inquiry pedagogical approaches. Students will learn to assess content knowledge achievement through formal and informal techniques. Practical classroom management will be emphasized. A 15 hour practicum is required. Field trips are required. Portfolio checkpoint 2 is partially addressed through assignments in this courses. Credited only on BSEd. A grade of &quot;C&quot; or better is required in this class in order to take SCI 493 and SCI 494. Cannot be taken Pass/Not Pass. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: admission to the Teacher Education Program; SCI 214 and SCI 314; completion of 20 hours in the primary science field; minimum of one required course in BIO, CHM, PHY, GLG or GRY; EDC 350 or concurrent enrollment; RDG 474 is recommended.</em>","L":"courses_na","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"SCI493","T":"SCI 493 Supervised Teaching (Secondary Science)","D":"Student observes, then teaches science under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: SCI 414; a grade of &quot;C: or better in all professional education courses; current pre-professional liability insurance; and approval for supervised teaching.</em>","L":"courses_na","O":{"F":true,"S":true,"M":false},"H":{"C":6,"E":0,"L":0}}
{"I":"SCI494","T":"SCI 494 Supervised Teaching (Secondary Science)","D":"Student observes, then teaches under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: concurrent enrollment in SCI 493.</em>","L":"courses_na","O":{"F":true,"S":true,"M":false},"H":{"C":6,"E":0,"L":0}}
{"I":"SCI499","T":"SCI 499 Clinical Experience in Teaching II","D":"This course is designed to meet HB 1711 for student&apos;s experience as a Teacher&apos;s Aide or Assistant Rule (Rule 5 CSR 80-805.040), to that of conventional student teachers within the same program. It is also designed to support completion of additional clinical requirements within that program including: seminars and workshops, required meetings, school related activities appropriate to the assignment, demonstrated mastery of the MoSPE standards and completion and overall assessment of a Professional Preparation Portfolio. This course is credited only on BSEd or appropriate masters-level certification programs. Can only receive credit for one of the following: AGE 499, AGT 499, ART 469, BSE 499, COM 493, ECE 499, ELE 499, ENG 434, FCS 498, HST 499, KIN 498, MCL 491, MID 499, MTH 496, MUS 499, SCI 499, SEC 499, SPE 499, THE 493. Supplemental course fee. ","P":"<em>Prerequisite: EDC 199; and admitted to Teacher Education Program; and grades of &quot;C&quot; or better in all professional education courses; and completion of portfolio checkpoints 1 and 2; and current pre-professional liability insurance; and program approval.</em>","L":"courses_na","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":0,"L":0}}
{"I":"SCI505","T":"SCI 505 Intellectual Foundations of Science and Technology","D":"An historical and philosophical examination of the origins and the development of science and technology. The differences between science and technology, their interrelationships in modern times, and the impact of each of these on society will be considered. May be taught concurrently with SCI 605. Cannot receive credit for both SCI 605 and SCI 505. ","P":"<em>Prerequisite: 70 hours including 8 hours of natural science.</em>","L":"courses_na","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SCI580","T":"SCI 580 Topics in Science Education","D":"A variable content course for offering selected topics of interest to science teachers in the elementary, middle, or secondary schools; or in college classrooms. May be repeated up to 6 hours when the topic varies. No more than 6 hours may be counted toward a degree. May be taught concurrently with SCI 685. Cannot receive credit for both SCI 685 and SCI 580. ","P":"<em>Prerequisite: 70 hours.</em>","L":"courses_na","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"SCI605","T":"SCI 605 Intellectual Foundations of Science and Technology","D":"An historical and philosophical examination of the origins and the development of science and technology. The differences between science and technology, their interrelationships in modern times, and the impact of each of these on society will be considered. May be taught concurrently with SCI 505. Cannot receive credit for both SCI 505 and SCI 605. ","P":"","L":"courses_na","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"SCI685","T":"SCI 685 Topics in Science Education","D":"A variable content course for offering selected topics of interest to science teachers in the elementary, middle, or secondary schools; or in college classrooms. May be repeated up to 6 hours when the topic varies. No more than 6 hours may be counted toward a degree. May be taught concurrently with SCI 580. Cannot receive credit for both SCI 685 and SCI 580. ","P":"","L":"courses_na","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"SCI780","T":"SCI 780 Advanced Topics in Science Education","D":"A variable content course for offering selected topics of interest to science teachers in the elementary, middle, or secondary schools; or in college classrooms. May be repeated up to 6 hours when the topic varies. Maximum of 6 hours may be counted toward degree. ","P":"<em>Prerequisite: 12 hours of graduate coursework.</em>","L":"courses_na","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
