{"I":"AST110","T":"AST 110 Astronomical Observations","D":"An introductory laboratory course stressing the techniques of astronomical observation and analysis of observed data. Students will have an opportunity to use telescopes and instruments at the Baker Observatory. ","P":"","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"AST111","T":"AST 111 Astronomical Frontiers","D":"A general interest course which will explore in detail, but nonmathematically, current subject areas of astronomy and astrophysics, such as quasars, black holes, and the origin of the universe, which attract the greatest attention in the media and among the general public. ","P":"","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"AST113","T":"AST 113 Modern Astronomy","D":"An introduction to our present knowledge of the nature of the universe, the galaxies, the stars, and the planets. A description of the natural laws and physical observations which are leading us to an understanding of our place in the cosmos. ","P":"<em>General Education Course (Focus on Physical Sciences).</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST114","T":"AST 114 Survey of Astronomy","D":"Historical and descriptive aspects of astronomy; topics of current interest related to space science. Cannot receive credit for both AST 114 and 115. ","P":"<em>General Education Course (Focus on Physical Sciences).</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":4,"L":0}}
{"I":"AST115","T":"AST 115 Basic Astronomy","D":"Historical and descriptive aspects of astronomy; topics of current interest related to space science. Laboratory consists of observations with telescopes and of experiments pertinent to the field. Cannot receive credit for both AST 114 and 115. Supplemental course fee. ","P":"<em>General Education Course (Focus on Physical Sciences).</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":3,"L":2}}
{"I":"AST311","T":"AST 311 Astronomical Techniques","D":"Intermediate level course; actual techniques of astronomical observation, methods of analysis of these observations, possible interpretations of acquired data. In laboratory, each student obtains observations for study in spectroscopy, photometry, photography, and CCD imaging. ","P":"<em>Prerequisite: MTH 135; and either AST 114 or AST 115.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"AST313","T":"AST 313 The New Solar Systems","D":"A modern inquiry of the planets, comets, asteroids, and other members of our solar system and the planets of other stellar systems, based on recent interplanetary explorations and Earth-based observations. Cannot receive credit for both AST 313 and AST 513. ","P":"<em>Prerequisite: AST 114 or AST 115; MTH 138 or above.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST315","T":"AST 315 The Lives and Deaths of Stars","D":"The structure of stars, processes at work in stellar atmospheres, the formation process, and the evolution of stars into white dwarfs, neutron stars, or black holes. Cannot receive credit for both AST 315 and AST 515. ","P":"<em>Prerequisite: AST 114 or 115; and MTH 138 or above.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST317","T":"AST 317 Our Universe, the Final Frontier","D":"Modern views on the structure of the Universe: its past, present, and future. Topics include the structure and content of our Galaxy and other galaxies, clusters of galaxies, the Big Bang theory (including Inflation), and the eventual fate of our Universe. Cannot receive credit for both AST 317 and AST 517. ","P":"<em>Prerequisite: AST 114 or AST 115; and MTH 138 or above.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST513","T":"AST 513 Solar and Extra-Solar Systems","D":"Formation of planetary systems, planetary dynamics, and comparative planetology. Project required. Cannot receive credit for both AST 313 and AST 513. May be taught concurrently with AST 613. Cannot receive credit for both AST 613 and AST 513. ","P":"<em>Prerequisite: AST 114 or 115; and MTH 303.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST515","T":"AST 515 Stellar Structure and Evolution","D":"Basic concepts of stellar structure, atmospheres, and evolution. Project required. Cannot receive credit for both AST 315 and AST 515. May be taught concurrently with AST 615. Cannot receive credit for both AST 615 and AST 515. ","P":"<em>Prerequisite: AST 114 or 115; and MTH 303.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST517","T":"AST 517 Galaxies and Cosmology","D":"Study of galaxies and the Universe. Topics include the structure and content of our Galaxy and other galaxies, clusters of galaxies, the Big Bang theory (including Inflation), and the eventual fate of our Universe. Project required. Cannot receive credit for both AST 317 and AST 517. May be taught concurrently with AST 617. Cannot receive credit for both AST 617 and AST 517. ","P":"<em>Prerequisite: AST 114 or 115; and MTH 303.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST613","T":"AST 613 Solar and Extra-Solar Systems","D":"Formation of planetary systems, planetary dynamics, and comparative planetology. Project required. Cannot receive credit for both AST 313 and AST 613. May be taught concurrently with AST 513. Cannot receive credit for both AST 513 and AST 613. ","P":"<em>Prerequisite: AST 114 or AST 115; and MTH 303.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST615","T":"AST 615 Stellar Structure and Evolution","D":"Basic concepts of stellar structure, atmospheres, and evolution. Project required. Cannot receive credit for both AST 315 and AST 615. May be taught concurrently with AST 515. Cannot receive credit for both AST 515 and AST 615. ","P":"<em>Prerequisite: AST 114 or AST 115; and MTH 303.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST617","T":"AST 617 Galaxies and Cosmology","D":"Study of galaxies and the Universe. Topics include the structure and content of our Galaxy and other galaxies, clusters of galaxies, the Big Bang theory (including Inflation), and the eventual fate of our Universe. Project required. Cannot receive credit for both AST 317 and AST 617. May be taught concurrently with AST 517. Cannot receive credit for both AST 517 and AST 617. ","P":"<em>Prerequisite: AST 114 or AST 115; and MTH 303.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"AST711","T":"AST 711 Astronomy for Teachers","D":"Theory and techniques of observational astronomy. ","P":"","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MAT509","T":"MAT 509 Special Topics in Materials Science","D":"Variable content, variable credit course. Topics to be chosen from current areas of interest in Materials Science. May be repeated to a total of 6 hours with a different topic. May be taught concurrently with MAT 609. Cannot receive credit for both MAT 609 and MAT 509. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MAT540","T":"MAT 540 Thermodynamics of Materials","D":"Review of classical thermodynamics, equilibrium in thermodynamic systems, the statistical interpretation of entropy, unary and multi-component systems, thermodynamics of phase diagrams and phase equilibrium. May be taught concurrently with MAT 640. Cannot receive credit for both MAT 540 and MAT 640. ","P":"<em>Prerequisite: PHY 343 or CHM 506.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT550","T":"MAT 550 Introduction to Materials Science","D":"Investigation of the relationships that exist between the structure, properties, processing and performance of materials. Different types of materials will be studied with a special emphasis on polymers and semiconductors. Structure-property correlations, including electronic, thermal, and mechanical properties, will be presented for these materials. May be taught concurrently with MAT 651. Cannot receive credit for both MAT 550 and MAT 651. ","P":"<em>Prerequisite: PHY 375 or CHM 507.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT580","T":"MAT 580 Structure of Solids","D":"Review of quantum mechanics, followed by an in-depth study of crystal structures, energy band structures in solids, lattice dynamics, and a survey of the physical properties of solids. May be taught concurrently with MAT 681. Cannot receive credit for both MAT 580 and MAT 681. ","P":"<em>Prerequisite: PHY 575 or CHM 507.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT609","T":"MAT 609 Special Topics in Materials Science","D":"Variable content course. Topics to be chosen from current areas of interest in Materials Science. May be repeated to a total of 6 hours with a different topic. May be taught concurrently with MAT 509. Cannot receive credit for both MAT 509 and MAT 609. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MAT640","T":"MAT 640 Thermodynamics of Materials","D":"Review of classical thermodynamics, equilibrium in thermodynamic systems, the statistical interpretation of entropy, unary and multi-component systems, thermodynamics of phase diagrams and phase equilibrium. May be taught concurrently with MAT 540. Cannot receive credit for both MAT 540 and MAT 640. ","P":"<em>Prerequisite: PHY 343 or CHM 506 or CHM 606.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT651","T":"MAT 651 Introduction to Materials Science","D":"Investigation of the relationships that exist between the structure, properties, processing and performance of materials. Different types of materials will be studied with a special emphasis on polymers and semiconductors. Structure-property correlations, including electronic, thermal, and mechanical properties, will be presented for these materials. May be taught concurrently with MAT 550. Cannot receive credit for both MAT 550 and MAT 651. ","P":"<em>Prerequisite: PHY 375 or CHM 507 or CHM 607.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT681","T":"MAT 681 Structure of Solids","D":"Review of quantum mechanics, followed by an in-depth study of crystal structures, energy band structures in solids, lattice dynamics, and a survey of the physical properties of solids. May be taught concurrently with MAT 580. Cannot receive credit for both MAT 580 and MAT 681. ","P":"<em>Prerequisite: PHY 375 or CHM 507 or CHM 607.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT720","T":"MAT 720 Advanced Quantum Mechanics","D":"Advanced topics in quantum mechanics including variational methods, approximation techniques, time-independent and time-dependent perturbation theory, second quantization, and the interactions of light with matter. ","P":"","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT750","T":"MAT 750 Experimental Design","D":"Laboratory techniques necessary for the development of instrumentation. Topics will include elementary computer interfacing, prototype design, mechanical and electronic construction, and reliability testing. The student will develop, design and build a test instrument and study each of the above topics during this process. ","P":"","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MAT758","T":"MAT 758 Optoelectronic Materials","D":"Course includes the study of advanced electronic properties of materials, lattice dynamics, and a survey of the optical-electronic interactions in materials. ","P":"","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT760","T":"MAT 760 Experiments in Physical Characterization","D":"Laboratory techniques in electronic, optical, and thermal characterization of materials. Students will become familiar with equipment and procedures used in research and commercial laboratories. ","P":"<em>Prerequisite: MAT 651.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MAT770","T":"MAT 770 Vapor Synthesis of Materials","D":"Experimental techniques in the vapor deposition of thin film materials used in the electronics industry. Some modification of the resulting films including chemical doping and ion implantation will also be studied. Experimental methods including computer control and analysis will be studied. ","P":"","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MAT780","T":"MAT 780 Polymer Preparation and Characterization","D":"Preparation of polymers, including the techniques of condensation polymerization, free radical polymerization, and if time permits, plasma polymerization. Characterization experiments will be viscosity measurements, differential scanning calorimetry, and thermal gravimetric analysis. Film preparation including spin coating, aspiration, and doctor blade systems will also be investigated. ","P":"","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MAT790","T":"MAT 790 Statistical Applications in Materials Science","D":"Selective topics in materials science important to the design, testing, fabrication, and manufacture of materials whose underlying theme is mathematical modeling based in statistical methods. The topics include mass transport in solids, atomic diffusion on surfaces, adsorption and desorption on surfaces, epitaxial growth, degradation of materials, queuing theory, and operations research. ","P":"","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MAT796","T":"MAT 796 Science Internship","D":"Completion of an internship project (480 hours) at a discipline-related business, nonprofit organization, or government agency, approved and supervised by both the departmental and internship advisors. Includes a formal report in the appropriate professional format, and an oral presentation at an approved venue. Graded Pass/Not Pass only. No more than 6 hours may count toward a masters degree. ","P":"","L":"courses_pa","O":{"F":true,"S":true,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"MAT798","T":"MAT 798 Seminar in Materials Science","D":"Selected topics in materials science of a theoretical, experimental, or applied nature with an emphasis on recent developments and their impact. May be repeated for a maximum of 4 hours. ","P":"<em>Prerequisite: candidate for the MS degree in Materials Science.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MAT799","T":"MAT 799 Research in Materials Science","D":"Supervised research in areas of materials science. May be repeated, but no more than 12 hours may be counted toward the MS degree. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY100","T":"PHY 100 Survey of Physics with Laboratory","D":"Description of nature as seen by physicists; effects this description and new scientific discoveries will have on society. Laboratories consist of discussions of current relations between science and society, demonstration of precise experimental apparatus, some actual involvement with the experimental method. Supplemental course fee. ","P":"<em>General Education Course (Focus on Physical Sciences).</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":4,"E":3,"L":2}}
{"I":"PHY101","T":"PHY 101 Physics by Inquiry for Educators","D":"Laboratory experiences model inquiry teaching methods appropriate for use in early childhood, elementary and middle school science lessons. Science content includes mechanics, optics, heat, electricity and magnetism, properties of materials. Students will increase their understanding of the nature of science. Supplemental course fee. ","P":"<em>Prerequisite: open only to Early Childhood, Elementary, Middle School, and Special Education majors. General Education Course (Focus on Physical Sciences).</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":2,"L":4}}
{"I":"PHY123","T":"PHY 123 Introduction to Physics I","D":"An introduction to physical theories covering the content areas of mechanics, fluids, sound, and thermodynamics. A knowledge of the laws of Physics will help the student better understand the world and how these laws can be used to make informed decisions to improve society. A grade of &quot;C&quot; or better is required in this course to take PHY 124. Supplemental course fee. ","P":"<em>Prerequisite: MTH 287 or eligibility for enrollment in MTH 261. General Education Course (Focus on Physical Sciences).</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":3,"L":2}}
{"I":"PHY124","T":"PHY 124 Introduction to Physics II","D":"A continuation of PHY 123 in the content areas of electricity and magnetism, electronics, and optics. ","P":"<em>Prerequisite: &quot;C&quot; grade or better in PHY 123.</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":3,"L":2}}
{"I":"PHY131","T":"PHY 131 Mini Physics","D":"A course whose various sections treat physics or astronomy from a contemporary, historical and/or theoretical point of view. Students should check the current registration schedule to determine the topic associated with each section being offered. Course may be repeated, provided topic and title are different, to a total of 5 hours. Variable content course. ","P":"","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"PHY141","T":"PHY 141 Mini Physics Laboratory","D":"A laboratory course explaining the use of scientific equipment and experimental procedures. Students should check the current registration schedule to determine the topic and titles for any given semester. Since the content of this course varies from semester to semester, it may be repeated, provided the topic title is different, to a total of 5 hours. Variable content course. ","P":"","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"PHY152","T":"PHY 152 Introductory Circuits-Survey of Electronics","D":"Introduction and survey of Kirkoff&apos;s current and voltage laws, network analysis, and Thevenin&apos;s and Norton&apos;s theorems for complex impedances. Transfer functions, passive and active filters, and signal processing. Amplifiers, logic, number systems, and mixed-signal electronics. Laboratory experiences will feature oscilloscope measurements and analysis and introduction to circuit modeling software. ","P":"<em>Prerequisite: MTH 138 or MTH 181.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"PHY203","T":"PHY 203 Foundations of Physics I","D":"Students must be skilled in using the Microsoft Excel spreadsheet program (see the Department of Physics, Astronomy, and Materials Science for a list of required spreadsheet skills). First of two semesters in basic calculus physics. Lecture and laboratory topics covered include mechanics, waves, and thermodynamics. A grade of &quot;C&quot; or better is required in this course to take PHY 204. Supplemental course fee. ","P":"<em>Prerequisite: MTH 261 (completed); or MTH 261 (concurrent enrollment) and ACT mathematics score equal to more than 29. General Education Course (Focus on Physical Sciences).</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":3,"L":4}}
{"I":"PHY204","T":"PHY 204 Foundations of Physics II","D":"Students must be skilled in using the Microsoft Excel spreadsheet program (see the Department of Physics, Astronomy, and Materials Science for a list of required spreadsheet skills). Continuation of PHY 203 with lecture and laboratories covering electricity, magnetism, and optics. Supplemental course fee. ","P":"<em>Prerequisite: &quot;C&quot; grade or better in PHY 203; and; either MTH 280 or MTH 288 or concurrent enrollment in MTH 280.</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":3,"L":4}}
{"I":"PHY220","T":"PHY 220 Introduction to Structure and Logic of Digital Computers","D":"Introduction to the internal structures of digital computers; design of gates, flipflops, registers, and memories to perform operations on numerical and other data represented in binary form. Laboratory uses logical blocks for experiments with combinational and sequential networks and simple digital systems. Supplemental course fee. ","P":"<em>Prerequisite: eligibility for MTH 261.</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":2,"L":4}}
{"I":"PHY233","T":"PHY 233 Engineering Statics","D":"Application of mechanics to equilibrium problems; topics include principles of center of mass, resultant force, friction, moment of inertia, torque, etc. Course does not satisfy any requirement for a physics major or minor. ","P":"<em>Prerequisite: PHY 203.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY252","T":"PHY 252 Introduction to Circuit Analysis","D":"A study of Kirkoff&apos;s current and voltage laws, resistive circuits with DC sources, network analysis by node voltages and mesh currents, Thevenin&apos;s and Norton&apos;s theorems, and first order circuits. ","P":"<em>Prerequisite: MTH 280.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY291","T":"PHY 291 Introduction to Computational Physics","D":"Numerical and computer methods related to physics modeling and data analysis. Introduction of physics applications using symbolic, matrix, and spreadsheet software including programming. Programming applied directly to physical simulations. Recent advances in physics-related computing. ","P":"<em>Prerequisite: MTH 280.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY300","T":"PHY 300 Service Learning in Physics","D":"This service component for an existing course incorporates community service with classroom instruction in Physics to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","P":"<em>Prerequisite: 30 hours and concurrent registration in a Physics course designated as a service learning offering.</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY324","T":"PHY 324 Instrumental/Computer Interfacing","D":"An introduction to computer architecture, machine/assembly language programming, and peripheral interfacing. Topics include microprocessor operation, addressing modes, memory organization, microprocessor buses, reset and interrupts, parallel I/O, serial I/O, timers, and analog/digital conversions. ","P":"<em>Prerequisite: PHY 152; and CSC 125 or other language by permission.</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":2,"L":4}}
{"I":"PHY333","T":"PHY 333 Intermediate Mechanics","D":"Classical mechanics of particles. Topics include kinematics, dynamics, oscillations, central forces, conservation theorems, scattering, and an introduction to the Lagrangian and Hamiltonian formulations of mechanics. ","P":"<em>Prerequisite: PHY 203 and PHY 391 and MTH 303.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY343","T":"PHY 343 Thermal Physics","D":"The macroscopic laws of thermodynamics and the microscopic foundation for those laws. Topics include the microcanonical, canonical, and grand canonical ensembles; Maxwell-Boltzmann, Fermi-Dirac, and Bose-Einstein statistics; equation of state, thermodynamic potentials, Maxwell&apos;s relations, and phase transitions. ","P":"<em>Prerequisite: PHY 203; and MTH 302 or concurrent enrollment.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY351","T":"PHY 351 Circuit, Signals, and Controls","D":"Review of circuits. Transfer functions, passive and active filters, and signal processing. Amplifiers including classes, operational, differential and instrumentation, logic, number systems, and mixed-signal electronics. Digital and analog experimental sensing and control. Further use of circuit modeling software. ","P":"<em>Prerequisite: PHY 152.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"PHY353","T":"PHY 353 Electricity and Magnetism","D":"An introduction to the theory of electric and magnetic fields and their sources. Topics include electrostatic and magnetostatic fields in a vacuum, electric potential, magnetic vector potential, electromagnetic fields, and Maxwell&apos;s equations. ","P":"<em>Prerequisite: PHY 204 and PHY 391.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY373","T":"PHY 373 Radiation Physics","D":"Theory of and measurement techniques for electromagnetic and particulate radiation. ","P":"<em>Prerequisite: PHY 124 or PHY 204.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"PHY375","T":"PHY 375 Modern Physics","D":"An introduction to the major developments in physics during the twentieth century. Topics include the special theory of relativity, the experimental basis for quantum mechanics, wave-particle duality, introductory quantum mechanics of one-dimensional systems, nuclear physics, and elementary particle physics. ","P":"<em>Prerequisite: PHY 204; and MTH 302 or concurrent enrollment.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY385","T":"PHY 385 Experiments in Modern Physics","D":"A study of basic experimental techniques, data analysis, and analysis of experimental errors. Laboratory experiments chosen from physical phenomena discovered in the twentieth century and may include photoelectric effect, Hall effect, Frank-Hertz experiment, electron spin resonance, and others. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: PHY 375.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"PHY386","T":"PHY 386 Undergraduate Research I","D":"An introduction to research that requires the selection of a suitable research project, completing a written feasibility study for the proposed project, and making all necessary preparations for the actual pursuit of the project in PHY 486. Graded Pass/Not Pass only. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"PHY390","T":"PHY 390 Interdisciplinary Topics in Physics","D":"Topics of interdisciplinary nature; usually team-taught by members of the disciplines involved. Typical topics chosen from: space physics (e.g. lunar studies), chemical physics (e.g. spectroscopy), biophysics, geophysics, mathematical physics, etc. Since credit and topics vary, the course may be repeated to a total of 6 hours. Variable content course. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY391","T":"PHY 391 Mathematics for Science and Engineering I","D":"A study of mathematical techniques widely used in science and engineering. Topics covered include series solutions to differential equations, Fourier series and transforms, vector calculus, matrix algebra, complex functions, and partial differential equations. ","P":"<em>Prerequisite: MTH 302.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY392","T":"PHY 392 Mathematics for Science and Engineering II","D":"A continuation of PHY 391 with topics selected from complex integration, numerical solutions to differential equations, special functions, probability distribution functions, and group theory. ","P":"<em>Prerequisite: PHY 391.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY399","T":"PHY 399 Cooperative Education in Physics","D":"The opportunity to earn academic credit in a planned learning process that integrates academic training with a supervised work experience. This is a variable content course that may be repeated to a total of 6 hours. ","P":"<em>Prerequisite: acceptance into the Cooperative Education Program and permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY409","T":"PHY 409 Selected Topics in Physics","D":"Advanced topics in physics which may vary from year to year. Some typical topics: solid state, nuclear structure, plasmas, fluids, astrophysics, applied group theory. Inter-disciplinary topics such as atmospheric physics and spectroscopy might also be offered. Since credit and topics vary, the course may be repeated to a total of 6 hours. Variable content course. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY476","T":"PHY 476 Introduction to Nuclear and Particle Physics","D":"Studies subatomic structure, basic constituents and their mutual interactions. Topics include nuclei, radioactivity, interactions of radiation with matter, particle detection, accelerators, nuclear models and reactions, and classification and interactions of quarks and other elementary particles. ","P":"<em>Prerequisite: PHY 375 and PHY 391 and MTH 303.</em>","L":"courses_pa","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY486","T":"PHY 486 Undergraduate Research II","D":"A continuation of PHY 386 in which the feasibility study from PHY 386 and the research project outcome are to be combined in a written report following a format required for journal publication. An oral presentation of this work will be reviewed by the faculty. Graded Pass/Not Pass only. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: PHY 386.</em>","L":"courses_pa","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"PHY495","T":"PHY 495 Readings in Physics","D":"Independent reading; topics not offered in regular courses. Course may be repeated to a total of 4 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY499","T":"PHY 499 Honors Project in Physics","D":"Enrollment limited to students of distinguished capability and industry. Students must consult with the physics and astronomy staff concerning their proposed problem prior to enrollment for this course. This course may be repeated to a total of 5 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY501","T":"PHY 501 Physics and Astronomy By Inquiry","D":"This course is a continuation of PHY 101. Additional topics in mechanics, optics, heat, electricity and magnetism will be covered. The course will also include an introduction to Astronomy. Concepts will be explored using the inquiry approach. Will not count towards a major or minor in physics. May be taught concurrently with PHY 602. Cannot receive credit for both PHY 501 and PHY 602. ","P":"<em>Prerequisite: 70 hours including PHY 101.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"PHY509","T":"PHY 509 Special Topics in Physics and Astronomy","D":"Variable content, variable credit course. Topics to be chosen from current areas of interest. May be repeated to a total of 6 hours with different topic. May be taught concurrently with PHY 609. Cannot receive credit for both PHY 609 and PHY 509. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY575","T":"PHY 575 Quantum Mechanics","D":"A mathematical development of the principles of quantum mechanics and their application to selected systems. Topics include Schrodinger&apos;s equation, operators, Heisenberg uncertainty principle, angular momentum, and applications, including the hydrogen atom. May be taught concurrently with PHY 675. Cannot receive credit for both PHY 575 and PHY 675. ","P":"<em>Prerequisite: PHY 375 or CHM 507.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY602","T":"PHY 602 Physics and Astronomy By Inquiry","D":"This course is a continuation of PHY 101. Additional topics in mechanics, optics, heat, electricity and magnetism will be covered. The course will also include an introduction to Astronomy. Concepts will be explored using the inquiry approach. Will not count towards a major or minor in physics. May be taught concurrently with PHY 501. Cannot receive credit for both PHY 501 and PHY 602. ","P":"<em>Prerequisite: PHY 101.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"PHY609","T":"PHY 609 Special Topics in Physics and Astronomy","D":"Variable content, variable credit course. Topics to be chosen from current areas of interest. May be repeated to a total of 6 hours with different topic. May be taught concurrently with PHY 509. Cannot receive credit for both PHY 609 and PHY 509. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY675","T":"PHY 675 Quantum Mechanics","D":"A mathematical development of the principles of quantum mechanics and their application to selected systems. Topics include Schrodinger&apos;s equation, operators, Heisenberg uncertainty principle, angular momentum, and applications, including the hydrogen atom. May be taught concurrently with PHY 575. Cannot receive credit for both PHY 575 and PHY 675. ","P":"<em>Prerequisite: PHY 375 or CHM 607.</em>","L":"courses_pa","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"PHY701","T":"PHY 701 Workshop on Topical Issues in Science Education","D":"Workshop to upgrade understanding of selected topics in science, and improve elementary, middle school and/or secondary science teaching. Each workshop will include performance and analysis of appropriate investigations to enhance understanding of the selected topics. Number of class hours determined by semester hours of credit. Variable content course. May be repeated to a maximum of 6 hours provided the topics are different. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY785","T":"PHY 785 Physics Laboratory for Teachers","D":"Performance and analysis of secondary laboratory experiments in physics. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"PHY790","T":"PHY 790 Seminar in Physics","D":"Extensive paper on agreed topic in physics or astronomy to be read before staff seminars. May be repeated to a total of 4 hours. ","P":"<em>Prerequisite: permission.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"PHY796","T":"PHY 796 Science Internship","D":"Completion of an internship project (80 hours/credit hour) at a discipline-related business, nonprofit organization, or government agency, approved and supervised by both the departmental and internship advisors. Includes a formal report in the appropriate professional format, and an oral presentation at an approved venue. Graded Pass/Not Pass only. No more than 6 hours may count toward a masters degree. ","P":"","L":"courses_pa","O":{"F":true,"S":true,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"PHY799","T":"PHY 799 Research in Natural and Applied Sciences","D":"Supervised research in the natural and applied sciences. May be repeated, but no more than 12 hours may be counted toward the masters degree. Cannot be applied toward the MS degree in Materials Science. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_pa","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
