{"I":"MUS100","T":"MUS 100 Music Fundamentals","D":"Rudiments of music (scales, key signatures, rhythms, intervals, notation) with their application within the context of music. Credit by Examination is available. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS101","T":"MUS 101 Beginning Piano","D":"Group instruction for students who wish to explore music through the medium of piano. Classes are taught in an 18-unit Wurlitzer Electronic Piano Laboratory. Course content includes development of keyboard familiarity and technique, introduction to music reading, improvisation, repertory pieces, and rudiments of music theory. No previous piano is required. Does not apply toward a major or minor in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS103","T":"MUS 103 Theory and Musicianship I","D":"Review and drill of music fundamentals; notation, clefs, intervals, scales, rhythm and meter; music terms; written and oral construction of triads and seventh chords; analysis and writing of four-part harmony; non-harmonic tones, cadences, figured bass. Sight singing and dictation of melodies and rhythms; intervals and chord quality identification; error detection. Credit by Examination is available. ","P":"<em>Prerequisite: MUS 100 or permission of department.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MUS104","T":"MUS 104 Theory and Musicianship II","D":"Four-part harmony incorporated all diatonic chords in all inversions; secondary dominant and secondary leading tone chords. Sight singing and dictation of melodies and rhythms; intervals and chord quality identification; error detection; dictation of four-part harmony. Credit by Examination is available. ","P":"<em>Prerequisite: MUS 103.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MUS107","T":"MUS 107 Recital Attendance I","D":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non-departmental concerts must be pre-approved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MUS108","T":"MUS 108 Recital Attendance II","D":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non-departmental concerts must be pre-approved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MUS119","T":"MUS 119 Jazz Theory/Jazz Keyboard Skills","D":"The study of jazz theory and the practical application of functional jazz keyboard skills. ","P":"<em>Prerequisite: MUS 103.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS130","T":"MUS 130 Multicultural Musical Instrument Techniques","D":"Techniques of both the performance and pedagogy of traditional instruments from cultures other than those in the Western/European tradition. Variable content course. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS131","T":"MUS 131 String Techniques and Skills for the Music Educator","D":"Instruction in the basic skills of playing and teaching violin, viola, cello and bass in a class situation. Examination of performance problems, diagnostic techniques, teaching strategies, and other specialized topics related to string instruction will be studied, and materials used in public school teaching will be examined and performed. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS133","T":"MUS 133 Guitar for the Music Educator I","D":"Provides future music teachers with the working knowledge, experience and skills to use the guitar for accompanying music making as well as for teaching fretted instruments in school music classes and ensembles. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS135","T":"MUS 135 Voice Class I","D":"Fundamentals of voice production, breath management, resonance and diction. Voice diagnosis and application of vocal principles are given on an individual basis. Appropriate vocal exercises and song literature are employed for the development of a singing technique. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS136","T":"MUS 136 Voice Class II","D":"Application of vocal principles is given on individual basis with the introduction of interpretation, style, and Italian diction. ","P":"<em>Prerequisite: MUS 135.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS137","T":"MUS 137 Piano Class I","D":"Coordination exercises, major scales, harmonization with I, IV, V7 chords, transposition, reading, elementary repertoire. Credit by Examination is available. ","P":"<em>Prerequisite: MUS 100 or MUS 103.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS138","T":"MUS 138 Piano Class II","D":"Minor scales, harmonization of major and minor melodies, transposition, reading, repertoire. Credit by Examination is available. ","P":"<em>Prerequisite: MUS 137.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS139","T":"MUS 139 Instrument Maintenance","D":"Instrument repair, source of difficulty and solution of minor problems. Experience in replacing cork, springs, pads and adjustments of instruments. ","P":"<em>Prerequisite: MUS 133.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS141","T":"MUS 141 Single Reed Techniques and Skills for the Music Educator","D":"Introduction in the basic skills and playing and teaching clarinet and saxophone in a class situation. Examination of performance problems, diagnostic techniques, teaching strategies, and other specialized topics related to woodwind instruction will be studied, and materials used in public school teaching will be examined and performed. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS142","T":"MUS 142 Flute and Double Reed Techniques and Skills for the Music Educator","D":"Introduction in the basic skills of playing and teaching flute and double reeds in a class situation. Examination of performance problems, diagnostic techniques, teaching strategies, and other specialized topics related to woodwind instruction will be studied, and materials used in public school teaching will be examined and performed. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS144","T":"MUS 144 High Brass Techniques and Skills for the Music Educator","D":"Introduction in the basic skills of playing and teaching trumpet and horn in a class situation. Examination of performance problems, diagnostic techniques, teaching strategies, and other specialized topics related to brass instruction will be studied, and materials used in public school teaching will be examined and performed. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS145","T":"MUS 145 Low Brass Techniques and Skills for the Music Educator","D":"Introduction in the basic skills of playing and teaching trombone and euphonium or tuba in a class situation. Examination of performance problems, diagnostic techniques, teaching strategies, and other specialized topics related to brass instruction will be studied, and materials used in public school teaching will be examined and performed. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS146","T":"MUS 146 Percussion Techniques and Skills for the Music Educator I","D":"Introduction in the basic skills of playing and teaching percussion instruments in a class situation. Examination of performance problems, diagnostic techniques, teaching strategies, and other specialized topics related to percussion instruction will be studied, and materials used in public school teaching will be examined and performed. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS148","T":"MUS 148 Introduction to Music Teaching","D":"This course is an orientation to the music education profession and to the teacher education program. Students explore roles and responsibilities of music teachers, complete field observations (minimum of 10 hours), develop a preliminary portfolio, and complete projects designed to examine the skills involved in teaching music. The field observation component requires the student to carry educational liability insurance and register with the Missouri Family Care Safety Registry (FCSR). ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":1}}
{"I":"MUS149","T":"MUS 149 String (Instrument)","D":"Applied instruction available in violin, viola, violoncello, bass viola. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS151","T":"MUS 151 Piano","D":"Applied instruction in piano. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS152","T":"MUS 152 Organ","D":"Applied instruction in organ. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS153","T":"MUS 153 Voice","D":"Applied instruction in voice. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS155","T":"MUS 155 Woodwind (Instrument)","D":"Applied instruction available in flute, oboe, clarinet, bassoon, saxophone. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS156","T":"MUS 156 Brass (Instrument)","D":"Applied instruction available in horn, trumpet, trombone, baritone, and tuba. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS157","T":"MUS 157 Percussion","D":"Applied instruction in percussion instruments. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS158","T":"MUS 158 Guitar","D":"Applied instruction in classical guitar. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS159","T":"MUS 159 Harp","D":"Applied instruction in harp. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS160","T":"MUS 160 Carillon","D":"Applied instruction in carillon. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS161","T":"MUS 161 Men's Chorus","D":"A choral ensemble of men&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Men&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS162","T":"MUS 162 Choral Union","D":"Chorus Union, a mixed choir of students and community members, rehearses one evening per week and performs concerts throughout the year. Choral Union collaborates with other choral ensembles during the academic year and performs a variety of choral literature. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. Open to all students and community members by audition. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS163","T":"MUS 163 Women's Chorus","D":"A choral ensemble of women&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Women&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS168","T":"MUS 168 Chorale","D":"Chorale is a chorus of mixed men&apos;s and women&apos;s voices that studies and performs advanced choral repertoire both on and off campus. The Chorale will collaborate with other vocal and instrumental ensembles during the academic year. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS172","T":"MUS 172 Small Ensemble","D":"Ensembles may be arranged each semester in piano, voice, strings, wind instruments and percussion to meet needs of participating students and the department. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS173","T":"MUS 173 String Orchestra Workshop","D":"Study, performance of the literature and style of music for string ensembles of all sizes, a conducted group. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":1}}
{"I":"MUS174","T":"MUS 174 Jazz Ensemble","D":"Laboratory course in instrumentation, materials, arranging and organization of Jazz Ensemble. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS175","T":"MUS 175 Band","D":"Band performs as marching unit during football season and as indoor ensemble throughout the school year. Analytical study and stylistic performance of literature for conducted wind ensembles of all sizes. Band performs on campus, in area high schools and in the stadia of other colleges. Auditions for placement and additional group work required. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS176","T":"MUS 176 University Symphony","D":"The symphony performs music from the standard symphonic literature and cooperates with other ensembles to perform major choral and operatic works. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS177","T":"MUS 177 Marching Band","D":"Marching band performs as a unit during football season. Band performs on campus, in area high schools, and in the stadia of other colleges. Auditions for placement and additional group work required. Band grants available to qualified students. Fees and assessments apply to course. May be repeated for credit. Only 8 hours of large ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS178","T":"MUS 178 University/Community Band","D":"Traditional-style concert band which provides performance opportunities for musicians from the university and the community at large. At least one concert is presented each semester. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS192","T":"MUS 192 Accompanying","D":"Development of skills in accompanying for pianist. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS193","T":"MUS 193 Opera Workshop","D":"Preparation and production of opera as it pertains to singing actors and ensembles. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS200","T":"MUS 200 Principles and General Methods of Music Education","D":"This serves as the gateway course to the teacher music education program. An overview of school organization, management techniques, goals, objectives, assessment, technology, curriculum preparation, unit planning, and diversity as a knowledge base for K-12 music teachers is developed through student projects. Students participate in a 30-hour field experience in area schools. The portfolio checkpoint required for admission to teacher education will occur during this course. A grade of &quot;C&quot; or better in this course is required to be admitted to the teacher education program. The field observation component requires the student to carry educational liability insurance, a TB test, and registration with the Missouri Family Care Safety Registry (FCSR). ","P":"<em>Prerequisite: MUS 148.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":4}}
{"I":"MUS203","T":"MUS 203 Theory and Musicianship III","D":"Chromatic harmony including borrowed chords and augmented sixth chords; elementary and advanced modulation; smaller forms. Sight singing and dictation of melodies and rhythms; error detection; modulation to closely related keys; dictation and identification of chromatic harmony. ","P":"<em>Prerequisite: MUS 104.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MUS204","T":"MUS 204 Theory and Musicianship IV","D":"Advanced chromatic harmony; twentieth-century and contemporary techniques; larger forms. Sight singing and dictation of melodies and rhythms; error detection; harmonic dictation; diatonic modes and other non-tonal scales; improvisation. ","P":"<em>Prerequisite: MUS 203.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MUS207","T":"MUS 207 Recital Attendance III","D":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non-departmental concerts must be preapproved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MUS208","T":"MUS 208 Recital Attendance IV","D":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non-departmental concerts must be preapproved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MUS216","T":"MUS 216 Introduction to Audio Techniques","D":"The study and application of a wide variety of techniques used in the commercial music industry. Topic areas include sound and hearing, waveform theory, acoustics, microphones, multi-track recording, and basic usage of Musical Instrument Digital Interface (MIDI). Credit by Examination is available. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS219","T":"MUS 219 Jazz Improvisation I","D":"The study of beginning improvisation including chord/scale relationship, ii-V-I in all twelve major keys, blues, standards, and solo transcription. ","P":"<em>Prerequisite: MUS 104.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"MUS220","T":"MUS 220 Jazz Improvisation II","D":"The study of improvisation including chord/scale relationship, ii-V-I in all twelve minor keys, all forms of minor scales, modes, standards and solo transcription. ","P":"<em>Prerequisite: MUS 219.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"MUS235","T":"MUS 235 Voice Class III","D":"Application and vocal principles is given on an individual basis with repertoire and diction in Italian, German, and French. ","P":"<em>Prerequisite: MUS 136.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS236","T":"MUS 236 Voice Class IV","D":"Application of vocal principles is given on an individual basis with the repertoire including songs and arias from operas and oratorios in Italian, French, German, and English. ","P":"<em>Prerequisite: MUS 235.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS237","T":"MUS 237 Piano Class III","D":"Chord patterns for harmonization using secondary chords, broken chords, instrumental and vocal scores, ensemble playing, repertoire. Credit by Examination is available. ","P":"<em>Prerequisite: MUS 138.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS238","T":"MUS 238 Piano Class IV","D":"Modern harmonization, diminished and augmented chords, arpeggios, instrumental and vocal scores, ensemble-solo-duo playing. Credit by Examination is available. ","P":"<em>Prerequisite: MUS 237.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS239","T":"MUS 239 Introduction to World Music","D":"An exploration of what it means to be human through a comparison of various world musics and the associated recurring patterns of human behavior. Students will also develop a music vocabulary and listening skills through exposure to recordings, lectures and assignments about stylistic elements and analysis. ","P":"<em>General Education Course (Focus on the Arts).</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS241","T":"MUS 241 The Language of Music","D":"A study of the ways music creatively expresses self-understanding, cultural environment, and aesthetic values from ancient to modern times. ","P":"<em>Prerequisite: Open to all students except music majors. General Education Course (Focus on Humanities).</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS249","T":"MUS 249 String Instrument","D":"Applied instruction available in violin, viola, violoncello, bass viol. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS251","T":"MUS 251 Piano","D":"Applied instruction in piano. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS252","T":"MUS 252 Organ","D":"Applied instruction in organ. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS253","T":"MUS 253 Voice","D":"Applied instruction in voice. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS255","T":"MUS 255 Woodwind (Instrument)","D":"Applied instruction available in flute, oboe, clarinet, bassoon, saxophone. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS256","T":"MUS 256 Brass (Instrument)","D":"Applied instruction available in horn, trumpet, trombone, baritone, and tuba. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS257","T":"MUS 257 Percussion","D":"Applied instruction in percussion instruments. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS258","T":"MUS 258 Guitar","D":"Applied instruction in classical guitar. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS259","T":"MUS 259 Harp","D":"Applied instruction in harp. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS260","T":"MUS 260 Carillon","D":"Applied instruction in carillon. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS261","T":"MUS 261 Men's Chorus","D":"A choral ensemble of men&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Men&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS262","T":"MUS 262 Choral Union","D":"Chorus Union, a mixed choir of students and community members, rehearses one evening per week and performs concerts throughout the year. Choral Union collaborates with other choral ensembles during the academic year and performs a variety of choral literature. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. Open to all students and community members by audition. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS263","T":"MUS 263 Women's Chorus","D":"A choral ensemble of women&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Women&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS268","T":"MUS 268 Chorale","D":"Chorale is a chorus of mixed men&apos;s and women&apos;s voices that studies and performs advanced choral repertoire both on and off campus. The Chorale will collaborate with other vocal and instrumental ensembles during the academic year. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS272","T":"MUS 272 Small Ensemble","D":"Ensembles may be arranged each semester in piano, voice, strings, wind instruments and percussion to meet needs of participating students and the department. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS273","T":"MUS 273 String Orchestra Workshop","D":"Study, performance of the literature and style of music for string ensembles of all sizes, a conducted group. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":1}}
{"I":"MUS274","T":"MUS 274 Jazz Ensemble","D":"Laboratory course in instrumentation, materials, arranging and organization of Jazz Ensemble. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS275","T":"MUS 275 Band","D":"Band performs as marching unit during football season and as indoor ensemble throughout the school year. Analytical study and stylistic performance of literature for conducted wind ensembles of all sizes. Band performs on campus, in area high schools and in the stadia of other colleges. Auditions for placement and additional group work required. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":4}}
{"I":"MUS276","T":"MUS 276 University Symphony","D":"The symphony performs music from the standard symphonic literature and cooperates with other ensembles to perform major choral and operatic works. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS278","T":"MUS 278 University/Community Band","D":"Traditional-style concert band which provides performance opportunities for musicians from the university and the community at large. At least one concert is presented each semester. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS280","T":"MUS 280 Musical Theatre Workshop","D":"Performance laboratory for students majoring in Musical Theatre. Preparation and performance of musical numbers from the musical theatre repertoire. Emphasis will be placed on the synthesis of performance techniques related to various musical styles. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"MUS292","T":"MUS 292 Accompanying","D":"Development of skills in accompanying for pianist. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS293","T":"MUS 293 Opera Workshop","D":"Preparation and production of opera as it pertains to singing actors and ensembles. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS294","T":"MUS 294 Singing Diction I","D":"Proper pronunciation of English, Italian, and Latin; mastery of the International Phonetic Alphabet. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS295","T":"MUS 295 Singing Diction II","D":"Proper pronunciation of German and French; continued application of the International Phonetic Alphabet. ","P":"<em>Prerequisite: MUS 294.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS298","T":"MUS 298 Upper Division Applied Status","D":"Audition required by the end of the sophomore year of all music majors for placement into upper division Applied Music. Specific requirements may vary by Applied Division. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MUS301","T":"MUS 301 Service Learning in Music","D":"This service component for an existing course incorporates community service with classroom instruction in Music to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefit an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","P":"<em>Prerequisite: 30 hours, concurrent registration in a Music course designated as a service learning offering.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS307","T":"MUS 307 Recital Attendance V","D":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non-departmental concerts must be pre-approved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: piano proficiency.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MUS308","T":"MUS 308 Recital Attendance VI","D":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non departmental concerts must be pre approved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: piano proficiency.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MUS309","T":"MUS 309 Introduction to Music and Healing","D":"Introduction to the history and current practices in the field of therapeutic music, as an integrated service-learning (ISL) class. Students will learn to play the portable folk harp, and provide 15 hours of therapeutic music at the bedsides of patients in local hospitals or hospices. ","P":"<em>Prerequisite: ability to read music and permission of the instructor.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS313","T":"MUS 313 16th Century Counterpoint","D":"Analysis and writing in the style of the vocal music of the late Renaissance as embodied in the sacred vocal works of Palestrina. ","P":"<em>Prerequisite: MUS 203.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS314","T":"MUS 314 18th Century Counterpoint","D":"Analysis and writing in the style of the instrumental music of the late Baroque as embodied in the keyboard works of J.S. Bach. ","P":"<em>Prerequisite: MUS 203.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS315","T":"MUS 315 Form and Analysis","D":"The study of formal aspects of music, ranging from smaller structural units to complete movements. Analysis of forms and styles from selected historical periods. ","P":"<em>Prerequisite: MUS 204.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS316","T":"MUS 316 Advanced Audio Recording Techniques","D":"Digital, advanced audio recording technology for radio, television, and video post production. Emphasis will be placed on the recording, editing, and mixdown of production projects. Topic areas include microphone placement, multi-track recording, digital theory, synchronization concepts, and the art of mixdown. ","P":"<em>Prerequisite: MUS 216.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS319","T":"MUS 319 Jazz Improvisation III","D":"The study of advanced improvisation including chord/scale relationship, continued study of ii-V-I in all twelve major and minor keys, diminished, whole-tone, and altered dominant scales. Standards and solo transcriptions will be analyzed and performed. ","P":"<em>Prerequisite: MUS 220.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"MUS321","T":"MUS 321 Conducting","D":"Fundamentals of conducting, with emphasis upon basic baton techniques, transposition and score reading. ","P":"<em>Prerequisite: MUS 204.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS322","T":"MUS 322 Conducting-Choral","D":"Conducting techniques specifically related to choral music. ","P":"<em>Prerequisite: MUS 321.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS323","T":"MUS 323 Conducting-Instrumental","D":"Conducting techniques specifically related to instrumental music. ","P":"<em>Prerequisite: MUS 321.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS327","T":"MUS 327 Composition Class","D":"Requires composition of short musical pieces using a variety of styles, and the analysis of works by 20th century composers. ","P":"<em>Prerequisite: MUS 103.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS328","T":"MUS 328 Instrumentation","D":"Techniques, arranging, scoring and transcribing for large and small ensembles; with attention given to the practical application in a teaching situation. ","P":"<em>Prerequisite: MUS 203.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS337","T":"MUS 337 Piano Class V","D":"Study of functional piano skills for classroom and studio use. Class members participate in simulated rehearsal situations involving accompanying, transposition, harmonization, and score reading at the piano. Emphasis is also placed on development of sightreading skills. Credit by Examination is available. ","P":"<em>Prerequisite: MUS 238.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS338","T":"MUS 338 Piano Class VI","D":"Study of advanced functional skills for classroom and studio use. Class members participate in simulated rehearsal situations involving accompanying, transposition, harmonization, and score reading at the piano. Emphasis is also placed on development of sightreading skills. Credit by Examination is available. ","P":"<em>Prerequisite: MUS 337.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS340","T":"MUS 340 Adaptive Music for Special Learners","D":"Introduction to the teaching of music students with disabilities in a school setting. The course will provide an overview of characteristics and identification criteria for both individuals with disabilities and also the gifted. Legislation and process pertaining to special education will be addressed along with a focus on teaching individuals with diversity in the elementary, middle, and secondary educational setting. ","P":"<em>Prerequisite: music major and admitted to teacher education program.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS343","T":"MUS 343 Musical Theatre History I","D":"Development of musical theatre in England, continental Europe and America from The Beggar&apos;s Opera, 1728 to Show Boat, 1927. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS344","T":"MUS 344 Musical Theatre History II","D":"Development of musical theatre mainly in America from Show Boat, 1927 to present. Public Affairs Capstone Experience course. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS345","T":"MUS 345 Music in Western Culture and Society I","D":"The historical unfolding of western art music and the ways in which culture and society have played a central role in that development. Music from the Middle Ages to the Baroque will be studied from the perspective of the way in which it has been influenced and in turn influenced religion, politics, economics, and other social issues. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS346","T":"MUS 346 Music in Western Culture and Society II","D":"The historical unfolding of western art music and the ways in which culture and society have played a central role in that development. Music from the Classical era to the Twentieth century will be studied from the perspective of the way in which it has been influenced and in turn influenced religion, politics, economics, and other social issues. Public Affairs Capstone Experience course. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS347","T":"MUS 347 History of Jazz in American Culture","D":"The development of jazz music in America. The historical unfolding of jazz art music and developmental advances from early 20th century to the present. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS349","T":"MUS 349 String (Instrument)","D":"Applied instruction available in violin, viola, violoncello, bass viol. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS351","T":"MUS 351 Piano","D":"Applied instruction in piano. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS352","T":"MUS 352 Organ","D":"Applied instruction in organ. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS353","T":"MUS 353 Voice","D":"Applied instruction in voice. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS355","T":"MUS 355 Woodwind (Instrument)","D":"Applied instruction available in flute, oboe, clarinet, bassoon, saxophone. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS356","T":"MUS 356 Brass (Instrument)","D":"Applied instruction available in French horn, trumpet, trombone, baritone, tuba. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS357","T":"MUS 357 Percussion","D":"Applied instruction in percussion instruments. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS358","T":"MUS 358 Guitar","D":"Applied instruction in classical guitar. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS359","T":"MUS 359 Harp","D":"Applied instruction in harp. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS360","T":"MUS 360 Carillon","D":"Applied instruction in carillon. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS361","T":"MUS 361 Men's Chorus","D":"A choral ensemble of men&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Men&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS362","T":"MUS 362 Choral Union","D":"Chorus Union, a mixed choir of students and community members, rehearses one evening per week and performs concerts throughout the year. Choral Union collaborates with other choral ensembles during the academic year and performs a variety of choral literature. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. Open to all students and community members by audition. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS363","T":"MUS 363 Women's Chorus","D":"A choral ensemble of women&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Women&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS368","T":"MUS 368 Chorale","D":"Chorale is a chorus of mixed men&apos;s and women&apos;s voices that studies and performs advanced choral repertoire both on and off campus. The Chorale will collaborate with other vocal and instrumental ensembles during the academic year. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS372","T":"MUS 372 Small Ensemble","D":"Ensembles may be arranged each semester in piano, voice, strings, wind instruments and percussion to meet needs of participating students and the department. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS373","T":"MUS 373 String Orchestra Workshop","D":"Study, performance of the literature and style of music for string ensembles of all sizes, a conducted group. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":1}}
{"I":"MUS374","T":"MUS 374 Jazz Ensemble","D":"Laboratory course in instrumentation, materials, arranging and organization of Jazz Ensemble. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS375","T":"MUS 375 Band","D":"Band performs as marching unit during football season and as indoor ensemble throughout the school year. Analytical study and stylistic performance of literature for conducted wind ensembles of all sizes. Band performs on campus, in area high schools and in the stadia of other colleges. Auditions for placement and additional group work required. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":4}}
{"I":"MUS376","T":"MUS 376 University Symphony","D":"The symphony performs music from the standard symphonic literature and cooperates with other ensembles to perform major choral and operatic works. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS377","T":"MUS 377 Marching Band","D":"Marching band performs as a unit during football season. Band performs on campus, in area high schools, and in the stadia of other colleges. Auditions for placement and additional group work required. Band grants available to qualified students. Fees and assessments apply to course. May be repeated for credit. Only 8 hours of large ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS378","T":"MUS 378 University/Community Band","D":"Traditional-style concert band which provides performance opportunities for musicians from the university and the community at large. At least one concert is presented each semester. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS380","T":"MUS 380 Musical Theatre Workshop","D":"Performance laboratory for students majoring in Musical Theatre. Preparation and performance of musical numbers from the musical theatre repertoire. Emphasis will be placed on the synthesis of performance techniques related to various musical styles. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"MUS392","T":"MUS 392 Accompanying","D":"Development of skills in accompanying for pianist. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS393","T":"MUS 393 Opera Workshop","D":"Preparation and production of opera as it pertains to singing actors and ensembles. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS398","T":"MUS 398 Junior Recital","D":"Preparation and public presentation of a solo recital in the student&apos;s major applied area. Required of all music majors on the Bachelor of Music-Performance degree. The student must pass a recital hearing before the performance can occur. Supplemental course fee. ","P":"<em>Prerequisite: MUS 298.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS399","T":"MUS 399 Special Topics in Music","D":"Topic of interest determined by student and professor. May be repeated, as topics change, to maximum of 6 credit hours. Variable content course. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS407","T":"MUS 407 Recital Attendance VII","D":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non departmental concerts must be pre approved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: piano proficiency.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":0,"E":0,"L":0}}
{"I":"MUS410","T":"MUS 410 Middle Childhood and Preadolescent Vocal Methods and Materials","D":"Principles and techniques for working with middle or junior high school voices and teaching music classes at the middle level with special attention paid to vocal development, voice change, and vocal health for pre-adolescents. Pedagogical analysis of choral/vocal music literature, lesson planning, and classroom management specific to this age group. Includes organization and administration of vocal music classes commonly found in programs at this level. Requires a 20-hour practicum at the middle level. ","P":"<em>Prerequisite: admission to Teacher Education Program, MUS 204 and MUS 322 and MUS 518.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS411","T":"MUS 411 Secondary Instrumental Methods and Materials","D":"Explores effective music methods and teaching strategies utilized in instrumental programs in middle or junior high schools and in high schools. Includes organization and administration of instrumental music classes commonly found in programs at those levels. Survey and analysis of instrumental music for large and small instrumental ensembles of all types and levels (K-12). ","P":"<em>Prerequisite: admission to Teacher Education Program, MUS 204 and MUS 328 and MUS 323.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS416","T":"MUS 416 Recording Arts Practicum","D":"Practice in the recording studio environment, creating CD-quality music and soundtracks. Instruction will be provided in session conduct as well as advanced operations in tracking, editing, and mixing. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS430","T":"MUS 430 Music in Early Childhood and the Elementary School","D":"Methods of teaching music in early childhood and elementary school classrooms. A 20-hour practicum in elementary music classrooms is required as part of this course. ","P":"<em>Prerequisite: admission to Teacher Education Program.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS449","T":"MUS 449 String (Instrument)","D":"Applied instruction available in violin, viola, violoncello, bass viol. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS451","T":"MUS 451 Piano","D":"Applied instruction in piano. May be repeated for credit. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS452","T":"MUS 452 Organ","D":"Applied instruction in organ. May be repeated for credit. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS453","T":"MUS 453 Voice","D":"Applied instruction in voice. May be repeated for credit. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS455","T":"MUS 455 Woodwind (Instrument)","D":"Applied instruction available in flute, oboe, clarinet, bassoon, saxophone. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS456","T":"MUS 456 Brass (Instrument)","D":"Applied instruction available in horn, trumpet, trombone, baritone, and tuba. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS457","T":"MUS 457 Percussion","D":"Applied instruction in percussion instruments. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS458","T":"MUS 458 Guitar","D":"Applied instruction in classical guitar. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS459","T":"MUS 459 Harp","D":"Applied instruction in harp. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS460","T":"MUS 460 Carillon","D":"Applied instruction in carillon. May be repeated for credit. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor; and admission to Music degree program.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS461","T":"MUS 461 Men's Chorus","D":"A choral ensemble of men&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Men&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS462","T":"MUS 462 Choral Union","D":"Chorus Union, a mixed choir of students and community members, rehearses one evening per week and performs concerts throughout the year. Choral Union collaborates with other choral ensembles during the academic year and performs a variety of choral literature. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. Open to all students and community members by audition. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS463","T":"MUS 463 Women's Chorus","D":"A choral ensemble of women&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Women&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS468","T":"MUS 468 Chorale","D":"Chorale is a chorus of mixed men&apos;s and women&apos;s voices that studies and performs advanced choral repertoire both on and off campus. The Chorale will collaborate with other vocal and instrumental ensembles during the academic year. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS472","T":"MUS 472 Small Ensemble","D":"Ensembles may be arranged each semester in piano, voice, strings, wind instruments and percussion to meet needs of participating students and the department. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS473","T":"MUS 473 String Orchestra Workshop","D":"Study, performance of the literature and style of music for string ensembles of all sizes, a conducted group. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":1}}
{"I":"MUS474","T":"MUS 474 Jazz Ensemble","D":"Laboratory course in instrumentation, materials, arranging and organization of Jazz Ensemble. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS475","T":"MUS 475 Band","D":"Band performs as marching unit during football season and as indoor ensemble throughout the school year. Analytical study and stylistic performance of literature for conducted wind ensembles of all sizes. Band performs on campus, in area high schools and in the stadia of other colleges. Auditions for placement and additional group work required. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":4}}
{"I":"MUS476","T":"MUS 476 University Symphony","D":"The symphony performs music from the standard symphonic literature and cooperates with other ensembles to perform major choral and operatic works. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS478","T":"MUS 478 University/Community Band","D":"Traditional-style concert band which provides performance opportunities for musicians from the university and the community at large. At least one concert is presented each semester. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS480","T":"MUS 480 Musical Theatre Workshop","D":"Performance laboratory for students majoring in Musical Theatre. Preparation and performance of musical numbers from the musical theatre repertoire. Emphasis will be placed on the synthesis of performance techniques related to various musical styles. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"MUS488","T":"MUS 488 Seminar in Student Teaching","D":"A blended seminar focused on the analysis of diverse teaching contexts, student learning, and field experiences during student teaching. Topics will include: Theory into Practice, The Job Search, Diversity, the Teacher Work Sample, Assessment, and Classroom Management. Students attend (in person or on-line) weekly 2-hour seminars. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: all course work required for the Bachelor of Music Education completed, including the senior recital and piano proficiency; minimum combined (Missouri State and transfer) GPA of 2.75; minimum GPA in Music of 3.00, with no grade lower than a &quot;C&quot;; minimum GPA of 3.00 in professional education; and concurrent enrollment in MUS 494 and MUS 496.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS492","T":"MUS 492 Accompanying","D":"Development of skills in accompanying for pianist. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS493","T":"MUS 493 Opera Workshop","D":"Preparation and production of opera as it pertains to singing actors and ensembles. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS494","T":"MUS 494 Supervised Teaching (Elementary Music K-6)","D":"Students will observe, assist and teach music classes under the direction of the cooperating teacher and University supervisor. Participation in extra-curricular activities and other duties is expected. An ongoing full-time commitment to student teaching is required to remain enrolled. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. ","P":"<em>Prerequisite: all course work required for the Bachelor of Music Education completed, including the senior recital and piano proficiency; minimum combined (Missouri State and transfer) GPA of 2.75; minimum GPA of 3.00 in music with no grade lower than a &quot;C&quot;; minimum GPA of 3.00 in professional education; current pre-professional liability insurance; completion of Transition Points 1 and 2; approval for supervised teaching; and concurrent enrollment in MUS 496 and MUS 488.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":0,"L":0}}
{"I":"MUS496","T":"MUS 496 Supervised Teaching (Secondary Music 7-12)","D":"Students will observe, assist and teach music classes under the direction of the cooperating teacher and University supervisor. Participation in extra-curricular activities and other duties is expected. An ongoing full-time commitment to student teaching is required to remain enrolled. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: all course work required for the Bachelor of Music Education completed, including the senior recital and piano proficiency; minimum combined (Missouri State and transfer) GPA of 2.75; minimum GPA of 3.00 in music with no grade lower than a &quot;C&quot;; minimum GPA of 3.00 in professional education; current pre-professional liability insurance; completion of Transition Points 1 and 2; approval for supervised teaching; and concurrent enrollment in MUS 488 and MUS 494.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":5,"E":0,"L":0}}
{"I":"MUS498","T":"MUS 498 Senior Recital","D":"Preparation and public presentation of a solo recital in the student&apos;s major applied area. The student must pass a recital hearing before the performance can occur. Supplemental course fee. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: MUS 298 and at least three semesters Applied Music courses numbered 300 or above with grades of &quot;B&quot; or better in the major performance area or in composition.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS499","T":"MUS 499 Clinical Experiences in Teaching II","D":"This course is designed to meet HB 1711 for student&apos;s experience as a Teacher&apos;s Aide or Assistant Rule (Rule 5 CSR 80-805.040), to that of conventional student teachers within the same program. It is also designed to support completion of additional clinical requirements within that program including: seminars and workshops, required meetings, school related activities appropriate to the assignment, demonstrated mastery of the MoSPE standards and completion and overall assessment of a Professional Preparation Portfolio. This course is credited only on BSEd or appropriate masters-level certification programs. Can only receive credit for one of the following: AGE 499, AGT 499, ART 469, BSE 499, COM 493, ECE 499, ELE 499, ENG 434, FCS 498, HST 499, KIN 498, MCL 491, MID 499, MTH 496, MUS 499, SCI 499, SEC 499, SPE 499, THE 493. Supplemental course fee. ","P":"<em>Prerequisite: EDC 199; and admitted to Teacher Education Program; and grades of &quot;C&quot; or better in all professional education courses; and completion of portfolio checkpoints 1 and 2; and current pre-professional liability insurance; and program approval.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":4,"E":0,"L":0}}
{"I":"MUS501","T":"MUS 501 Music Education Workshop","D":"Variable topics related to music education instruction. Number of class hours determined by length of workshop and depth of topic. May be repeated for a maximum of 5 credit hours. May be taught concurrently with MUS 611. Cannot receive credit for both MUS 611 and MUS 501. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS503","T":"MUS 503 Orff in the Classroom","D":"A study of music education using the approach developed by Carl Orff. Will include creative techniques including instruments, singing and movement. May be taught concurrently with MUS 613. Cannot receive credit for both MUS 613 and MUS 503. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS506","T":"MUS 506 Band Administration and Materials","D":"Practicum and experience in all aspects of the successful band program. Includes organizational strategies and review of large and small ensemble literature for marching band, stage band, jazz band, and concert band. May be taught concurrently with MUS 606. Cannot receive credit for both MUS 606 and MUS 506. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS510","T":"MUS 510 Adolescent and Early Adult Choral/Vocal Literature and Materials for Secondary Levels","D":"Explores effective music methods and teaching strategies utilized in vocal programs in high schools. Includes pedagogy of the adolescent voice. Best practices for teaching a wide variety of vocal ensembles including curricular and extra-curricular groups. Rehearsal and lesson planning for achievement of outcomes. Practical administration of organizations commonly found in most choral music programs. Survey and analysis of choral music literature for individuals, large and small ensembles including glee clubs, mixed choruses and choirs of all levels of performance. A 20-hour practicum with an area vocal music program will be part of the course content. May be taught concurrently with MUS 609. Cannot receive credit for both MUS 510 and MUS 609. ","P":"<em>Prerequisite: admission to Teacher Education Program; MUS 204 and MUS 321 and MUS 518.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS512","T":"MUS 512 Electronic Music","D":"Exploration of theories and techniques of sound synthesis, sequencing, and digital audio through composition. Variable content course. May be repeated to a total of 6 hours when topic varies. May be taught concurrently with MUS 612. Cannot receive credit for both MUS 612 and MUS 512. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MUS516","T":"MUS 516 Composition I","D":"Elementary composition of pieces in a variety of forms. Emphasis on works for piano, solo instruments or voice. Adapted to meet the needs of the individual student. May be repeated. May be taught concurrently with MUS 616. Cannot receive credit for both MUS 616 and MUS 516. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS517","T":"MUS 517 Composition II","D":"Intermediate level composition. Emphasis on writing for small groups of instrumentalists or vocalists. Adapted to meet the needs of the individual student. May be repeated. May be taught concurrently with MUS 617. Cannot receive credit for both MUS 617 and MUS 517. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS518","T":"MUS 518 Choral Arranging","D":"Techniques of arranging for small and large choral ensembles; with attention given to the practical application in a teaching situation. May be taught concurrently with MUS 618. Cannot receive credit for both MUS 618 and MUS 518. ","P":"<em>Prerequisite: MUS 203.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS520","T":"MUS 520 Composition III","D":"Composing for larger groups of instrumentalists or vocalists. Adapted to meet the needs of the individual student. May be repeated. May be taught concurrently with MUS 619. Cannot receive credit for both MUS 619 and MUS 520. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS521","T":"MUS 521 Composition IV","D":"Advanced composition. A wide variety of mediums and styles are possible including electronic music of all types. Adapted to meet the needs of the individual student. May be repeated. May be taught concurrently with MUS 621. Cannot receive credit for both MUS 621 and MUS 521. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS523","T":"MUS 523 Keyboard Literature","D":"Recommended Prerequisite: MUS 345 and MUS 346. Keyboard works from the 17th century to the present. May be taught concurrently with MUS 623. Cannot receive credit for both MUS 623 and MUS 523. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS524","T":"MUS 524 Song and Opera Literature","D":"Italian arias, German Lieder; representative songs by French, English, and American composers; standard operatic repertoire in relation to the composer&apos;s style and the period of theater and music history from which they emanate. May be taught concurrently with MUS 624. Cannot receive credit for both MUS 624 and MUS 524. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS526","T":"MUS 526 Advanced Arranging","D":"Independent study or three hour seminar per week. Techniques of arranging for various choral or instrumental groups, suited to the need of the individual student. May be repeated to a total of 6 hours when topic varies. Variable content course. May be taught concurrently with MUS 626. Cannot receive credit for both MUS 626 and MUS 526. ","P":"<em>Prerequisite: MUS 204.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MUS529","T":"MUS 529 Introduction to Commercial Music","D":"A comprehensive survey of various aspects of music associated with the entertainment industry. Students will be exposed to a wide variety of topics including song and advertising jingle writing, scoring for film and video, negotiating contracts, and dealing with music publishers. May be taught concurrently with MUS 629. Cannot receive credit for both MUS 629 and MUS 529. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS530","T":"MUS 530 Vocal Pedagogy and Materials","D":"Understanding the basic principles of voice production and their application to the training of singers. A comparative study of different pedagogical approaches to voice training. Including a survey of materials needed in successful programs of choral and vocal education in secondary schools for all levels of performance. May be taught concurrently with MUS 630. Cannot receive credit for both MUS 630 and MUS 530. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS538","T":"MUS 538 Survey of Pedagogical Methods","D":"A study of methods of teaching applied music. May be taught concurrently with MUS 658. Cannot receive credit for both MUS 658 and MUS 538. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS539","T":"MUS 539 String Pedagogy and Instrumental Literature and Materials for Elementary and Secondary Levels","D":"Students will explore all aspects of orchestra and string programs for elementary and secondary education. Literature appropriate for beginning and advanced levels in school string programs will be addressed. May be taught concurrently with MUS 659. Cannot receive credit for both MUS 659 and MUS 539. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS543","T":"MUS 543 Music of the Renaissance","D":"A comprehensive study of Western music from the Franco-Netherlands composers to Monteverdi (c. 1450 to 1600). May be taught concurrently with MUS 683. Cannot receive credit for both MUS 683 and MUS 543. ","P":"<em>Prerequisite: MUS 345.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS544","T":"MUS 544 Music of the Baroque Era","D":"A comprehensive study of Western music from monody to J.S. Bach and Handel (c. 1600 to 1750). May be taught concurrently with MUS 684. Cannot receive credit for both MUS 684 and MUS 544. ","P":"<em>Prerequisite: MUS 345.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS545","T":"MUS 545 Music of the Classical Era","D":"A comprehensive study of Western music from pre-classicism to Beethoven (c. 1750 to 1810). May be taught concurrently with MUS 685. Cannot receive credit for both MUS 685 and MUS 545. ","P":"<em>Prerequisite: MUS 346.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS546","T":"MUS 546 Music of the Romantic Era","D":"A comprehensive study of Western music from Beethoven to the post-romantic composers (c. 1800 to 1900). May be taught concurrently with MUS 686. Cannot receive credit for both MUS 686 and MUS 546. ","P":"<em>Prerequisite: MUS 346.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS547","T":"MUS 547 Music of the 20th Century","D":"A comprehensive study of Western music from 1900 to the present. May be taught concurrently with MUS 687. Cannot receive credit for both MUS 687 and MUS 547. ","P":"<em>Prerequisite: MUS 346.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS548","T":"MUS 548 Choral Literature","D":"Choral literature from the Renaissance through the 20th Century. May be taught concurrently with MUS 688. Cannot receive credit for both MUS 688 and MUS 548. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS561","T":"MUS 561 Men's Chorus","D":"A choral ensemble of men&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Men&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS563","T":"MUS 563 Women's Chorus","D":"A choral ensemble of women&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Women&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS580","T":"MUS 580 Instrumental Conducting","D":"A study of conducting techniques and problems in rehearsal and performance. Baton technique and repertoire development. May be taught concurrently with MUS 670. Cannot receive credit for both MUS 670 and MUS 580. ","P":"<em>Prerequisite: MUS 323.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS581","T":"MUS 581 Choral Conducting","D":"A study of conducting techniques and problems in rehearsal and performance. Conducting technique and repertoire development. May be taught concurrently with MUS 671. Cannot receive credit for both MUS 671 and MUS 581. ","P":"<em>Prerequisite: MUS 322.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS599","T":"MUS 599 Special Topics in Music","D":"Topic of interest determined by student and professor. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. May be taught concurrently with MUS 689. Cannot receive credit for both MUS 689 and MUS 599. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS606","T":"MUS 606 Band Administration and Materials","D":"Practicum and experience in all aspects of the successful band program. Includes organizational strategies and review of large and small ensemble literature for marching band, stage band, jazz band, and concert band. May be taught concurrently with MUS 506. Cannot receive credit for both MUS 506 and MUS 606. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS609","T":"MUS 609 Choral Literature and Materials for Secondary Levels","D":"Survey and analysis of choral music for large and small ensembles including glee clubs, mixed choruses, and choirs of all levels of performance (7-12 grade). May be taught concurrently with MUS 510. Cannot receive credit for both MUS 510 and MUS 609. ","P":"","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS611","T":"MUS 611 Music Education Workshop","D":"Variable topics related to music education instruction. Number of credit hours determined by length of workshop and depth of topic. May be repeated for a maximum of five hours. May be taught concurrently with MUS 501. Cannot receive credit for both MUS 501 and MUS 611. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS612","T":"MUS 612 Electronic Music","D":"Exploration of theories and techniques of sound synthesis, sequencing, and digital audio through composition. Variable content course. May be repeated to a total of 6 hours when topic varies. May be taught concurrently with MUS 512. Cannot receive credit for both MUS 512 and MUS 612. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MUS613","T":"MUS 613 Orff in the Classroom","D":"A study of music education using the approach developed by Carl Orff. Will include creative techniques including instruments, singing, and movement. May be taught concurrently with MUS 503. Cannot receive credit for both MUS 503 and MUS 613. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS616","T":"MUS 616 Composition I","D":"Elementary composition of pieces in a variety of forms. Emphasis on works for piano, solo instruments, or voice. Adapted to meet the needs of the individual student. May be taught concurrently with MUS 516. Cannot receive credit for both MUS 516 and MUS 616. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS617","T":"MUS 617 Composition II","D":"Intermediate level composition. Emphasis on writing for small groups of instrumentalists or vocalists. Adapted to meet the needs of the individual student. May be taught concurrently with MUS 517. Cannot receive credit for both MUS 517 and MUS 617. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS618","T":"MUS 618 Choral Arranging","D":"Techniques of arranging for small and large choral ensembles; with attention given to the practical application in a teaching situation. May be taught concurrently with MUS 518. Cannot receive credit for both MUS 518 and MUS 618. ","P":"<em>Prerequisite: MUS 203.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS619","T":"MUS 619 Composition III","D":"Composing for larger groups of instrumentalists or vocalists. Adapted to meet the needs of the individual student. May be repeated. May be taught concurrently with MUS 520. Cannot receive credit for both MUS 520 and MUS 619. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS621","T":"MUS 621 Composition IV","D":"Advanced composition. A wide variety of mediums and styles are possible including electronic music of all types. Adapted to meet the needs of the individual student. May be repeated. May be taught concurrently with MUS 521. Cannot receive credit for both MUS 521 and MUS 621. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":0}}
{"I":"MUS623","T":"MUS 623 Keyboard Literature","D":"Keyboard works from the 17th century to the present. May be taught concurrently with MUS 523. Cannot receive credit for both MUS 523 and MUS 623. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS624","T":"MUS 624 Song and Opera Literature","D":"Italian arias, German Lieder; representative songs by French, English, and American composers; standard operatic repertoire in relation to the composer&apos;s style and the period of theater and music history from which they emanate. May be taught concurrently with MUS 524. Cannot receive credit for both MUS 524 and MUS 624. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS626","T":"MUS 626 Advanced Arranging","D":"Independent study or three hour seminar per week. Techniques of arranging for various choral or instrumental groups, suited to the need of the individual student. May be repeated to a total of 6 hours when topic varies. Variable content course. May be taught concurrently with MUS 526. Cannot receive credit for both MUS 526 and MUS 626. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":1,"L":4}}
{"I":"MUS629","T":"MUS 629 Introduction to Commercial Music","D":"A comprehensive survey of various aspects of music associated with the entertainment industry. Students will be exposed to a wide variety of topics including song and advertising jingle writing, scoring for film and video, negotiating contracts, and dealing with music publishers. May be taught concurrently with MUS 529. Cannot receive credit for both MUS 529 and MUS 629. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS630","T":"MUS 630 Vocal Pedagogy and Materials","D":"Understanding the basic principles of voice production and their application to the training of singers. A comparative study of different pedagogical approaches to voice training. Including a survey of materials needed in successful programs of choral and vocal education in secondary schools for all levels of performance. May be taught concurrently with MUS 530. Cannot receive credit for both MUS 530 and MUS 630. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS649","T":"MUS 649 String (Instrument)","D":"Applied instruction available in violin, viola, violoncello, and bass viol. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS651","T":"MUS 651 Piano","D":"Applied instruction in piano. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS652","T":"MUS 652 Organ","D":"Applied instruction in organ. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS653","T":"MUS 653 Voice","D":"Applied instruction in voice. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS655","T":"MUS 655 Woodwind","D":"Applied instruction in flute, oboe, clarinet, bassoon, and saxophone. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS656","T":"MUS 656 Brass","D":"Applied instruction in trumpet, horn, trombone, euphonium and tuba. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS657","T":"MUS 657 Percussion","D":"Applied instruction on percussion instruments. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS658","T":"MUS 658 Survey of Pedagogical Methods","D":"A study of methods of teaching applied music. May be taught concurrently with MUS 538. Cannot receive credit for both MUS 538 and MUS 658. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS659","T":"MUS 659 String Pedagogy and Instrumental Literature and Materials for Elementary and Secondary Levels","D":"Students will explore all aspects of orchestra and string programs for elementary and secondary education. Literature appropriate for beginning and advanced levels in school string programs will be addressed. May be taught concurrently with MUS 539. Cannot receive credit for both MUS 539 and MUS 659. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS660","T":"MUS 660 Carillon","D":"Applied instruction in carillon. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS661","T":"MUS 661 Men's Chorus","D":"A choral ensemble of men&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Men&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS663","T":"MUS 663 Women's Chorus","D":"A choral ensemble of women&apos;s voices that studies and performs music of various historical periods and genres both on and off campus. The Women&apos;s Chorus collaborates with other vocal and instrumental ensembles in the Music Department. Open to all University students by audition. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS670","T":"MUS 670 Instrumental Conducting","D":"A study of conducting techniques and problems in rehearsal and performance. Baton technique and repertoire development. May be taught concurrently with MUS 580. Cannot receive credit for both MUS 580 and MUS 670. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS671","T":"MUS 671 Choral Conducting","D":"A study of conducting techniques and problems in rehearsal and performance. Conducting technique and repertoire development. May be taught concurrently with MUS 581. Cannot receive credit for both MUS 581 and MUS 671. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS674","T":"MUS 674 Jazz Ensemble","D":"A Laboratory course in instrumentation, materials, arranging, and organization of the jazz ensemble. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS675","T":"MUS 675 Band","D":"The band performs as a marching unit during the football season and as an indoor ensemble throughout the school year. Formal concerts and public performances are given by the ensemble each year. Auditions for placement are required. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS678","T":"MUS 678 University/Community Band","D":"Traditional style concert band which provides performance opportunities for musicians from the university and the community at large. At least one concert is presented each semester. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS682","T":"MUS 682 Piano Ensemble","D":"The student will strengthen ensemble and rehearsal techniques through the study and performance of piano four-hand and duo literature. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS683","T":"MUS 683 Music of the Renaissance","D":"A comprehensive study of Western music from the Franco-Netherlands composers to Monteverdi (c. 1450 to 1600). May be taught concurrently with MUS 543. Cannot receive credit for both MUS 543 and MUS 683. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS684","T":"MUS 684 Music of the Baroque Era","D":"A comprehensive study of Western music from monody to J.S. Bach and Handel (c. 1600 to 1750). May be taught concurrently with MUS 544. Cannot receive credit for both MUS 544 and MUS 684. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS685","T":"MUS 685 Music of the Classical Era","D":"A comprehensive study of Western music from pre-classicism to Beethoven (c. 1750 to 1810). May be taught concurrently with MUS 545. Cannot receive credit for both MUS 545 and MUS 685. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS686","T":"MUS 686 Music of the Romantic Era","D":"A comprehensive study of Western music from Beethoven to the post-romantic composers (c. 1800 to 1900). May be taught concurrently with MUS 546. Cannot receive credit for both MUS 546 and MUS 686. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS687","T":"MUS 687 Music of the 20th Century","D":"A comprehensive study of Western music from 1900 to the present. May be taught concurrently with MUS 547. Cannot receive credit for both MUS 547 and MUS 687. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS688","T":"MUS 688 Choral Literature","D":"Choral literature from the Renaissance through the 20th Century. May be taught concurrently with MUS 548. Cannot receive credit for both MUS 548 and MUS 688. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS689","T":"MUS 689 Special Topics in Music","D":"Topic of interest determined by student and professor. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. May be taught concurrently with MUS 599. Cannot receive credit for both MUS 599 and MUS 689. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS700","T":"MUS 700 Introduction to Graduate Study in Music","D":"General introduction to graduate curriculum; planning the program; formal writing style; sources used in research; study of methods in research. Required of all degree candidates. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS701","T":"MUS 701 Music Education Curriculum","D":"An examination of trends in elementary, middle, and secondary music education; evaluation of selected materials and techniques; and special projects in planning for change in music education curriculum. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS702","T":"MUS 702 Elementary Music Education","D":"Study of problems in planning a music program to encourage children&apos;s aesthetic enjoyment of music; teaching principles and methods for guided learning through creative discovery; use of instructional media for providing such experiences. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS707","T":"MUS 707 Psychology of Music","D":"Adapted to the view of the music educator. Emphasis is placed upon the physics of sound, psychology of performances and teaching, and the principles of listening. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS708","T":"MUS 708 Contemporary Music Education","D":"A study of current trends and contemporary issues relevant to education and/or music education, as identified from various sources, and what impact they may or may not have on music education. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS715","T":"MUS 715 Advanced Composition","D":"Private compositional study for graduate students. Variable content course. May be repeated to a total of 9 hours when topic varies. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS720","T":"MUS 720 Directed Study in Music Education","D":"Individual study and research on projects approved by Music Education faculty; individual conferences with assigned faculty members; oral report, and a document at conclusion of semester. May be repeated to 3 hrs. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS725","T":"MUS 725 History and Philosophy of Music Education","D":"History of educational philosophies and objectives. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS727","T":"MUS 727 Seminar: Music Theory","D":"A study of various aspects of music theory, including analysis and pedagogy, researched from primary and secondary sources from the medieval period through the present. May be repeated to a total of 6 hours when topic varies. ","P":"","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS728","T":"MUS 728 Pedagogy of Music Theory","D":"Techniques of teaching harmony and ear training as well as other theoretical aspects of music to high school and college music students. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS738","T":"MUS 738 Survey of Pre-College Repertoire","D":"An examination of appropriate repertoire from the Baroque, Classical, Romantic, and 20th Century style periods for beginner, intermediate, and advanced pre-college students. ","P":"<em>Prerequisite: MUS 538 or MUS 658.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":true},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS739","T":"MUS 739 Pedagogy Practicum I","D":"A course consisting of three components: class meetings for the discussion of teaching techniques, observation of the teaching of experienced teachers, supervised student teaching. ","P":"<em>Prerequisite: MUS 738.</em>","L":"courses_mu","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS740","T":"MUS 740 Pedagogy Practicum II","D":"Private teaching of a prescribed number of pre-college students of various levels of advancement under guidance of pedagogy instructor. Pedagogy students must present assigned pre-college students in an end of semester recital. ","P":"<em>Prerequisite: MUS 739.</em>","L":"courses_mu","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"MUS744","T":"MUS 744 Directed Study in Music Theory","D":"Individual study on approved projects; individual conferences with assigned faculty member. May be repeated to a total of 3 hours. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS745","T":"MUS 745 Directed Study in Music History and Literature","D":"Advanced study in special topics of music history and literature. May be repeated to a total of 3 hours when topic varies. Variable content course. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS746","T":"MUS 746 Seminar: Symphonic Literature","D":"A survey of the repertoire for orchestras of varying sizes and ability levels. May be repeated for credit for a total of 6 hours when topic varies. Variable content course. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS747","T":"MUS 747 Seminar: Wind Literature","D":"A survey of the repertoire for wind groups of various sizes and ability levels. May be repeated to a total of 6 hours when topic varies. Variable content course. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS748","T":"MUS 748 Seminar: Choral Literature","D":"A survey of the repertoire for choral groups of various sizes and ability levels. Variable content course. May be repeated to a total of 6 hours when topic varies. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS749","T":"MUS 749 String (Instrument)","D":"Applied instruction available in violin, viola, violoncello, and bass viola. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS751","T":"MUS 751 Piano","D":"Applied instruction in piano. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS752","T":"MUS 752 Organ","D":"Applied instruction in organ. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS753","T":"MUS 753 Voice","D":"Applied instruction in voice. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS755","T":"MUS 755 Woodwind (Instrument)","D":"Applied instruction available in flute, oboe, clarinet, bassoon, and saxophone. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS756","T":"MUS 756 Brass","D":"Applied instruction available in trumpet, French horn, trombone, euphonium and tuba. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS757","T":"MUS 757 Percussion","D":"Applied instruction on percussion instruments. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS760","T":"MUS 760 Carillon","D":"Applied instruction in carillon. May be repeated for credit. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS762","T":"MUS 762 Choral Union","D":"Chorus Union, a mixed choir of students and community members, rehearses one evening per week and performs concerts throughout the year. Choral Union collaborates with other choral ensembles during the academic year and performs a variety of choral literature. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree program in music. Open to all students and community members by audition. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS768","T":"MUS 768 Concert Chorale","D":"The choir is open to all college students by audition. All types of choral literature, accompanied and unaccompanied, are prepared and performed by its members. The choir presents a Christmas concert, a spring concert, and programs in area high schools. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":4}}
{"I":"MUS772","T":"MUS 772 Small Ensembles","D":"Ensembles may be arranged each semester in the fields of piano, voice, strings, wind instruments, and percussion to meet the needs of participating students and the department. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS773","T":"MUS 773 String Orchestra Workshop","D":"Study and performance of the literature and style of music for string ensembles of all sizes, A conducted group. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS774","T":"MUS 774 Stage Band","D":"A laboratory course in instrumentation, materials, arranging, and organization of the stage band. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS775","T":"MUS 775 Band","D":"The band performs as a marching unit during the football season and as an indoor ensemble throughout the school year. Formal concerts and public performances are given by the ensemble each year. Auditions for placement are required. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":4}}
{"I":"MUS776","T":"MUS 776 University Symphony","D":"Symphony performs and reads music from standard orchestral literature and accompanies opera productions. Open to all university orchestral players by audition. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":4}}
{"I":"MUS778","T":"MUS 778 University/Community Band","D":"Traditional-style concert band which provides performance opportunities for musicians from the university and the community at large. At least one concert is presented each semester. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS780","T":"MUS 780 Practicum in Advanced Conducting","D":"A study of techniques needed to project the conductor&apos;s concept in rehearsal and performance. Participation in rehearsals under the supervision of the instructor. May involve conducting in public performance. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"MUS781","T":"MUS 781 Score Reading and Analysis","D":"Analysis of scores and its application to conducting. Development of skills in reading clefs and transpositions. Variable content course. May be repeated to a total of 6 hours when topic varies. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"MUS790","T":"MUS 790 Research Project","D":"Research in the student&apos;s major area of concentration, culminating in a written document. Topic to be chosen through consultation with the student&apos;s major advisor. May be repeated for credit. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"MUS792","T":"MUS 792 Accompanying","D":"Development of skills in accompanying for pianists. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS793","T":"MUS 793 Opera Workshop","D":"Preparation and production of opera as it pertains to singing actors and ensembles. May be repeated for credit. Only 8 hours of ensembles can be counted toward a degree. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"MUS797","T":"MUS 797 Directed Study in Pedagogy","D":"Advanced study in special topics in pedagogy. Variable content course. May be repeated to a total of 3 hours when topic varies. ","P":"","L":"courses_mu","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"MUS798","T":"MUS 798 Graduate Recital","D":"Fulfills half of the final project requirement for concentrations in performance, pedagogy, and conducting. ","P":"","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":2,"E":0,"L":4}}
{"I":"MUS799","T":"MUS 799 Thesis","D":"Selection of thesis topic, research or compositional techniques to be employed, compilation of bibliography, guidance of compilation and interpretation of data; organization and writing of study or writing of composition and description including program notes. ","P":"<em>Prerequisite: permission of instructor.</em>","L":"courses_mu","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
