{"I":"TCM110","T":"TCM 110 Introduction to Engineering Design","D":"Introduction to design, computational methods, and design communication techniques. Computer aided design and computational analysis tools are introduced. Orthographic drawing, sketching theory and conventions, auxiliaries, sections, traditional dimensioning and tolerancing, and geometric dimensioning and tolerancing are introduced. ","P":"","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM121","T":"TCM 121 Construction Principles and Practice","D":"An introductory course which investigates the principles and practices associated with common building structural systems-includes foundations, heavy timber, masonry, steel, sitecast concrete, and precast concrete. Course will focus on the development of a fundamental knowledge base for managing construction projects through case study and hands-on experience. Lab activities may include job site visits, Habitat for Humanity, and concrete field testing. Supplemental course fee. ","P":"","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM122","T":"TCM 122 Construction Materials and Methods","D":"An introductory course which provides an overview of the materials and methods used in light framing and building finish systems from floor to roof and from exterior cladding to interior finishes. Includes wood light framing, light gage metal framing, roofing, glass and glazing, cladding systems, windows and doors, interior finishes, ceilings, and floors. This course will focus on development of a fundamental knowledge base through case-study, detailed product analysis, and hands-on experience. Lab activities may include job site visits and work with Habitat for Humanity or other service agencies. Supplemental course fee. ","P":"","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM123","T":"TCM 123 Introduction to Construction for Non-Construction Majors","D":"An introductory course which explores materials, principles and practices associated with building systems used in commercial and residential construction. Topics of discussion will include structural systems, light framing, roofing, exterior cladding systems and interior finishes. External class activities may include jobsite visits. ","P":"","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM221","T":"TCM 221 Construction Drawings and Quantity Take-off","D":"An introduction to working drawings and specifications commonly encountered in construction. Laboratory exercises in sketching theory and conventions, sectioning and dimensioning, classifying work, developing quantity take-offs of constructions materials, and interpreting construction documentation. ","P":"<em>Prerequisite: TCM 121 or TCM 122 or TCM 123.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM223","T":"TCM 223 Construction Surveying","D":"Construction field engineering activities to include surveying, site layout and dimensional control. Interpretation of plot books, site plans, and topographic maps is also included. ","P":"<em>Prerequisite: TCM 221; and MTH 261 or MTH 287.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM226","T":"TCM 226 Construction Project Administration","D":"A study of the legal and administrative aspects of construction projects. Includes use of documents, subcontracting, purchasing, changes, claims, payments, and closeout. ","P":"<em>Prerequisite: TCM 221.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM267","T":"TCM 267 Statics","D":"A study of the mechanics of forces associated with rigid bodies in equilibrium. Development of problem solving skills. ","P":"<em>Prerequisite: PHY 123 or PHY 203; and MTH 261 or 287.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM273","T":"TCM 273 Mechanics of Materials","D":"Introduces the principles of mechanics necessary for the solution of technical problems relating to strength, stiffness, and material selection, and is the student&apos;s first course in mechanical design. Topics covered include stress, strain, pressure vessel analysis, torsion, beams, columns, and combined stresses at a point. ","P":"<em>Prerequisite: PHY 233.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM281","T":"TCM 281 Dynamics","D":"An in-depth, quantitative treatment of technical problems involving motion and acceleration. Topics include plane motion; three dimensional motion; force, mass and acceleration; mechanical work and energy; and impulse and momentum. Linear and angular momentum. ","P":"<em>Prerequisite: PHY 233.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM296","T":"TCM 296 Readings in Technology","D":"Directed readings for individuals requiring additional depth or breadth of study. Outline of study must be approved prior to enrolling. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM297","T":"TCM 297 Topics in Technology","D":"A variable content course with topics that can change from semester to semester depending on faculty and student interests. Consult the semester class schedule for the current offering under this number. May be repeated to a total of 6 hours. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM299","T":"TCM 299 Cooperative Education in Technology","D":"The opportunity to earn academic credit in a planned learning process that integrates supervised work experience and education in an approved industrial setting. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_im","O":{"F":true,"S":true,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM303","T":"TCM 303 Facilities Operation and Maintenance","D":"Introduces history and concepts of facility management, with emphasis on definition of key terms and concepts. Introduction to operations and maintenance of buildings with an emphasis on techniques utilized to maintain facilities. ","P":"","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM311","T":"TCM 311 Engineering Graphics","D":"The application of DFMA (Design for Manufacturability and Assembly) to produce part and assembly models utilizing feature-based 3D solid modeling software. Topics include: design cycle, working drawings, blueprint reading, technical presentation, fit classifications, dimensioning per ANSI Y14.5M and geometric dimensioning and tolerancing. ","P":"<em>Prerequisite: TCM 110.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM313","T":"TCM 313 Facility Design","D":"Using Building Information Modeling for facility space design and requirements analysis, construction materials selection, and quantity schedule development. ","P":"<em>Prerequisite: TCM 221.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM315","T":"TCM 315 Thermodynamics and Heat Transfer","D":"Introduces the concepts, laws, and problem solving methodologies needed for the solution of technical problems involving energy conversion, thermodynamics, and heat transfer. Topics covered include gas, vapor, and fluid properties; the laws of thermodynamics; and convective, radiative, and conductive heat transfer. ","P":"<em>Prerequisite: MTH 280 and PHY 203.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM318","T":"TCM 318 Structural Design Principles","D":"The design of simple structural members used in construction. Topics include applications in concrete, steel, soils and wood, form design and other temporary structures used in construction. ","P":"<em>Prerequisite: TCM 267.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM320","T":"TCM 320 Construction Contracts, Specifications and Law","D":"An introduction to basic construction contracts, specifications, and law. Discussion of the application of contract principles to construction contracts, together with a detail summary of specifications and other documents which form an essential part of construction contracts. Legal topics of special interest to construction professionals will also be discussed. ","P":"<em>Prerequisite: LAW 231 or TCM 303.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM321","T":"TCM 321 Mechanical Systems for Buildings","D":"This course addresses the principles and practices of heating, ventilation, cooling, plumbing and fire protection systems used in residential, commercial and industrial applications. Emphasis is placed on coordination of design, applicable codes, installation, and problem solving. ","P":"<em>Prerequisite: TCM 121 or TCM 122; and MTH 135 or higher.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM322","T":"TCM 322 Electrical Systems for Buildings","D":"This course addresses the principles and practices of electrical and lighting systems used in residential, commercial and industrial applications. Emphasis is placed on coordination of the NEC, design, and installation of various systems in the building process. Supplemental course fee. ","P":"<em>Prerequisite: TCM 221.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM324","T":"TCM 324 Construction Cost Estimating","D":"A project oriented course where quantification and pricing of direct field costs and general condition costs from construction plans and specifications are developed. Course topics also include: development of feasibility, conceptual, lump sum, and unit costs estimates, production rates; development of bidding strategy; computerization estimates; and presentation of the bid. ","P":"<em>Prerequisite: TCM 221.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM325","T":"TCM 325 Fluid Mechanics","D":"Fundamentals of fluid mechanics. Properties of liquids and gases; fluid statics; fluid dynamics; hydraulic and pneumatic machines. Theory of incompressible flow. ","P":"<em>Prerequisite: TCM 315.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM326","T":"TCM 326 Construction Soils and Foundations","D":"An overview of the nature of soil materials and their engineering properties is coupled with simple, direct examples of analysis to show how construction methods and operations may be controlled or influenced. Introduces updated information developed in research and practices for applications to construction operations. Supplemental course fee. ","P":"<em>Prerequisite: TCM 267.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM331","T":"TCM 331 Emerging Technologies in Materials and Processes","D":"Properties of engineering materials, heat treatment, measurement and inspection, casting, forging, machining, and other traditional manufacturing processes. ","P":"<em>Prerequisite: TCM 273.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM337","T":"TCM 337 Quality Control and Measurement","D":"This course covers basic techniques of quality control and metrology. Topics covered include basic statistics, process capability, statistical process control, sampling, and measuring and gauging techniques. ","P":"","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM347","T":"TCM 347 Industrial Equipment and Control","D":"Examines industrial power delivery systems and their control including electrical and mechanical systems. Laboratory experiences will include an introduction to motors, motor controls, and programmable logic controllers. Supplemental course fee. ","P":"<em>Prerequisite: TCM 322 or TCM 331.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM350","T":"TCM 350 Management and Control of Quality","D":"A study of management and control of quality as applied to both production and service enterprises. Topics include: basic quality systems, quality planning, international quality systems, supply chain management. In addition, an introduction to six sigma and design of experiments is included. ","P":"<em>Prerequisite: TCM 337.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM354","T":"TCM 354 Facility Planning","D":"Investigates programming and space allocation for facility managers executing planned development. Master, strategic, and daily planning tools are explored. ","P":"","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM355","T":"TCM 355 Production Planning and Control","D":"Production planning and control activities in the various industrial environments. Focus will be placed on the necessary prerequisites for an effective shop floor control system including computer simulation and modeling. Assemble-to-order, engineer-to-order, make-to-order, and make-to-stock are emphasized. ","P":"<em>Prerequisite: 53 hours.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM358","T":"TCM 358 Introduction to Technology Management","D":"Provides students with a conceptual framework for understanding the social and economic environment of contemporary technology. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM359","T":"TCM 359 Principles of Project Management","D":"A study of project management including the planning, organizing, directing, controlling, and coordinating functions used to achieve productivity enhancements in an industrial environment. Includes project management case studies from a variety of industries. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: 53 hours.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM361","T":"TCM 361 Service Learning in Technology","D":"This service component of an existing course incorporates community service with classroom instruction in industrial management to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of a participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","P":"<em>Prerequisite: 30 hours and concurrent registration in an TCM course designated as a service learning offering.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM365","T":"TCM 365 Computer Integrated Manufacturing","D":"A study of the design, integration, and information flow, associated with automated manufacturing systems. Topics covered include CAD/CAM, robotics, and PLC applications. ","P":"<em>Prerequisite: TCM 110 and TCM 347.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM366","T":"TCM 366 Energy and Control Systems","D":"Comprehensive overview of building operating systems and their design and functions. In-depth analysis of the various types of building mechanical systems. ","P":"<em>Prerequisite: TCM 347; or TCM 321 and TCM 322.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM396","T":"TCM 396 Readings in Technology","D":"Directed readings for individuals requiring additional depth or breadth of study. Outline of study must be approved prior to enrolling. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of Department Head.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM397","T":"TCM 397 Topics in Emerging Technology","D":"A variable content course that reflects the latest developments, applications, and opportunities associated with emerging technologies. Current research at the Center for Applied Science and Engineering (CASE) is emphasized. Consult the semester class schedule for the current offering under this number. May be repeated for a total of 6 hours. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM399","T":"TCM 399 Cooperative Education in Industry","D":"The opportunity to earn academic credit in a planned learning process that integrates supervised work experience and education in an approved industrial setting. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: 60 hours and permission of Department Head.</em>","L":"courses_im","O":{"F":true,"S":true,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM401","T":"TCM 401 Facility Management","D":"Students examine how facilities, building operations, and maintenance functions are managed. Examines non-building related services. Focuses on security, food services, reprographics, transportation, property disposal, purchasing, and mail and messenger services. ","P":"<em>Prerequisite: TCM 354.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM402","T":"TCM 402 Facility Administration","D":"Covers the procedural, tracking, and resource requirements needed to carry out the responsibilities assigned to the facility function. Topics of study include portfolio management, contracts and specifications, and the coordination of personnel. ","P":"<em>Prerequisite: TCM 354.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM411","T":"TCM 411 Mechanical Design and Analysis","D":"This course deals with mechanism design and design for manufacture. Topics include tolerancing, material selection, cost estimation, process planning, product fabrication, and mechanism synthesis. ","P":"<em>Prerequisite: TCM 331.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM424","T":"TCM 424 Mechanical and Electrical Systems Estimating","D":"Quantity take-off and cost estimating for specialty construction work including plumbing, mechanical, and electrical systems. Students perform a complete take-off, pricing, and bid preparation for a small commercial construction project. ","P":"<em>Prerequisite: TCM 321 and TCM 322 and TCM 324.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM425","T":"TCM 425 Construction Planning and Scheduling","D":"Introduction to the basic principles, techniques, and practices used by contractors to plan, schedule, and update construction projects timelines. Extensive use of commercial scheduling software. ","P":"<em>Prerequisite: TCM 324.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM427","T":"TCM 427 Construction Equipment Management","D":"Study of the basic principles, practices, and techniques used in the construction industry for selecting and managing construction equipment. Focuses on understanding the time value of money, estimating equipment ownership and operating costs, selecting the proper equipment for specific construction tasks, and estimating equipment production. ","P":"<em>Prerequisite: TCM 324.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM438","T":"TCM 438 Systems Integration","D":"Emphasizes the use, processes for evaluating, and implementation of facility management technologies including integration of the various facility functions. ","P":"<em>Prerequisite: TCM 365 or TCM 366.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM453","T":"TCM 453 Construction Cost Management","D":"Introduction to financial and cost concepts used in the construction industry. Emphasizes the analysis and use of financial statements, job cost accounting systems, and cost control. ","P":"<em>Prerequisite: ACC 201 and TCM 324.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM454","T":"TCM 454 Construction Safety Management","D":"Occupational safety and health standards and codes as they relate to the construction industry. Job-site safety assessment, safety program elements, accident costs and prevention, ethics and management practices. ","P":"<em>Prerequisite: 53 hours.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM455","T":"TCM 455 Safety Management","D":"Occupational safety and health standards and codes. Hazard recognition, accident costs, accident prevention, ethics and administration. OSHA certification is not offered with this course. Cannot receive credit for both TCM 454 and TCM 455. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM456","T":"TCM 456 Supervision","D":"A study of the role of the supervisor and the concepts and techniques that may be utilized to optimize productivity. Topics include the legal aspects of supervision, roles and responsibilities of the supervisor and guiding teamwork. ","P":"<em>Prerequisite: 53 hours.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM458","T":"TCM 458 Technology Management","D":"Technology issues related to operations and production management. Focuses on the design, management, and improvement of operation systems and processes. ","P":"<em>Prerequisite: TCM 358.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM491","T":"TCM 491 Management Competition","D":"Participation in planning, preparation, execution and debriefing for a management competition team sponsored by industry or an educational association, and coached by a member of the department faculty. The fulfillment of these requirements must be verified by the faculty coach and the department head. Participation in all aspects of the competition is required. May be repeated to a total of 3 hours. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"TCM494","T":"TCM 494 Professional Internship","D":"Recommend completion during the summer preceding the senior year. The integration of supervised work experience and education in an approved industrial setting. May also serve as the information gathering phase of the capstone project in which students demonstrate achievement of program objectives through solution of a problem provided by an industry sponsor. Supplemental course fee. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_im","O":{"F":true,"S":true,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM497","T":"TCM 497 Topics in Emerging Technology","D":"A variable content course that reflects the latest developments, applications and opportunities associated with emerging technologies. Current research at the Center for Applied Science and Engineering (CASE) is emphasized. Consult the semester class schedule for current offerings under this number. May be repeated to a total of 6 hours. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM498","T":"TCM 498 Senior Design","D":"Capstone experience for all engineering technology majors. Students will participate in interdisciplinary teams to perform applied research, bringing a product from conceptual design through manufacture. Activities will include detail design and tolerancing, material selection, cost estimation, process planning, schedule and material requirements planning, distribution system design, software planning and implementation, and product fabrication. Course deliverables will include a written report, all design data and analyses, and one or more working, physical products. ","P":"<em>Prerequisite: TCM 411 and TCM 511.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"TCM499","T":"TCM 499 Senior Project","D":"A capstone project in which students demonstrate attainment of program objectives through solution of a problem provided by an industry sponsor. Requires technical report and oral presentation. Evaluated by committee from faculty and industry. Team projects are permissible and encouraged. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":2}}
{"I":"TCM502","T":"TCM 502 Healthcare Facility Management","D":"Examines facility management attributes related to maintenance and operations; regulatory compliance; planning, design and construction; and administration unique to healthcare. May be taught concurrently with TCM 602. Cannot receive credit for both TCM 502 and TCM 602. ","P":"<em>Prerequisite: MTH 181 and TCM 401.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM503","T":"TCM 503 Project Risk Analysis","D":"In-depth analysis of the types of risks that threaten projects at each stage of development. Strategies used to recognize risks, assess probabilities and potential impacts, steps to respond to project risks. Tools used to analyze and plan for managing project risk. May be taught concurrently with TCM 603. Cannot receive credit for both TCM 503 and TCM 603. ","P":"<em>Prerequisite: TCM 337 or QBA 237.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM511","T":"TCM 511 Product Design and Development","D":"An overview of the product development process from concept generation to design in an entrepreneurial environment. The perspectives of marketing, design and manufacturing are blended into a single approach to product development. Provides students with an appreciation for the realities of industrial practice and for the complex and essential roles played by the various members of product development teams. May be taught concurrently with TCM 611. Cannot receive credit for both TCM 511 and TCM 611. ","P":"<em>Prerequisite: TCM 359; and 80 hours; and undergraduate majors in the department of Technology and Construction Management must be admitted to degree program.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM545","T":"TCM 545 Project Control Systems","D":"Advanced application of microcomputers with an emphasis on their use in project control. Topics include project control planning and objectives, change control processes, project documentation and communication, project progress/variance reports, payment requisitions, project closure activities, and project lessons learned systems. May be taught concurrently with TCM 645. Cannot receive credit for both TCM 545 and TCM 645. ","P":"<em>Prerequisite: TCM 359; and undergraduate majors in the department of Technology and Construction Management must be admitted to degree program.</em>","L":"courses_im","O":{"F":false,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM551","T":"TCM 551 Cost Analysis for Project Management","D":"The use of cost analysis as a decision-making tool in the context of project management. Topics include the time value of money, analysis of alternatives, decision-making under risk, estimating, cost accounting, and capital budgeting. May be taught concurrently with TCM 651. Cannot receive credit for both TCM 551 and TCM 651. ","P":"<em>Prerequisite: 80 hours; and undergraduate majors in the department of Technology and Construction Management must be admitted to degree program.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM555","T":"TCM 555 Statistical Quality Control and Design of Experiments","D":"Topics include the practice of statistical techniques widely used in industry to improve quality, reduce costs, and optimize processes. Minimization of variability and basic approaches to statistically designed experiments are emphasized. May be taught concurrently with TCM 655. Cannot receive credit for both TCM 555 and TCM 655. ","P":"<em>Prerequisite: QBA 237 or equivalent; and 80 hours; and undergraduate majors in the department of Technology and Construction Management must be admitted to degree program.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM596","T":"TCM 596 Readings in Technology Management","D":"Directed readings for individuals requiring additional depth or breadth of study. Outline of study must be approved prior to enrolling. May be repeated to a total of 6 hours. May be taught concurrently with TCM 696. Cannot receive credit for both TCM 696 and TCM 596. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM597","T":"TCM 597 Topics in Technology Management","D":"A variable content course with topics that depend on faculty and student interests. Consult the semester class schedule for the current offering under this number. May be repeated up to a total of 9 hours when content varies. May be taught concurrently with TCM 697. Cannot receive credit for both TCM 597 and TCM 697. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM602","T":"TCM 602 Healthcare Facility Management","D":"Examines facility management attributes related to maintenance and operations; regulatory compliance; planning, design and construction; and administration unique to healthcare. May be taught concurrently with TCM 502. Cannot receive credit for both TCM 602 and TCM 502. ","P":"<em>Prerequisite: permission.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM603","T":"TCM 603 Project Risk Analysis","D":"In-depth analysis of the types of risks that threaten projects at each stage of development. Strategies used to recognize risks, assess probabilities and potential impacts, steps to respond to project risks. Tools used to analyze and plan for managing project risk. May be taught concurrently with TCM 503. Cannot receive credit for both TCM 603 and TCM 503. ","P":"<em>Prerequisite: TCM 701 and acceptance in the Project Management MS or Graduate Certificate program; or permission of the Project Management MS program director.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM611","T":"TCM 611 Product Design and Development","D":"An overview of the product development process from concept generation to design in an entrepreneurial environment. The perspectives of marketing, design and manufacturing are blended into a single approach to product development. Provides students with an appreciation for the realities of industrial practice and for the complex and essential roles played by the various members of product development teams. May be taught concurrently with TCM 511. Cannot receive credit for both TCM 611 and TCM 511. ","P":"<em>Prerequisite: TCM 701 and acceptance in the Project Management MS or Graduate Certificate program; or permission of the Project Management MS program director.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM645","T":"TCM 645 Project Control Systems","D":"Advanced application of microcomputers with an emphasis on their use in project control. Topics include project control planning and objectives, change control processes, project documentation and communication, project progress/variance reports, payment requisitions, project closure activities, and project lessons learned systems. May be taught concurrently with TCM 545. Cannot receive credit for both TCM 645 and TCM 545. ","P":"<em>Prerequisite: TCM 701 and acceptance in the Project Management MS or Graduate Certificate program; or permission of the Project Management MS program director.</em>","L":"courses_im","O":{"F":false,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM651","T":"TCM 651 Cost Analysis for Project Management","D":"The use of cost analysis as a decision-making tool in the context of project management. Topics include the time value of money, analysis of alternatives, decision-making under risk, estimating, cost accounting, and capital budgeting. May be taught concurrently with TCM 551. Cannot receive credit for both TCM 651 and TCM 551. ","P":"<em>Prerequisite: acceptance in the Project Management MS or Graduate Certificate program; or permission of the Project Management MS program director.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM655","T":"TCM 655 Statistical Quality Control and Design of Experiments","D":"Topics include the practice of statistical techniques widely used in industry to improve quality, reduce costs, and optimize processes. Minimization of variability and basic approaches to statistically designed experiments are emphasized. May be taught concurrently with TCM 555. Cannot receive credit for both TCM 655 and TCM 555. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM696","T":"TCM 696 Readings in Technology Management","D":"Directed readings for individuals requiring additional depth or breadth of study. Outline of study must be approved prior to enrolling. May be repeated to a total of 6 hours. May be taught concurrently with TCM 596. Cannot receive credit for both TCM 696 and TCM 596. ","P":"<em>Prerequisite: permission of department head.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM697","T":"TCM 697 Topics in Technology Management","D":"A variable content course with topics that depend on faculty and student interests. Consult the semester class schedule for the current offering under this number. May be repeated up to a total of 9 hours when content varies. May be taught concurrently with TCM 597. Cannot receive credit for both TCM 697 and TCM 597. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM701","T":"TCM 701 Project Management","D":"This course provides a comprehensive overview of project management. The culture, principles, and basic techniques of project management are addressed using the project lifecycle as the primary organizational guideline. The project management functions of planning, organizing, motivating and controlling with an emphasis on the application to business and technology are explained. Basic tools of project management such as work breakdown structure, scheduling, contracting, earned value analysis, and risk management are explained and demonstrated. ","P":"<em>Prerequisite: acceptance in the Project Management MS or graduate certificate program; or permission of the Project Management Program Director.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM710","T":"TCM 710 Project Leadership","D":"A practical and relevant course that focuses on the people skills needed to manage a project successfully. Prepares students to handle project problems related to communication, motivation, performance, behavior, and crisis. Students analyze real life scenarios and develop solutions that are supported by the latest research to develop skills necessary for strong, effective project leadership. ","P":"<em>Prerequisite: acceptance in the Project Management MS or Graduate Certificate program, or MS in Cybersecurity, or permission of the Project Management MS program director.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM726","T":"TCM 726 Seminar in Project Management","D":"Presentation and discussion of professional or technical problems in the organization and management of projects. Students are expected to demonstrate the ability to apply the knowledge and experience gained in their program of study to the critical evaluation and analysis of the theory, research and practice of project management. ","P":"<em>Prerequisite: TCM 701; total of 21 graduate hours in the Project Management MS program of study; and permission of Project Management Program Director.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM740","T":"TCM 740 Management of Innovation and Technology","D":"Focuses on the strategic management of technology and innovation in organizations. Builds primarily on broad models of technological evolution and organizational change. Students analyze crucial organizational innovation and technology issues and identify concrete managerial actions to address innovation and technology problems and opportunities. ","P":"<em>Prerequisite: acceptance in the Project Management MS program or graduate certificate program; or permission of the Project Management Program Director.</em>","L":"courses_im","O":{"F":false,"S":false,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM750","T":"TCM 750 Advanced Project Management","D":"Builds upon the foundation of prerequisite courses by discussing advanced problems encountered in the discipline of project management in a seminar format. Practical examination of projects using the criteria of project excellence and project management maturity models. Students are expected to demonstrate the ability to apply the knowledge and experience gained in their program of study to the critical evaluation and analysis of the theory, research and practice of project management. ","P":"<em>Prerequisite: TCM 701; and a total of 12 graduate hours in the Project Management MS program of study.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM760","T":"TCM 760 Special Investigations","D":"The student in consultation with the advisor selects for in-depth study an area determined by the interest and background of the students. Based on demand and timeliness of the subject a cluster study group may engage in a joint investigation. May be repeated to a total of 5 hours. ","P":"<em>Prerequisite: permission of Project Management Program director.</em>","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM792","T":"TCM 792 Graduate Internship","D":"Educational experience in cooperation with student&apos;s full-time employer. Written, oral, and classroom assignments related to workplace improvement. May be repeated, but no more than 6 hours may be counted as credit toward a masters degree. ","P":"<em>Prerequisite: permission of Project Management Program Director.</em>","L":"courses_im","O":{"F":true,"S":true,"M":true},"H":{"C":3,"E":3,"L":0}}
{"I":"TCM798","T":"TCM 798 Research","D":"Supervised research in technology. May be repeated, but not more than 3 hours may be counted toward a masters degree. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of Project Management Program Director.</em>","L":"courses_im","O":{"F":true,"S":true,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"TCM799","T":"TCM 799 Thesis","D":"Preparation of a thesis. May be repeated, but no more than 3 hours may be counted as credit toward a masters degree. Graded Pass/Not Pass only. ","P":"<em>Prerequisite: permission of Project Management Program Director.</em>","L":"courses_im","O":{"F":true,"S":true,"M":true},"H":{"C":1,"E":0,"L":0}}
{"I":"HID140","T":"HID 140 Fundamentals of Design and Interiors","D":"Art principles and elements applied to interior environments. Projects will expose the student to interior design skills, basic drafting techniques, design terminology, space planning, materials and applications. Interior design as a profession will be discussed. ","P":"","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"HID201","T":"HID 201 Studio I","D":"Space planning and design for both residential design and commercial design. This course will cover interior design specifications, material, and green design. ","P":"<em>Prerequisite: HID 140.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"HID202","T":"HID 202 Studio II","D":"Residential design projects with emphasis on color and light, presentation techniques as well as universal design. ","P":"<em>Prerequisite: HID 140 and HID 201 and HID 208.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"HID208","T":"HID 208 CAD for Interior Design","D":"An overview of AutoCAD, SketchUp, and other relevant software. Both 2- and 3- dimensional aspects are covered in order to design a structure. Design project required. ","P":"<em>Prerequisite: HID 140 or TCM 221.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"HID241","T":"HID 241 Residential Design I","D":"The design of a residence including the drawing of floor plans and the study of both structural and decorative aspects. Public Affairs Capstone Experience course. ","P":"<em>Prerequisite: HID 140 or concurrent enrollment.</em>","L":"courses_im","O":{"F":true,"S":true,"M":false},"H":{"C":3,"E":2,"L":2}}
{"I":"HID300","T":"HID 300 Special Topics in Housing and Interior Design","D":"Selected topics of contemporary interest in housing and interior design. Offered when resources and demand allow. May be repeated for a total of 6 hours when topics change. Variable Content Course. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"HID302","T":"HID 302 Housing and Interior Design Study Tour","D":"Study of and visits to museums, international hospitality tours, historic sites, trade shows, conferences, and conventions related to the interior design industry. May be taken for a total of 6 hours. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"HID303","T":"HID 303 Studio III","D":"Kitchen and bath designs and materials, preparing for the National Kitchen and Bath Association certification. Addresses kitchen and bath systems, products, and planning. Also, drawing, design principles, project and business management for kitchen and bath. ","P":"<em>Prerequisite: HID 241.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"HID304","T":"HID 304 Studio IV","D":"Hotel, restaurant and healthcare design. The interior design of lounges and public dining facilities, guest lodging facilities from urban hotels to resorts, hospital and healthcare interior design using codes and universal design principles. ","P":"<em>Prerequisite: HID 201.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"HID325","T":"HID 325 Pre-Internship Seminar","D":"Sourcing and acquisition of an internship are examined. Includes resume writing, phone, email and correspondence etiquette, and interview skills. ","P":"<em>Prerequisite: HID 201 or concurrent enrollment; and HID 241.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":1,"E":1,"L":0}}
{"I":"HID340","T":"HID 340 Sustainable Design","D":"Examines sustainable design and building practices employed in residential and commercial structures. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"HID344","T":"HID 344 Historical Design Pre 19th Century","D":"Ancient, Medieval, and Renaissance art, furnishings, and decorative design with emphasis on historical relevance for the 21st century. ","P":"","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"HID346","T":"HID 346 Historical Design: 19th - 21st Century","D":"An overview of interiors, furnishings, and related structure design during the 19th - 21st century with emphasis on historical relevancy for the 21st century. ","P":"","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":3,"L":0}}
{"I":"HID400","T":"HID 400 Problems in Housing and Interior Design","D":"Independent study for those who wish additional work in specific subject areas. ","P":"","L":"courses_im","O":{"F":false,"S":false,"M":false},"H":{"C":1,"E":0,"L":0}}
{"I":"HID405","T":"HID 405 Studio V","D":"Retail design and display and presentation techniques design from store planning to merchandise display. ","P":"<em>Prerequisite: HID 140.</em>","L":"courses_im","O":{"F":true,"S":false,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"HID406","T":"HID 406 Studio VI","D":"Advanced presentation techniques, digital portfolio and models. ","P":"<em>Prerequisite: HID 208.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"HID408","T":"HID 408 Computer Applications for Interior Design","D":"Various computer programs with an emphasis on presentation and portfolios. ","P":"<em>Prerequisite: HID 208.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":3,"E":0,"L":6}}
{"I":"HID424","T":"HID 424 Business Practices","D":"Business principles and practices of interior design and Senior Show. Supplemental course fee. ","P":"<em>Prerequisite: HID 201 and HID 405 and LAW 231 and ACC 201; and 90 hours.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":2,"L":0}}
{"I":"HID441","T":"HID 441 National Council of Interior Design Qualifications (NCIDQ) and Senior Show","D":"Study of NCIDQ written and practical exams. ","P":"<em>Prerequisite: HID 201 and HID 405; and 90 hours.</em>","L":"courses_im","O":{"F":false,"S":true,"M":false},"H":{"C":2,"E":1,"L":2}}
{"I":"HID499","T":"HID 499 Internship in Interior Design","D":"Off-campus, supervised experiences in a cooperative program with a kitchen and bath and/or interior design firm. The student is required to attend a beginning orientation, maintain weekly journals, communication with their faculty advisor and complete the assigned academic work and project appropriate to the experience. The student must work a minimum of 240 hours for a 4 credit hour internship and a minimum of 320 hours for a 6 credit hour internship. ","P":"<em>Prerequisite: HID 201 and HID 241 and HID 325.</em>","L":"courses_im","O":{"F":false,"S":false,"M":true},"H":{"C":4,"E":0,"L":0}}
